{
    "job": {
        "title": "Data Scientist",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "&lt;strong&gt;&lt;u&gt;Company Overview&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;Fractal Analytics is a strategic AI partner to Fortune 500 companies with a vision to power every human decision in the enterprise. Fractal is building a world where individual choices, freedom, and diversity are the greatest assets. An ecosystem where human imagination is at the heart of every decision. Where no possibility is written off, only challenged to get better. We believe that a true Fractalite is the one who empowers imagination with intelligence.&lt;br&gt;&lt;br&gt;&lt;strong&gt;Data Scientist&lt;br&gt;&lt;br&gt;&lt;/strong&gt;As a Data Scientist, you will be part of Fractal's fast growing Global Retail practice working with a team of consultants, engineers &amp;amp; developers to design, architect, build, test &amp;amp; operationalize visualization projects. The role will be responsible for innovating, building and maintaining high standards of delivery for our Fortune 500 clients.&lt;br&gt;&lt;br&gt;&lt;strong&gt;Qualifications &amp;amp; Experience:&lt;br&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;3+ years of experience in Data Science&lt;/li&gt;&lt;li&gt;Proven ability to ingest and manipulate data in Visualization tools, using complex SQL queries &lt;/li&gt;&lt;li&gt;Ability to convert data, write complex SQL queries and tabular models, that support reports and dashboards across an enterprise environment&lt;/li&gt;&lt;li&gt;Respond to immediate needs and pull ad hoc data sets&lt;/li&gt;&lt;li&gt;Excellent communication skills. Able to effectively communicate and work with both users and technical audiences&lt;/li&gt;&lt;li&gt;Experience with SQL/Python, or other data-centric programming language, is required&lt;br&gt;&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;&lt;u&gt;Skills/Tools/Platform&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;strong&gt;&lt;em&gt;Must Have&lt;/em&gt;:&lt;/strong&gt; SQL, Python&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;em&gt;Good to Have&lt;/em&gt;:&lt;/strong&gt; Databricks, Tableau, PPT, XLS&lt;br&gt;&lt;br&gt;&lt;strong&gt;Education&lt;br&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;Bachelors or equivalent experience in statistics, computer science, engineering, informatics, data science, or related field; Additional business degree is a plus.&lt;br&gt;&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;em&gt;Fractal Analytics provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.&lt;/em&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-06T23:10:01.000Z"
    },
    "company": {
        "name": "Fractal",
        "link": "https://www.linkedin.com/company/fractal-analytics"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco",
        "region": "CA",
        "postal_code": "94121",
        "street_address": null,
        "latitude": 37.78008,
        "longitude": -122.42016
    }
}