{
    "job": {
        "title": "Machine Learning Engineer – Apple Maps Search",
        "industry": "Consumer Electronics",
        "description": "&lt;br&gt;&lt;strong&gt;Summary&lt;br&gt;&lt;/strong&gt; &lt;br&gt;Apple Maps are being used by millions of users every single day and powers thousands of applications. As a fundamental tool for human activity, Maps technology is evolving and new techniques are emerging. As a part of Apple Maps search team, you will play a big part in the next revolution in maps to enable users to find things in maps by working in a high-performing and collaborative environment. You will have plenty of opportunities to create groundbreaking technologies using machine learning at scale to improve the search quality for Apple Maps. This is an ideal role for someone who is passionate about search, cares about innovation, software craftsmanship, building high performance software products, always thinking about optimizing software for best utilization of resources and provide a high quality of customer experience by providing the best search results.&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Key Qualifications&lt;br&gt;&lt;/strong&gt; &lt;br&gt;Experience in applying machine learning in information retrieval domain such as search engines, natural language processing, or similar areas.&lt;br&gt;&lt;br&gt;Strong programming experience in one or more of the following: Java, C++, Python or equivalent.&lt;br&gt;&lt;br&gt;Excellent interpersonal and communication skills.&lt;br&gt;&lt;br&gt;Outstanding problem solving and analytical skills.&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Description&lt;br&gt;&lt;/strong&gt; &lt;br&gt;The goal of Maps Search team is to take Apple’s Maps to the next level of intelligence and accuracy using advanced machine learning and artificial intelligence techniques. Engineers and scientists on this team work on a wide spectrum of approaches in improving search experience on Apple Maps. &lt;br&gt;&lt;br&gt;&lt;br&gt;You will be working closely with data, and analytics teams to develop applied machine learning algorithms and models that help improve search relevance and experience. You would also work on developing scalable tools and platform foundations that enable other engineers and scientists to develop, evaluate and release algorithms, models and features quickly. You will participate in design and code reviews and work with engineers and QA to deliver high quality search experience to our customers.&lt;br&gt;&lt;br&gt;&lt;br&gt;This position involves a wide variety of skills and innovation, and is a unique opportunity that sits at the cutting-edge of machine learning and information retrieval techniques. Ultimately, your work would have a huge impact on millions of users across the globe.&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Education &amp;amp; Experience&lt;br&gt;&lt;/strong&gt; &lt;br&gt;BS/MS in Computer Science or equivalent. PhD preferred.&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Additional Requirements&lt;br&gt;&lt;/strong&gt; &lt;br&gt;Experience/knowledge of search technology and related fields (preferred).&lt;br&gt;&lt;br&gt;Experience/knowledge of maps technology and related fields (preferred).&lt;br&gt;&lt;br&gt; &lt;br&gt;Role Number: 200247028&lt;br&gt;&lt;br&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-30T09:26:57.000Z"
    },
    "company": {
        "name": "Apple",
        "link": "https://www.linkedin.com/company/apple"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Cupertino",
        "region": "CA",
        "postal_code": "95014",
        "street_address": null,
        "latitude": 37.319313,
        "longitude": -122.02927
    }
}