{
    "job": {
        "title": "Software Engineer I",
        "industry": "Telecommunications",
        "description": "Sparklight, a member of the Cable One family of companies, is looking for a committed, helpful, proactive Software Engineer to design, build and deploy solutions and enhancements to existing systems with very specific requirements, clearly defined APIs, and with existing example solutions and code. Additionally, this position will maintain updated troubleshooting and equipment-related documentation and support escalations from the Application Support Team.&lt;br&gt;&lt;br&gt;&lt;strong&gt;What this position does to contribute to the Company’s success&lt;br&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;Analyzes and develops systems and technology-based OSS/BSS solutions to meet user needs including applications, databases and related systems.&lt;/li&gt;&lt;li&gt;Maintains and troubleshoots systems such as applications (custom and 3rd party), reports and/or database logic.&lt;/li&gt;&lt;li&gt;Advanced Report/Query design and creation.&lt;/li&gt;&lt;li&gt;Manages and troubleshoots support tickets escalated by the Product Software Specialists.&lt;/li&gt;&lt;li&gt;Provides escalation monitoring, troubleshooting and resolution of issues escalated from other organizations within the company.&lt;/li&gt;&lt;li&gt;Examines, evaluates, troubleshoots, applications deployed to Windows or Unix servers to include Log analysis.&lt;/li&gt;&lt;li&gt;Troubleshoots application and interface communications over an IP network.&lt;/li&gt;&lt;li&gt;Analyzes project requests to estimate time and cost required to accomplish project.&lt;/li&gt;&lt;li&gt;Works as part of a project team to coordinate software environments and determine project scope and limitations.&lt;/li&gt;&lt;li&gt;Takes on other duties needed to help drive our Purpose, fulfill our Brand Principles, and abide by our Organization’s Values.&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;&lt;u&gt;Qualifications&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;One year of related experience or training/education in application development programming languages such as .NET or Java.&lt;/li&gt;&lt;li&gt;Two years or more experience as a developer on large scale integrated multi-system environments preferred.&lt;/li&gt;&lt;li&gt;Beginner level certification in programming languages such as .Net, Java, Python, or Angular.&lt;/li&gt;&lt;li&gt;Excellent computer skills including Microsoft Excel and Microsoft Word.&lt;/li&gt;&lt;li&gt;Must be a self-starter with excellent problem-solving and troubleshooting skills.&lt;/li&gt;&lt;li&gt;Ability to occasionally work on-call after hours and on weekends.&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;Why join Sparklight?&lt;br&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt; Medical and dental insurance start from date of hire (no waiting period!) &lt;/li&gt;&lt;li&gt; Competitive total compensation package &lt;/li&gt;&lt;li&gt; Annual incentive bonus targeted at 5% of your pay &lt;/li&gt;&lt;li&gt; 401k with company match program (100% match, up to 5% of salary) &lt;/li&gt;&lt;li&gt; Paid Vacation, Holidays, Personal/Sick Days, and Angel Day (time off to volunteer) &lt;/li&gt;&lt;li&gt; Tuition Reimbursement ($5,250 right away; $10,000 after 5 years!) &lt;/li&gt;&lt;li&gt; Up to seventy-five dollars a month towards cable and internet services &lt;br&gt;&lt;/li&gt;&lt;/ul&gt;Diversity lies in the communities we serve and among the associates who dedicate themselves to ensure our continued success. At Cable One and our family of companies, we believe it is our individual and unique talents, backgrounds, and perspectives that, when combined, truly make us an unstoppable force. 'Stronger Together' is not just a verbal cue, it is the motto that our associates live by, exemplify and embody each and every day. Cable One provides equal employment opportunities to all individuals of different races, colors, creeds, national origins, genders, marital and veteran statuses.&lt;br&gt;&lt;br&gt;&lt;em&gt;By submitting your interest in this job, you agree to receive text notifications with additional steps to complete your job application. You will receive up to 6 messages from the number \"63879\". Message &amp;amp; data rates may apply. Please refer to our privacy policy for more information.&lt;/em&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-12T00:00:00.000Z"
    },
    "company": {
        "name": "Sparklight",
        "link": "https://www.linkedin.com/company/mysparklight"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Phoenix",
        "region": "AZ",
        "postal_code": "85009",
        "street_address": null,
        "latitude": 33.448204,
        "longitude": -112.072586
    }
}