{
    "job": {
        "title": "Data Scientist Analyst",
        "industry": "Marketing and Advertising,Information Technology and Services,Computer Software",
        "description": "&lt;strong&gt;Come work with us!&lt;br&gt;&lt;/strong&gt;Join our fast-growing team as a customer-oriented Data Science Analyst and work within a fantastic team. You'll work cross-functionally with other Unsupervised teams and directly with our customers, shepherding them on their journey with Unsupervised.&lt;br&gt;&lt;br&gt;At Unsupervised, you'll be at the cutting edge of AI and data analysis. You'll work with some of the world's largest and most diverse companies, helping teams learn a new skill to make better data-driven decisions. You'll work closely with experts from multiple fields, and you'll join a group of inquisitive, collaborative, and caring individuals that genuinely give a darn about helping our customers get real value from their data.&lt;br&gt;&lt;br&gt;The Data Science Analyst is a great role for a proactive and detail-oriented individual. As a Data Science Analyst, you will work with our account team to plan and configure, multi-stage pipeline driven by the Unsupervised data ingestion and AI engines. You will also work directly with our customers to explain the data and insights discovered through the Unsupervised platform. You will be integral to building trust in Unsupervised's ability to unleash the power of their data and empower their teams using data-driven decision-making, ultimately driving incredible ROI.&lt;br&gt;&lt;br&gt;&lt;strong&gt;What you'll do:&lt;br&gt;&lt;br&gt;&lt;/strong&gt;&lt;ul&gt; &lt;li&gt;Apply data-centric and analytical techniques to real-world data: from data ingestion, configuring and running the Unsupervised AI platform, and delivering insights for our customers. &lt;/li&gt; &lt;li&gt;Work cross-functionally with the account team to influence our customers to solve business problems with data.&lt;/li&gt; &lt;li&gt;Understand your customers and their industries, and ensure their unique needs are always being discovered and addressed.&lt;/li&gt; &lt;li&gt;Develop intuition about different types of data and projects. Guide the success team towards solutions. &lt;/li&gt; &lt;li&gt;As the primary user of our internal tools, you'll be uniquely positioned to inform our product functionality.&lt;/li&gt; &lt;li&gt;Champion continuous improvement by identifying and providing recommendations for technical delivery processes.&lt;/li&gt; &lt;br&gt;&lt;/ul&gt;&lt;strong&gt;What you'll bring:&lt;br&gt;&lt;br&gt;&lt;/strong&gt;&lt;ul&gt; &lt;li&gt;Customer orientation. You have experience in business intelligence or data science projects and interfacing with customers or key internal stakeholders.&lt;/li&gt; &lt;li&gt;Results-driven. You're a natural-born executor who loves making to-do lists and getting projects done. When you hit a problem, you have multiple ideas for ways to fix it. &lt;/li&gt; &lt;li&gt;Excellent communication skills, both written and verbal. You must be able to communicate with all users, from technologists to VPs and CxOs&lt;/li&gt; &lt;li&gt;Strong interpersonal skills. You will work closely and productively with multiple stakeholders at each customer and internally at Unsupervised.&lt;/li&gt; &lt;li&gt;Strategic thinking. You strive to understand each customer's unique organizational requirements and customize a project plan that helps them quickly realize value while being set up for long-term success.&lt;/li&gt; &lt;li&gt;Accountability. You'll shoulder the technical responsibility of making each customer successful and should both welcome that level of ownership and love solving specific customer challenges.&lt;/li&gt; &lt;li&gt;Process. You will have familiarity with the full software project lifecycle, with a focus on implementation and adoption.&lt;/li&gt; &lt;br&gt;&lt;/ul&gt;&lt;strong&gt;What you'll need: &lt;br&gt;&lt;br&gt;&lt;/strong&gt;&lt;ul&gt; &lt;li&gt;2-3 years of professional experience as a business intelligence analyst, data science analyst, or aspiring data scientist&lt;/li&gt; &lt;li&gt;Experience working with customers, setting expectations, and meeting commitments.&lt;/li&gt; &lt;li&gt;Experience with Python&lt;/li&gt; &lt;li&gt;Experience working with disparate enterprise data.&lt;/li&gt; &lt;br&gt;&lt;/ul&gt;&lt;strong&gt;Preferred: &lt;br&gt;&lt;br&gt;&lt;/strong&gt;&lt;ul&gt; &lt;li&gt;Experience with Pandas and Jupyter. &lt;/li&gt; &lt;br&gt;&lt;/ul&gt;&lt;strong&gt;Compensation Range:&lt;/strong&gt; $80k - $105k plus generous equity",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-16T05:13:06.000Z"
    },
    "company": {
        "name": "Unsupervised",
        "link": "https://www.linkedin.com/company/unsupervisedai"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Boulder",
        "region": "CO",
        "postal_code": "80310",
        "street_address": null,
        "latitude": 40.016872,
        "longitude": -105.279625
    }
}