{
    "job": {
        "title": "Solution Architect",
        "industry": "Marketing and Advertising,Information Technology and Services,Computer Software",
        "description": "&lt;strong&gt;SOLUTION ARCHITECT&lt;br&gt;&lt;br&gt;&lt;/strong&gt;Be a part of our success story. Launch offers talented and motivated people the opportunity to do the best work of their lives in a dynamic and growing company. Through competitive salaries, outstanding benefits, internal advancement opportunities, and recognized community involvement, you will have the chance to create a career you can be proud of. Your new trajectory starts here at Launch.&lt;br&gt;&lt;br&gt;Launch is looking for a Solution Architect to provide support for a high volume and fast paced organization.&lt;br&gt;&lt;br&gt;&lt;strong&gt;Responsibilities&lt;br&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;Update warehouse processes (specifically the order-intake process) with tools and systems allowing orders to self-report, restrict customers data entry-options, and overall reduce the manual process load.&lt;/li&gt;&lt;li&gt;Examine client systems, existing processes, and attempt to define technical plans for the creation of next generation processes&lt;/li&gt;&lt;li&gt;Will be responsible for creating documentation of the desired solution and collaborating with other team members to understand the processes which must be modernized.&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;&lt;u&gt;Required Experience/Qualifications&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;Solution design from scratch &lt;/li&gt;&lt;li&gt;Document technical needs &lt;/li&gt;&lt;li&gt;Review and collaborate with client technical resources&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;We are Navigators in the Age of Transformation.&lt;br&gt;&lt;br&gt;&lt;/strong&gt;We use sophisticated technology to transform clients to the digital age, but our positive impact on the human experience is our top priority. We ease anxiety and fear around digital transformation and replace it with opportunity.&lt;br&gt;&lt;br&gt;Qualified applicants, please respond to inquire@launchcg.com with your full name, resume, and a brief description of how your skills match the requirements above. &lt;strong&gt;Please refer to job #4790&lt;br&gt;&lt;br&gt;&lt;/strong&gt;Launch Consulting is an Equal Opportunity and Affirmative Action employer.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-15T18:41:32.000Z"
    },
    "company": {
        "name": "Launch Consulting Group",
        "link": "https://www.linkedin.com/company/launch-consulting-group"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Bothell",
        "region": "WA",
        "postal_code": "98012",
        "street_address": null,
        "latitude": 47.76009,
        "longitude": -122.20544
    }
}