{
    "job": {
        "title": "Machine Learning Engineer - Apple Retail Online",
        "industry": "Consumer Electronics",
        "description": "&lt;br&gt;&lt;strong&gt;Summary&lt;br&gt;&lt;/strong&gt; &lt;br&gt;Our Online Retail Decision Automation team is looking for passionate highly motivated, ambitious, and hands-on applied machine learning engineer to lead the way by researching and developing the next generation of algorithms used to drive the Apple Online experience. This spans central areas of our Apple Online Store including developing models for product search, recommendation systems (e.g. ranking, page generation), personalization (e.g. evidence, messaging, marketing), media assets generation and optimizing Apple-wide systems &amp;amp; infrastructure. As a machine learning engineer, you will have the unique and rewarding opportunity to be part of a new projects and shape upcoming products that will delight and inspire millions of Apple’s customers every day.&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Key Qualifications&lt;br&gt;&lt;/strong&gt; &lt;br&gt;2+ years experience as a machine learning engineer&lt;br&gt;&lt;br&gt;Experience in Recommendation Systems, Personalization, Search, Computational Advertising or Natural Language Processing&lt;br&gt;&lt;br&gt;Strong programming skills in Java, C/C++, Python, or similar language&lt;br&gt;&lt;br&gt;Experience developing enterprise production machine learning models &lt;br&gt;&lt;br&gt;Excellent problem solving and analytical skills&lt;br&gt;&lt;br&gt;Excellent communication and collaboration skills&lt;br&gt;&lt;br&gt;Passion for delivering business impact&lt;br&gt;&lt;br&gt;Experience with Spark, TensorFlow, Keras, and PyTorch a plus&lt;br&gt;&lt;br&gt;Experience using Deep Learning, Bandits, Probabilistic Graphical Models, or Reinforcement Learning in real applications a plus&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Description&lt;br&gt;&lt;/strong&gt; &lt;br&gt;As an applied machine learning engineer, you will conceptualize, design, and develop core algorithms that power our buy-flows and personalize the experience across the Apple Online Store. This includes developing production algorithms for search, recommendations and personalization, running offline experiments and building online A/B tests to run in production systems. To be successful in this role, you need a strong machine learning background, solid software development skills, a love of learning, and to collaborate well in multi-disciplinary teams. You will need to exhibit strong communication and leadership skills, an ability to set priorities, and an execution focus in a dynamic environment. &lt;br&gt;&lt;br&gt;The team responsibilities include: model development and deployment on-device and web, developing back-end data pipelines, and producing automation processes for machine learning tasks. You will closely collaborate with other engineering teams (including Hardware, QA, Infrastructure) to ensure the solutions are meeting the highest quality standards.&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Education &amp;amp; Experience&lt;br&gt;&lt;/strong&gt; &lt;br&gt;Ph.D. or Masters in a quantitative field, such as Computer Science, Applied Mathematics, or Statistics, or equivalent professional experience.&lt;br&gt;&lt;br&gt; &lt;br&gt;Role Number: 200264484&lt;br&gt;&lt;br&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-05T16:07:25.000Z"
    },
    "company": {
        "name": "Apple",
        "link": "https://www.linkedin.com/company/apple"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Cupertino",
        "region": "CA",
        "postal_code": "95014",
        "street_address": null,
        "latitude": 37.319313,
        "longitude": -122.02927
    }
}