{
    "job": {
        "title": "Site Reliability Engineer I",
        "industry": "Internet,Information Technology and Services",
        "description": "&lt;strong&gt;&lt;u&gt;About Us&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;Careem is the internet platform for the greater Middle East region. A pioneer of the region's ride-hailing economy, Careem is expanding services across its platform to become the region's everyday Super App. Careem's mission is to simplify and improve the lives of people and build an awesome organisation that inspires. Established in July 2012, Careem operates in over 100 cities across 13 countries and has created more than one million employment opportunities in the region. Careem became a wholly-owned subsidiary of Uber Technologies, Inc. in January 2020!&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;About The Role&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;We are looking for an experienced engineer who will work within the SRE team to take cloud-native technology to the next level within Careem. We need expert, execution-focused engineers to help shape the future of the Careem platform and to help us scale our already sizable effort greatly.&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;What You’ll Need&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;2/3+ years of software engineering and/or operations experience&lt;/li&gt;&lt;li&gt;Experience in architecting, developing, operating and troubleshooting Kubernetes clusters and/or other highly available systems at scale&lt;/li&gt;&lt;li&gt;Good experience of coding and problem solving in at least one of the following programming languages: Go, Python, Java, Rust, C++&lt;/li&gt;&lt;li&gt;Experience with Cloud Infrastructure (AWS preferred)&lt;/li&gt;&lt;li&gt;Experience with infrastructure automation (Infrastructure as Code)&lt;/li&gt;&lt;li&gt;Strong Unix or Linux background, including topics around network stack and scripting&lt;/li&gt;&lt;li&gt;Incident response and/or incident management experience is a plus&lt;/li&gt;&lt;li&gt;Experience on DevOps topics such as monitoring, CI/CD, security is a plus&lt;/li&gt;&lt;li&gt;Effective communication and collaboration skills: have the ability to drive and promote technical partnerships across teams&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;What will keep you busy?&lt;br&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;Work within a lean team in quick iterations on large impactful projects&lt;/li&gt;&lt;li&gt;Collaborate with teams to deliver an efficient cloud-native platform&lt;/li&gt;&lt;li&gt;Ensure infrastructure is scalable, responsive, and reliable&lt;/li&gt;&lt;li&gt;Automate everything with tools and workflows&lt;/li&gt;&lt;li&gt;Evaluate and select tools and technologies needed for efficient support of the systems&lt;/li&gt;&lt;li&gt;Keep our solutions cost-effective by improving performance and increasing utilization&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;What do we offer you?&lt;br&gt;&lt;br&gt;&lt;/strong&gt;Working in an international environment with colleagues from 70+ nationalities, ownership culture, flexible working hours, unlimited (paid!) holidays and the latest technologies.&lt;br&gt;&lt;br&gt;Careem gives equal opportunities. All aspects of ownership including the decision to hire, promote, discipline, or discharge, will be based on merit, competence, performance, and business needs. We celebrate diversity and are committed to creating an inclusive environment for everyone.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-01T18:37:06.000Z"
    },
    "company": {
        "name": "Careem",
        "link": "https://ae.linkedin.com/company/careem"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Jordan",
        "region": "PA",
        "postal_code": "17752",
        "street_address": null,
        "latitude": 41.246445,
        "longitude": -76.53813
    }
}