{
    "job": {
        "title": "Platform Site Reliability Engineer (SRE)",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Dice is the leading career destination for tech experts at every stage of their careers. Our client, Babbage IT, is seeking the following. Apply via Dice today!&lt;br&gt;&lt;br&gt;Duties Responsibilities bull Communicates Architectural decisions, plans, goals, and strategies, while highlighting short-term trade-offs vs. long-term commitments and costs bull Engage in and improve the end-to-end Lifecycle of services, starting from Inception design, deployment, operations, and refinement bull Support activities, including System design consulting, developing software platforms and frameworks, capacity planning, and launch reviews bull Systems Scalability and sustainability leveraging automation and strive to improve our systems with changes that improve reliability and velocity bull Experience with Enterprise Cloud transformation efforts bull Be part of our Cloud journey and as a member of our team help lead Software automation and reliability for our platform bull Actively participate and help guide customers on using Cloud-native design and architecture patterns. bull Provide Consultation on Technology infrastructure planning and engineering for assigned systems Assesses the implications of technology strategies on infrastructure capabilities bull Build strategy to migrate Legacy applications by conversion to multiple Microservices and hosting on AWS Cloud platform. bull Leverage Cloud-native architecture components including Containers, immutable infrastructure, Microservices, Service Mesh etc., to build highly available and Fault tolerant applications. bull Research on the global technology trends and their applicability to FEPOC products in support of our internal development teams and business. bull Promotes and ensures Modern application design, applies engineering best practices in the development and operations life cycle and mitigates vulnerabilities. bull Monitors and manages the Stability, Availability, and Performance of enterprise systems and platforms across IT domains o (e.g., Systems, Network, Storage, Security) by analyzing systems to identify problems, trends, and opportunities for improvement. bull Maintain and continually improve (patch and upgrade) our Cloud-based infrastructure. bull Makes data-driven recommendations and decisions, and continuously improves the overall efficacy and efficiency of our software delivery capability. bull Mentoring peers as well as engaging with others across teams and socializing solutions. ExperienceQualifications bull 10+ years of overall experience in IT including, with hands-on Development and Systems engineering background bull Strong Leadership experience with driving Transformation initiatives bull Experience with Aix to RHELTomcat Transformation efforts bull 3-5 years of experience in a Site Reliability Engineering role bull Experience with SRE principles and transformation bull 3+ years of experience with Containerization (Kubernetes), Cloud technologies (AWS, Azure, or Google, etc.), DevOps tool chain (Ansible, Jenkins, Artifactory, bitbucket, etc.), and technical patterns (IaC, Automated ProvisioningRelease, CICD, etc.) bull Solid understanding of Software coding techniques and experience with full spectrum of Software engineering (Build, Integration, Test, Releasing and Deployment) leveraging Python. bull Experience in Developing andor challenging engineering solutionspractices and collaborating with peers within and outside of immediate team, including customers (Dev, Architects, Engineers) bull Platform Engineering Lead with Hands -on Experience bull Building robust Middleware Environments bull Scripting and process Automation experience bull Extensive knowledge of JavaJ2EE methodology and frameworks bull Extensive RHEL and Scripting experience bull Extensive knowledge of Tomcat bull Knowledge of WAS and MQ Series bull Ability to analyze and trouble-shoot Mid-tierinfrastructure issues. bull Very strong verbal and written communication skills (Critical) bull Ability to facilitate technical requirements gathering and design sessions bull Collaborate and interpret business and technical needs bull Excellent attention to detail and deliver quality work products (Critical) bull Strong Customer service skills with internal and external customers (Critical) bull Must be able to perform assigned tasks independently with minimum supervision (Critical) bull Strong analytical and documentation skills bull Excellent time management ability (Critical) Technical Requirements bull Development Experience programming with one or more languages Python, Java ,Groovy, Go, etc. bull IAC Tools for Platform Automation Strong skills and experience in Ansible, Terraform, Yaml, Rhel, Tomcat bull Containers Docker or other OCI-certified containers bull DevOps Tools Gitbitbucket, Jira, AnsiblePuppet, JenkinsCircleciBamboo, MavenArtifactoryNexus, etc. bull Others o Understanding of Cloud Native Architecture o Linux, Shell scripting, and general admin skills o Network, Security, Plugins, Storage Skills o AWS skills EC2, S3, EBS, EFS, IAM, VPC, Lambda etc. o Experience with DEVOPS or IAAS o AIX o LDAP o EIAM (Identity Access Management) o Network o IBM DataPower o Pega or Rules Engine",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-09-08T01:20:39.000Z"
    },
    "company": {
        "name": "Dice",
        "link": "https://www.linkedin.com/company/dice"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Washington",
        "region": "DC",
        "postal_code": "20398",
        "street_address": null,
        "latitude": 38.892063,
        "longitude": -77.01991
    }
}