{
    "job": {
        "title": "Data Scientist ",
        "industry": "Information Technology and Services",
        "description": "&lt;p&gt;&amp;nbsp;&lt;strong&gt;Data Scientist&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;p&gt;Our Client is building the next generation of Big Data analytical platforms, integrating multiple, large-scale data sources and a set of data products to leverage Big Data platforms.&lt;/p&gt;&lt;p&gt;We are looking for a Data Scientist who is highly self-driven and able to interact with a world-class research and development organization.&lt;/p&gt;&lt;p&gt;This role implies hands-on use of cutting-edge technologies in the space of Big Data analytics, machine learning and data visualization.&lt;/p&gt;&lt;p&gt;It is important that our candidate has a strong background in statistics, acute business sense and practical programming skills. We expect the candidate to be a highly motivated and result-focused individual.&lt;/p&gt;&lt;p&gt;A successful candidate for this role will have a wide interdisciplinary professional&amp;nbsp;skill-set. The candidate will be proficient in turning data discoveries into profitable products and measurable improvements for our business partners, in short development cycles.&lt;/p&gt;&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;The job implies:&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Researching Client and industry Big Data sources to identify potential applications and patterns&lt;/li&gt;&lt;li&gt;Researching and evaluating the feasibility of Big Data applications&lt;/li&gt;&lt;li&gt;Analyzing&amp;nbsp;large amounts of data from different domains&amp;nbsp;&lt;/li&gt;&lt;li&gt;Involvement in a process of designing and developing data-driven products&lt;/li&gt;&lt;li&gt;Working closely with an array of various teams and organizations in the organization to collect requirements and design solution architectures&lt;/li&gt;&lt;li&gt;Implementing of machine learning software systems and tools using industry-standard infrastructures and libraries, and up-to-date software development practices.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Required Skills:&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;At least 2 years’ experience in Data Science/Big Data Analytics/Data Engineering&lt;/li&gt;&lt;li&gt;Strong expertise in mathematical Statistics, advanced statistical modeling, machine learning systems, computer programming and automated reasoning algorithmic solutions&amp;nbsp;&lt;/li&gt;&lt;li&gt;Experience in Big Data ETL processes, data visualization, data exploring algorithms&lt;/li&gt;&lt;li&gt;Experience in data modeling and data management, analytical tools, languages and libraries (languages (MATLAB/Octave, Excel, R, Python + Scikit-learn + pandas, WEKA, MLLib etc.).&amp;nbsp;&lt;/li&gt;&lt;li&gt;Excellent interpersonal and communication&amp;nbsp;skills, high teamwork ability&lt;/li&gt;&lt;li&gt;Bachelor's in Mathematics/Statistics/Computer Science&lt;/li&gt;&lt;li&gt;Strong Acquaintance with Big Data architectures and technology including OpenStack, Hadoop, Pig, Hive, H-base, Spark, Elasticsearch,&amp;nbsp;or other big data platforms&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Additional:&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Relevant Exact/Natural Sciences Master’s degree or above--an advantage&lt;/li&gt;&lt;li&gt;Experience in real-time analytics, NoSQL data stores--an advantage&lt;/li&gt;&lt;li&gt;Experience in the telecommunications industry--an advantage&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&amp;nbsp;&lt;/p&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-14T16:52:14.000Z"
    },
    "company": {
        "name": "Apex Systems",
        "link": "https://www.linkedin.com/company/apex-systems"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Raleigh",
        "region": "NC",
        "postal_code": "27699",
        "street_address": null,
        "latitude": 35.781303,
        "longitude": -78.64168
    }
}