{
    "job": {
        "title": "Data Scientist",
        "industry": "",
        "description": "People Products Data Scientist:&lt;br&gt;&lt;br&gt;• The People Engineering Data Science Team focuses on 1) helping Facebook to find awesome new Facebookers and 2) once they join us helping them grow and develop their career. Our focus is on making Facebook the best place to work. We build internal tools, on areas like Recruiting, Performance, Learn, Grow. We work closely with our product teams and other stakeholders and as a Data Scientist, there's a great opportunity to shape how Facebook (and the industry) thinks about core People issues (such as performance, engagement, mobility).&lt;br&gt;• The People Product Data Science team is part of the People Insights team which includes DS, DE and UXR for people products and recruitment products. We benefit from the close collaboration with our DE and UXR partners to combine data insights with qualitative insights.&lt;br&gt;&lt;br&gt;Job Responsibilities:&lt;br&gt;&lt;br&gt;• Apply your expertise in quantitative analysis, data mining, and the presentation of data to see beyond the numbers and understand how our employees interact with our internal products.&lt;br&gt;• Partner with Product and Engineering teams to solve problems and identify trends and opportunities.&lt;br&gt;• Inform, influence, support, and execute our product decisions and product launches.&lt;br&gt;The Data Scientist Analytics role has work across the following four areas:&lt;br&gt;• Product Operation: forecasting and setting product team goals, designing and evaluating experiments, monitoring key product metrics, understanding root causes of changes in metrics, building and analyzing dashboards and reports, building key data sets to empower operational and exploratory analysis, evaluating and defining metrics&lt;br&gt;• Exploratory Analysis: proposing what to build in the next roadmap, understanding ecosystems, user behaviors, and long-term trends, identifying new levers to help move key metrics, building models of user behaviors for analysis or to power production systems&lt;br&gt;• Product Leadership: influencing product teams through presentation of data-based recommendations, communicating state of business, experiment results, etc. to product teams, spreading best practices to analytics and product teams&lt;br&gt;• Data Infrastructure: working in Hadoop and Hive primarily, sometimes MySQL, Oracle, and Vertica, automating analyses and authoring pipelines via SQL and Python based ETL framework&lt;br&gt;Minimum Qualifications:&lt;br&gt;&lt;br&gt;• 4+ years’ experience doing quantitative analysis within a large-scale company or fast-paced environment.&lt;br&gt;• BA/BS in Computer Science, Math, Physics, Engineering, Statistics or other technical field.&lt;br&gt;• Experience in SQL or other programming languages.&lt;br&gt;• Development experience in any scripting language (PHP, Python, Perl, etc.)&lt;br&gt;• Experience communicating the results of analyses with product and leadership teams to influence the strategy of the product.&lt;br&gt;• Knowledge of statistics (e.g., hypothesis testing, regressions)&lt;br&gt;• Experience manipulating data sets through statistical software (e.g., R, SAS) or other methods.&lt;br&gt;Preferred Qualifications:&lt;br&gt;&lt;br&gt;• Advanced degrees&lt;br&gt;• Experience with distributed computing (Hive/Hadoop)&lt;br&gt;• Experience working within the tech sector preferred&lt;br&gt;",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-10-05T17:10:15.000Z"
    },
    "company": {
        "name": "SGS Consulting",
        "link": "https://www.linkedin.com/company/sgs-consulting"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Seattle",
        "region": "WA",
        "postal_code": "98133",
        "street_address": null,
        "latitude": 47.60323,
        "longitude": -122.33028
    }
}