{
    "job": {
        "title": "Software Engineer",
        "industry": "Information Technology and Services",
        "description": "&lt;p&gt;&lt;strong&gt;Description:&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Design, develop, test and implement technology solutions utilizing AWS technologies.&lt;/li&gt;&lt;li&gt;Ensure technology solutions comply with enterprise architecture standards and principles while identifying opportunities for application reuse and extensibility.&lt;/li&gt;&lt;li&gt;Works with diverse technologies to design, develop (build), test, and implement automated solutions for existing and new software.&lt;/li&gt;&lt;li&gt;Provides production support of current applications and collaborates with other developers in order to mature process and reduce technical debt.&lt;/li&gt;&lt;li&gt;Collaborates with business areas to develop a thorough understanding of business processes, identify application development solutions, enhance new or existing applications, integrate purchased or System solutions to meet business requirements.&lt;/li&gt;&lt;li&gt;Documents, analyzes and resolves problems, tests, implements, provides on-going support and assists in responding to audit reviews and findings for existing applications/software.&lt;/li&gt;&lt;li&gt;Applies the appropriate software/system development life cycle methodology; collaborates with others in development work to achieve desired results; provides planning, estimation, and management of medium to high complexity projects using established methodologies and practices.&lt;/li&gt;&lt;li&gt;Researches, evaluates, and recommends application programming solutions, identifies ways to reuse existing code, and designs prototypes using current or emerging technologies.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Education:&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Bachelor’s degree or equivalent combination of education and experience; major or coursework in Computer Science or Management Information Systems (MIS) is preferred.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Experience:&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Minimum of 1-2 years of real world experience in application development using current technology trends and architectural development solutions.&lt;/li&gt;&lt;li&gt;AWS Cloud Native Solutions development&lt;/li&gt;&lt;li&gt;AWS Serverless Solutions including: Lambda, Dynamo DB, API Gateway&lt;/li&gt;&lt;li&gt;Experience with 1 or more functional and typed languages: Typescript, Javascript, C#, JAVA&lt;/li&gt;&lt;li&gt;Unit testing frameworks Advanced analytical skills and the ability to manage multiple projects/priorities are needed.&lt;/li&gt;&lt;li&gt;Strong oral, written, and interpersonal skills are needed.&lt;/li&gt;&lt;li&gt;Must be comfortable working in an iterative development, highly collaborative environment with the ability to lead from various aspects of the SDLC process.&lt;/li&gt;&lt;/ul&gt;",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-12T15:21:45.000Z"
    },
    "company": {
        "name": "Zinncorp",
        "link": "https://www.linkedin.com/company/zinncorp"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Greater Minneapolis-St. Paul Area",
        "region": null,
        "postal_code": "55401",
        "street_address": null,
        "latitude": 44.981667,
        "longitude": -93.27795
    }
}