{
    "job": {
        "title": "Senior Security Researcher (REMOTE)",
        "industry": "Consumer Electronics",
        "description": "&lt;br&gt;&lt;strong&gt;Summary&lt;br&gt;&lt;/strong&gt; &lt;br&gt;This role is 100% remote.&lt;br&gt;&lt;br&gt;&lt;br&gt;Apple is looking for a world-class security researcher to join our team dedicated to analyzing threat actor capabilities and tradecraft. Apple’s Security Engineering &amp;amp; Architecture (SEAR) provides operating system security foundations across all of Apple’s innovative products. These foundations exist from the lowest levels of the device to the services off-device which work together to protect our users. Our team supports SEAR with information critical to solving some of our biggest security engineering challenges. This position will be remote.&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Key Qualifications&lt;br&gt;&lt;/strong&gt; &lt;br&gt;Strong reverse engineering experience using tools such as IDA Pro or Ghidra, and developing plug-ins&lt;br&gt;&lt;br&gt;Experience with developing proof of concepts for common vulnerabilities, bypassing anti-exploitation protections&lt;br&gt;&lt;br&gt;Exposure to kernel programming&lt;br&gt;&lt;br&gt;Proficiency in analyzing crash reports and diagnostic information&lt;br&gt;&lt;br&gt;Excellent verbal and written communication&lt;br&gt;&lt;br&gt;5+ years of relevant experience&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Description&lt;br&gt;&lt;/strong&gt; &lt;br&gt;You will have a broad set of skills that make you successful as threats continue to evolve, and will be directly involved in Apple's response to critical issues as they arise. From reverse engineering an exploit, providing insightful analysis, creating innovative tools, consulting with other teams on both software and hardware, the job is as diverse as it is essential. This position requires someone with exceptional technical skills and a deep passion for protecting users.&lt;br&gt;&lt;br&gt;&lt;br&gt;Protecting over a billion endpoints. Touching the lives of everyone who interacts with our products. Working for a company whose commitment to user privacy is at the heart of everything it does. Being surrounded by the most creative, passionate, talented people in the industry. Constantly being challenged to go beyond the norm to find new, innovative ways of solving problems and to make software safer, easier, and more fun to use. You can find all of this in one opportunity, and only at Apple.&lt;br&gt;&lt;br&gt; &lt;br&gt;Role Number: 200241336&lt;br&gt;&lt;br&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-01T07:44:28.000Z"
    },
    "company": {
        "name": "Apple",
        "link": "https://www.linkedin.com/company/apple"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Cupertino",
        "region": "CA",
        "postal_code": "95014",
        "street_address": null,
        "latitude": 37.319313,
        "longitude": -122.02927
    }
}