{
    "job": {
        "title": "Research Scientist, Circuit Design",
        "industry": "Internet",
        "description": "Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities - we're just getting started.&lt;br&gt;&lt;br&gt;Facebook AR/VR focuses on delivering Facebook's vision through Augmented Reality (AR) and Virtual Reality (VR). The compute performance and power efficiency requirements of Virtual and Augmented Reality require custom silicon. Facebook Silicon team is driving the state of the art forward with breakthrough work in computer vision, machine learning, mixed reality, graphics, displays, sensors, and new ways to map the human body. Our chips will enable AR and VR devices where our real and virtual world will mix and match throughout the day. We believe the only way to achieve our goals is to look at the entire stack, from transistor, through architecture to firmware and algorithms. On this role you will work with a world-class group of researchers creating low power and energy efficient circuits and systems in advanced CMOS process nodes for our next generation AR/VR integrated systems. This role is based out of our Menlo Park, CA campus.&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;Responsibilities&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;Design and develop new circuit architectures for low power integration.&lt;/li&gt;&lt;li&gt;Chip top level architecture description.&lt;/li&gt;&lt;li&gt;Estimate, at architectural level, architecture and emerging technologies performances.&lt;/li&gt;&lt;li&gt;Functional verification at RTL level.&lt;/li&gt;&lt;li&gt;Explore applications mapping at HW level to estimate performances.&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;Minimum Qualification&lt;br&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;PhD in EE or equivalent experience.&lt;/li&gt;&lt;li&gt;2+ years experience as an IC Research Designer and Architect with digital/mixed signal experience.&lt;/li&gt;&lt;li&gt;Experience with chip design flow and chips tape-out.&lt;/li&gt;&lt;li&gt;Experience in mixed-signal design and top level mixed-signal integration constraints.&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;&lt;u&gt;Preferred Qualification&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;Exposure to new emerging technologies like 3D integration and non-volatile memories.&lt;/li&gt;&lt;li&gt;Experience with embedded learning architectures and circuits or AR applications.&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;Facebook is proud to be an Equal Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Facebook is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-23T06:13:24.000Z"
    },
    "company": {
        "name": "Facebook",
        "link": "https://www.linkedin.com/company/facebook"
    },
    "education": {
        "required_credential": null
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Sunnyvale",
        "region": "CA",
        "postal_code": "94089",
        "street_address": null,
        "latitude": 37.373676,
        "longitude": -122.036575
    }
}