{
    "job": {
        "title": "Social Media Marketing Intern",
        "industry": "",
        "description": "&lt;p&gt;&lt;strong&gt;&lt;u&gt;The Tease&amp;nbsp;Media: Company Background&lt;/u&gt;&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;The Tease is an inclusive digital media brand informed by insight, curiosity and commentary on all things hair, beauty and pop-culture. We keep professionals and consumers in-the-know and on-trend with smart, candid reporting, exclusive editorial content and podcasts.&lt;/p&gt;&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;&lt;u&gt;Position Overview&lt;/u&gt;&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;The Tease Media team is seeking a Social Media Intern to support the day-to-day operations for the brands social media platform in order to inspire and engage our audience, expand our reach and drive conversions.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;&lt;u&gt;The Social Media Intern Will&lt;/u&gt;&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Write, edit and produce highly engaging daily posts for each social platform, including Facebook, Instagram and TikTok&lt;/li&gt;&lt;li&gt;Cultivate an engaged audience with high-touch communication with users across public platforms and in comment threads and DMs&lt;/li&gt;&lt;li&gt;Maintain cross-platform and platform-specific editorial calendar for social media content&lt;/li&gt;&lt;li&gt;Work with print, video, and design teams to develop cross-platform, traffic-driving social campaigns&lt;/li&gt;&lt;li&gt;Seamlessly execute partnership programs on social and digital channels&lt;/li&gt;&lt;li&gt;Monitor competitors’ social media presence, identify new opportunities, and leverage best practices.&lt;/li&gt;&lt;li&gt;Write, edit and curate email marketing programming for paid and non-paid issues&lt;/li&gt;&lt;li&gt;Ideate continued ways to innovate salon professional hair-related content to elevate the brand, including pitching of content series campaigns, salon professional partnerships (stylists/barbers), etc.&lt;/li&gt;&lt;li&gt;Maintain upstanding relationships with brands and salon professionals to continue building awareness within the market&lt;/li&gt;&lt;li&gt;Have experience with newsroom analytics tools, such as Chartbeat and Crowdtangle&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;strong&gt;&lt;u&gt;&amp;nbsp;&lt;/u&gt;&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;&lt;u&gt;About You&lt;/u&gt;&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;You have a keen eye and a creative, forward-thinking mindset&lt;/li&gt;&lt;li&gt;You’re passionate about salon professional and beauty brands, stories, and design, and have a fascination with how to apply that passion across social platforms&lt;/li&gt;&lt;li&gt;You love working with tight-knit entrepreneurial teams&lt;/li&gt;&lt;li&gt;You have an understanding of industry trends, best practices, and emerging user behaviors.&lt;/li&gt;&lt;li&gt;You are an enthusiastic, highly-organized creative producer with the ability to work independently as well as in a team environment&lt;/li&gt;&lt;li&gt;You are a confident, skillful communicator&lt;/li&gt;&lt;/ul&gt;",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-25T17:24:57.000Z"
    },
    "company": {
        "name": "The Tease",
        "link": "https://www.linkedin.com/company/hello-salon-pro"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Los Angeles",
        "region": "CA",
        "postal_code": "90101",
        "street_address": null,
        "latitude": 34.05224,
        "longitude": -118.24335
    }
}