{
    "job": {
        "title": "Data Scientist",
        "industry": "Marketing and Advertising,Information Technology and Services,Financial Services",
        "description": "Job Summary:&lt;br&gt;&lt;br&gt;Disney Streaming Services is responsible for developing and operating The Walt Disney Company’s direct-to-consumer video businesses globally, including the ESPN+ premium sports streaming service; Disney+, the dedicated streaming home for entertainment from Disney, Pixar, Marvel, Star Wars, National Geographic and BAMTECH Media, a global leader in direct-to-consumer video streaming products and solutions. Our core mission is to deliver global audiences the freedom to access content on their terms across any connected device, time or location. We serve consumers by bringing the world’s most beloved characters, timeless stories, legendary athletes, and epic sporting events to global audiences through best-in-class direct-to-consumer video services. We strive daily to imaginatively challenge convention with innovative technology!&lt;br&gt;&lt;br&gt;The Data Science team at Disney Streaming Services combines deep data analysis and research of our rich user data to present a compelling vision around user retention and preferences across the vast ecosystem of our product offerings and content. We are the insights and modeling partners for the content, marketing, product, and engineering teams at Disney+, Hulu and ESPN+. As Data Scientists, we use data to empower decision-makers with information, predictions, and insights that ultimately influence the experiences of millions of users worldwide. If you are someone who loves to work cross-functionally, build models, perform statistical analysis, and create visualizations to provide scalable and iterative capabilities, then this is a phenomenal role for you!&lt;br&gt;&lt;br&gt;Responsibilities:&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;What You'll Do&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;Modeling: Apply innovative machine learning and statistical analysis to develop models related to opportunity sizing, targeting, and optimization.&lt;/li&gt;&lt;li&gt;Deep analysis: Analyze user behavioral data to identify patterns, uncover opportunities, and build common understanding of how people are interacting with the service and content.&lt;/li&gt;&lt;li&gt;Visualization of Insights: Development of prototype solutions, mathematical models, algorithms, and robust analytics leading to impactful insights communicated clearly and visually.&lt;/li&gt;&lt;li&gt;Partnership: Partner closely with business stakeholders to identify and unlock opportunities to improve platform capabilities around data modeling, data visualization, experimentation and data architecture.&lt;br&gt;&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;Basic Qualifications:&lt;br&gt;&lt;br&gt;&lt;/strong&gt;&lt;strong&gt;&lt;u&gt;What To Bring&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;Bachelors or Master’s degree in a quantitative field (e.g. Computer Science, Engineering, Mathematics, Physics, Operations Research, Econometrics, Statistics)&lt;/li&gt;&lt;li&gt;1-2 years related experience with developing machine learning models and conducting statistical analysis &lt;/li&gt;&lt;li&gt;Deep understanding of machine learning concepts and statistical methods &lt;/li&gt;&lt;li&gt;Ability to draw insights and conclusions from data to advise model development and business decisions&lt;/li&gt;&lt;li&gt;Desire to collaborate with other data scientists, data analysts, and key business partners&lt;/li&gt;&lt;li&gt;Proficient in analyzing data and developing ML models using Python (with ML frameworks like tensorflow, scikit-learn, etc.)&lt;/li&gt;&lt;li&gt;Capable of reading and writing Object-Oriented code to review and implement modeling pipelines (Airflow, Luigi, etc.)&lt;/li&gt;&lt;li&gt;Understanding of SQL and distributed data technologies (Hive, Spark)&lt;br&gt;&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;Preferred Qualifications:&lt;br&gt;&lt;br&gt;NICE TO HAVES&lt;br&gt;&lt;br&gt;&lt;ul&gt;&lt;li&gt;MS or PhD in Computer Science, Engineering, Statistics, Economics, Physics or related quantitative field (e.g. Econometrics, Mathematics, Operations Research)&lt;/li&gt;&lt;li&gt;Solid understanding of Bayesian modeling and familiarity with probabilistic programming packages/language such as Stan, PyMC&lt;/li&gt;&lt;li&gt;Experience fully integrating data science solutions into the business and operationalizing ML models&lt;br&gt;&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;Required Education&lt;br&gt;&lt;br&gt;&lt;ul&gt;&lt;li&gt;Bachelors or Master’s degree in a quantitative field (e.g. Computer Science, Engineering, Mathematics, Physics, Operations Research, Econometrics, Statistics)&lt;br&gt;&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;&lt;u&gt;Preferred Education&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;MS or PhD in Computer Science, Engineering, Statistics, Economics, Physics or related quantitative field (e.g. Econometrics, Mathematics, Operations Research)&lt;br&gt;&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;789244BR",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-06T22:43:16.000Z"
    },
    "company": {
        "name": "The Walt Disney Company",
        "link": "https://www.linkedin.com/company/the-walt-disney-company"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Santa Monica",
        "region": "CA",
        "postal_code": "90403",
        "street_address": null,
        "latitude": 34.010933,
        "longitude": -118.491516
    }
}