{
    "job": {
        "title": "Lead Web Developer-Remote",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Dice is the leading career destination for tech experts at every stage of their careers. Our client, Generis TEK Inc., is seeking the following. Apply via Dice today!&lt;br&gt;&lt;br&gt;We have a Contract role Lead Web Developer-Remote client for Chicago IL. Please let me know if you or any of your friends would be interested in this position. Position Title Lead Web Developer-Remote-Chicago IL Role 9+ Months Contract Description We are looking for a Lead Web Developer to build and maintain functional web pages and applications. Responsibilities include leading a team of junior developers, refining website specifications and resolving technical issues. You will also be prioritizing the backlog to achieve the goal of increasing both traffic and conversion rates. To be successful in this role, you should have extensive experience building web pages in Sitecore. Ultimately, you will ensure our web pages are continuously optimized for site traffic and lead generation. Required Skills Sitecore CMS experience Team leadership experience Work experience as a Senior Web Developer Solid knowledge of HTMLCSS Experience with mockup and UI prototyping tools Understanding of security practices Familiarity with network diagnostics tools Experience with personalization Proven track record of hitting KPI's for web improvement Experience with web personalization Strong technical SEO knowledge Experience making data driven decisions to optimize site performance If you are interested in this opportunity, please email your resume at and include posting in your application. also, you can call us at and to discuss this position details.",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-18T22:04:09.000Z"
    },
    "company": {
        "name": "Dice",
        "link": "https://www.linkedin.com/company/dice"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Chicago",
        "region": "IL",
        "postal_code": "60654",
        "street_address": null,
        "latitude": 41.88323,
        "longitude": -87.6324
    }
}