{
    "job": {
        "title": "Data Scientist",
        "industry": "Information Technology and Services",
        "description": "&lt;p&gt;We are seeking smart, nice, and curious people like you -- people who get data, thrive in a fast-paced environment, and have wicked analytic and data science skills! You will work with business units and formulate the problem into a mathematical model. Build solutions through visualizations, predictive analytics, and prescriptive methods. Integrate solutions into the business process. You will have the opportunity to work with some of the brightest in the field, and be at the forefront of the data science movement transforming the automotive industry. Coordinate large datasets and get meaningful insights for business. Apply data mining, data transformation, and develop statistical/optimization models. Create relevant data visualization or outputs files to communicate findings with partners. Work with IT to implement analytics tools into a production environment.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;JOB DESCRIPTION:&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Develop analytic models using skills such as data wrangling, algorithm design, prototype development &amp;amp; deployment.&lt;/li&gt;&lt;li&gt;Support cross-function teams on Supply Chain Complexity decisions with insights gained from analytics tools and visualization from the data.&lt;/li&gt;&lt;li&gt;Work efficiently with a wide range of partners and functional teams. Interpret results and communicate them to technical and non-technical audiences, multi-functional teams, and executive leadership.&lt;/li&gt;&lt;li&gt;Run efficient SQL to process TB-level datasets.&lt;/li&gt;&lt;li&gt;Design a visual interface for users to interact with the data, or persuading visualization.&lt;/li&gt;&lt;li&gt;Build advanced analytics models in the supply chain space.&amp;nbsp;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Experience Required: &lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;2+ years in data visualization, machine learning, or optimization&lt;/li&gt;&lt;li&gt;Experience in SQL, Hadoop Alteryx, Qlikview, Tableau and implementation. Or Experience with SQL, Python, CPLEX, Simulation software&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Experience Preferred: &lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Previous Auto industry experience&lt;/li&gt;&lt;li&gt;2+ years with mathematical programming, optimization/simulation techniques, data mining, or statistical analysis&lt;/li&gt;&lt;li&gt;Experience with analyzing complex non-linear systems, performing discrete-event or agent-based simulation&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;ADDITIONAL INFORMATION&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Excellent compensation packages including Subsidized Medical Benefits, Paid Time Off and 401k&lt;/li&gt;&lt;li&gt;No Third-Party inquiries&lt;/li&gt;&lt;/ul&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-13T14:28:57.000Z"
    },
    "company": {
        "name": "Modis",
        "link": "https://ch.linkedin.com/company/modis"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Detroit Metropolitan Area",
        "region": null,
        "postal_code": "48215",
        "street_address": null,
        "latitude": 42.339054,
        "longitude": -83.04875
    }
}