{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "Computer Software",
        "description": "&lt;p&gt;BioIntelliSense Overview&lt;br&gt;&lt;br&gt;&lt;/p&gt;&lt;br&gt;&lt;p&gt;BioIntelliSense is ushering in a new era of continuous health monitoring and clinical intelligence for Remote Patient Monitoring (RPM) and Screening (COVID-19/Infection). Our medical-grade Data-as-a-Service (DaaS) platform seamlessly captures multi-parameter vital signs, physiological biometrics, and symptomatic events through an effortless patient experience. The FDA-cleared BioSticker&amp;amp;trade; and BioButton&amp;amp;trade; devices make remote monitoring and early detection simple. Through the platform's advanced analytics, clinicians, patients, and employers will now have access to high-resolution patient trending and reporting to enable medical-grade care at home, and medical-grade screening in the office, school, or residence. For more information on how BioIntelliSense is redefining remote patient monitoring through medical-grade and cost-effective data services, please visit our website at BioIntelliSense.com.&lt;br&gt;&lt;br&gt;&lt;/p&gt;&lt;br&gt;&lt;p&gt; &lt;br&gt;&lt;br&gt;&lt;/p&gt;&lt;br&gt;&lt;p&gt;A unique and exciting opportunity to build and maintain production systems of a data services healthcare company funded by leading institutional and corporate investors in the healthcare space. The Denver-based company is under the leadership of a distinguished cardiothoracic surgeon, inventor, and digital health pioneer, who has led series of successful healthcare companies and exits, including an IPO over the last two decades. This is the ideal time to join an accomplished executive leadership team and customer-centric organization that has breakthrough data services, top talent, and strategic operating capital.&lt;br&gt;&lt;br&gt;&lt;/p&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-01T07:50:02.000Z"
    },
    "company": {
        "name": "BioIntelliSense, Inc",
        "link": "https://www.linkedin.com/company/biointellisense"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Golden",
        "region": "CO",
        "postal_code": "80403",
        "street_address": null,
        "latitude": 39.749672,
        "longitude": -105.21602
    }
}