{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "Staffing and Recruiting",
        "description": "&lt;p&gt;io173 is partnered with a Management Consulting firm to scale up their Machine Learning Engineering team. Our client's primary focus is on end-to-end development of analytics solutions and their deployment at scale. This role will play a key part in developing and deploying ML models in a production environment.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;We are looking for experienced ML Engineers with professional experience interested in the Management Consulting Industry.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Responsibilities:&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Productionize and deploy ML models.&lt;/li&gt;&lt;li&gt;Working closely with data scientists and data engineers to produce and deploy machine learning models.&lt;/li&gt;&lt;li&gt;Refactoring code into reusable libraries and tools.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Required Qualifications:&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Masters Degree in CS or relevant area.&lt;/li&gt;&lt;li&gt;3+ years professional experience in Machine Learning including Linear Regression, Decision Trees, Random Forest, Deep Learning. Experience must be outside of Academia and internships or candidates will not be considered.&lt;/li&gt;&lt;li&gt;3+ years in ML Engineer role deploying ML solutions in customer environments.&lt;/li&gt;&lt;li&gt;Python programing absolute must- Advanced&lt;/li&gt;&lt;li&gt;Strong skills and experience in OOD/SW Engineering concepts including industry best practices.&lt;/li&gt;&lt;li&gt;Experience with C, C++, Java or Scala highly preferred.&lt;/li&gt;&lt;li&gt;Experience in ML Research is a bonus, consistent experience in production environments is a MUST.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Expectations:&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Must be located in or willing to relocate to a location commutable to one of our client's major hubs: Boston, Chicago, New York City.&lt;/li&gt;&lt;li&gt;Must be willing to travel for work, this will not be a fully remote role.&lt;/li&gt;&lt;li&gt;We will not consider C2C candidates for this role, only direct-hire candidates.&lt;/li&gt;&lt;li&gt;Candidates will go through multiple technical interviews including testing and coding rounds. &lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;io173.com acts as an employment agency for permanent recruitment. By applying for this job you accept the Terms &amp;amp;Condition's, Privacy Policy and Disclaimers which can be found at io173.com&lt;/p&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-19T20:47:25.000Z"
    },
    "company": {
        "name": "io173",
        "link": "https://uk.linkedin.com/company/io173"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Boston",
        "region": "MA",
        "postal_code": "02118",
        "street_address": null,
        "latitude": 42.358994,
        "longitude": -71.05863
    }
}