{
    "job": {
        "title": "Software Engineer (C#)",
        "industry": "Staffing and Recruiting",
        "description": "&lt;p&gt;&lt;strong&gt;Must Haves: &lt;/strong&gt;&lt;/p&gt;&lt;p&gt;• At least a Bachelor's degree in computer science or related field (or equivalent experience) &lt;/p&gt;&lt;p&gt;• 6+ years of experience in software development &lt;/p&gt;&lt;p&gt;• Fundamental knowledge of Object-oriented design, data structures, algorithm design, problem-solving and complexity analysis. &lt;/p&gt;&lt;p&gt;• Proven skills in C# and JavaScript (preferably VueJS) and two or more of the following: &lt;/p&gt;&lt;p&gt; ➢ TypeScript, CSS, SQL &lt;/p&gt;&lt;p&gt;• The ability to communicate with users, other technical teams, and management to collect requirements, describe software product features, and technical designs. &lt;/p&gt;&lt;p&gt;• Demonstrated willingness to learn new technologies and in solving challenging problems. &lt;/p&gt;&lt;p&gt;• The ability to think abstractly and deal with ambiguous/under-defined problems. &lt;/p&gt;&lt;p&gt;• The ability to learn and adapt quickly to changing requirements.&lt;/p&gt;&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Pluses: &lt;/strong&gt;&lt;/p&gt;&lt;p&gt;• Experience building complex multi-tier software systems and or services&lt;/p&gt;&lt;p&gt;• Knowledge of professional software engineering practices for the full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations &lt;/p&gt;&lt;p&gt;• SQL Server development skills including data integration, data modeling, query performance tuning, designing stored procedures &lt;/p&gt;&lt;p&gt;• Experience with Public Key Infrastructure (PKI) in applications, especially smart card credentials&lt;/p&gt;&lt;p&gt;• Experience with ORM technologies like Entity Framework, Dapper, or NHibernate &lt;/p&gt;&lt;p&gt;• Experience with development in a Windows environment using .Net, Active Directory, IIS, Remote Desktop Services etc.&lt;/p&gt;&lt;p&gt;• Experience with web-based applications, both local and cloud &lt;/p&gt;&lt;p&gt;• Familiar with cloud solution stacks from either AWS or Azure &lt;/p&gt;&lt;p&gt;• Experience with windows services, microservices, docker, containers &lt;/p&gt;&lt;p&gt;• Experience writing, documenting and consuming REST APIs, GraphQL, etc &lt;/p&gt;&lt;p&gt;• Familiar with development using Secure Software Development Lifecycle standards&lt;/p&gt;&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Day to Day: &lt;/strong&gt;&lt;/p&gt;&lt;p&gt;You work in a fast-paced environment where you will develop and deliver software that&amp;nbsp;simplifies solutions for a broad set of interrelated problems. Specifically, you will join a talented team of dedicated professionals in delivering production-quality code against well[1]drafted requirements and business logic from product management. You will have the opportunity to create and deploy cutting edge solutions for commercial and government clients&amp;nbsp;alike. Best of all, you’ll get to grow your experience working alongside smart people to solve&amp;nbsp;problems that make the world a safer, more efficient place.&lt;/p&gt;&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;p&gt;What does a typical day look like for the Software Developer?&lt;/p&gt;&lt;p&gt;Although no two days will be the same, you’ll:&lt;/p&gt;&lt;p&gt;• Participate in high functioning software development projects including design and test&lt;/p&gt;&lt;p&gt;• Interpret requirements and design specifications to develop, debug, test and maintain &lt;/p&gt;&lt;p&gt;software applications to be deployed against a broad array of platforms and cloud services.&lt;/p&gt;&lt;p&gt;• Maintain current knowledge of relevant technology&lt;/p&gt;&lt;p&gt;• Proactively manage relationships with other team members&lt;/p&gt;&lt;p&gt;• Present complex technical information in a clear and concise manner to a variety of &lt;/p&gt;&lt;p&gt;audiences.&lt;/p&gt;&lt;p&gt;• Facilitate consensus building and resolution of complex technical issues&lt;/p&gt;&lt;p&gt;• Present complex technical information in a clear and concise manner to a variety of audiences.&lt;/p&gt;&lt;p&gt;• Be an active participant in your development along your career path&lt;/p&gt;&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;p&gt;&amp;nbsp;&lt;/p&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-09T20:02:44.000Z"
    },
    "company": {
        "name": "Insight Global",
        "link": "https://www.linkedin.com/company/insight-global"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 72,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": 50,
        "max_value": 60,
        "unit": "HOUR"
    },
    "location": {
        "country": "US",
        "locality": "Raleigh-Durham-Chapel Hill Area",
        "region": null,
        "postal_code": "27603",
        "street_address": null,
        "latitude": 35.817448,
        "longitude": -78.27004
    }
}