{
    "job": {
        "title": "Machine Learning Software Engineer",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Dice is the leading career destination for tech experts at every stage of their careers. Our client, MAK Technologies, LLC, is seeking the following. Apply via Dice today!&lt;br&gt;&lt;br&gt;Machine Learning Software Engineer Duration 6+ months Location Remote Rate Hr on c2c (All Inc) Details- As a Machine Learning Software Engineer, for the client you will work on a product team to help drive and scale capabilities associated with integrating machine learning into business and manufacturing processes Expect to work with the latest Python packages, and cloud infrastructure, and all within Continuous Delivery and Agile Development process. Expect also to work with with AWS machine learning (Sagemaker) and supporting services like Lambda, IoT and GreenGrass services as well as API Gateway and cloud formation (CDK). The ideal candidate has a BS or MS in a Software Engineering, Computer Science, or related field of study. Proven deep experience leveraging DevSecOps and lean development principles such as Continuous Integration and Continuous Delivery . If Interested please send your up-to-date resume kindly provide the following info- Total IT Exp. ndash Machine Learning Exp. ndash Java Exp. ndash Python Exp. ndash AWSAzure Exp. ndash DevSecOps Exp. ndash Full Lifecycle Implementation Done ndash (no. of end to end projects)- Located - Immigration Status- Availability- Rate Hr on c2c (All Inc) - Education ndash Interested candidates please feel free to call. Pinaki Deori ator email pinaki.deori()maktechnologiesllc(.)com for more details.",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-07-01T21:36:24.000Z"
    },
    "company": {
        "name": "Dice",
        "link": "https://www.linkedin.com/company/dice"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Cincinnati",
        "region": "OH",
        "postal_code": "45241",
        "street_address": null,
        "latitude": 39.1037,
        "longitude": -84.51361
    }
}