{
    "job": {
        "title": "Investment Data Scientist",
        "industry": "Investment Management,Financial Services",
        "description": "&lt;p&gt;We’re partnering with one of the best performing hedge funds looking to add to their Investment Data Science team as they continue to scale their New York office. &lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;The role focusses on utilizing quantitative methods to analyze alternative data sets in order to generate trading signals. Unlike many similar positions where you sit in a centralized function sending out idea's/ reports this role will see you partner with a small number of PM's/ Traders meaning you can develop a strong understanding of their investment universe which in turn should allow you to generate more relevant and profitable ideas. &lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;Given it's proximity to the investment decision making process I see this role as a combination between Data Science and Investment Analysis. &lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;In the past we've had success placing candidates coming from a range of backgrounds, these include Quantitative Researchers looking to move to a fundamental business, Equity Researchers with strong quantitative skills and Data Scientists with an active interest in investments.&amp;nbsp;What all successful placements have had in common is strong technical capabilities (Python, SQL), exposure to different alternative data sets, and experience articulating ideas to PM/ Traders. &lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;If you believe you have the relevant skills please apply and we can schedule a call to discuss potential next steps.&lt;/p&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-04T09:56:11.000Z"
    },
    "company": {
        "name": "Sartre Group",
        "link": "https://uk.linkedin.com/company/sartre-group"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": 150000,
        "max_value": 300000,
        "unit": "YEAR"
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "United States",
        "postal_code": "13856",
        "street_address": null,
        "latitude": 42.93923,
        "longitude": -75.62005
    }
}