{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "Computer Software,Internet,Hospital &amp; Health Care",
        "description": "&lt;strong&gt;&lt;u&gt;Who We Are&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;Braid Health is a digital health innovation company focused on the development and delivery of an AI-powered diagnostic collaboration platform for radiology and the healthcare industry.&lt;br&gt;&lt;br&gt;Imagine a world in which everyone can access the best medical expertise regardless of where they live, how much money they have, or what they know. We believe access to medical expertise should be universal.&lt;br&gt;&lt;br&gt;We’re generalists and truth seekers with a ton of experience (Apple Design, Twitter AI). We’re already helping people now and have an opportunity (and responsibility) to help millions or even billions more!&lt;br&gt;&lt;br&gt;&lt;strong&gt;As a team, we're committed to&lt;br&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;Making sure our impact on patients is positive and measurable&lt;/li&gt;&lt;li&gt;Investing in each other's growth, both professionally and personally&lt;/li&gt;&lt;li&gt;Pushing for transparency in our relationships with each other, our customers, and our investors&lt;/li&gt;&lt;li&gt;Ensuring privacy and security are always top of mind&lt;br&gt;&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;&lt;u&gt;Who You Are&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;You like building systems that use the latest advancements in Machine Learning (computer vision, NLP, speech recognition, or other). You like taking visionary ideas and turning them into reality&lt;/li&gt;&lt;li&gt;You want to do something truly meaningful with your time and skills and helping people resonates&lt;/li&gt;&lt;li&gt;You deliver. You make things happen and avoid over-engineering&lt;/li&gt;&lt;li&gt;You are resourceful, flexible and adaptable; no task is too big or too small&lt;br&gt;&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;&lt;u&gt;Key Requirements&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;4+ years of development experience in a company/production setting&lt;/li&gt;&lt;li&gt;Experience with Machine Learning frameworks such as TensorFlow or PyTorch&lt;/li&gt;&lt;li&gt;Strong software development skills, with proficiency in multiple languages (ex. Python, Javascript).&lt;/li&gt;&lt;li&gt;Designed and developed data science solutions relating to streaming data as well as machine learning solutions&lt;/li&gt;&lt;li&gt;Worked with large datasets and have a deep appreciation for data&lt;br&gt;&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;&lt;u&gt;Preferred Qualifications&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;Experience in building ML models in Computer Vision for image classification or image segmentation&lt;/li&gt;&lt;li&gt;Built data pipelines to extract, transform, and load datasets in a cloud infrastructure or local.&lt;br&gt;&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;&lt;u&gt;What We Have To Offer&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;An opportunity to significantly improve healthcare around the world. &lt;/li&gt;&lt;li&gt;Work with bleeding-edge technologies (like Machine Learning) in novel ways, not yet fully mapped to industries&lt;/li&gt;&lt;li&gt;Work with a veteran founding team, with a successful track record&lt;/li&gt;&lt;li&gt;Excellent medical, dental and vision insurance through a PPO plan&lt;/li&gt;&lt;li&gt;Stock options&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;Powered by JazzHR&lt;br&gt;&lt;br&gt;VHXuRhhH07",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-22T19:11:59.000Z"
    },
    "company": {
        "name": "Braid Health",
        "link": "https://www.linkedin.com/company/braid-health"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco",
        "region": "CA",
        "postal_code": "94121",
        "street_address": null,
        "latitude": 37.78008,
        "longitude": -122.42016
    }
}