{
    "job": {
        "title": "Cyber Infrastructure Developer",
        "industry": "Internet",
        "description": "Cyber Infrastructure Developer Raytheon Technologies is supporting a US Government customer to provide support for onsite incident response to civilian Government agencies and critical asset owners who experience cyber-attacks, providing immediate investigation and resolution. Contract personnel perform investigations to characterize of the severity of breaches, develop mitigation plans, and assist with the restoration of services. Raytheon Technologies Intelligence &amp;amp; Space (RIS) is seeking a Cyber Infrastructure Developer to support this critical customer mission. Responsibilities: Designing, troubleshooting, and implementing state of the art cyber security tools Conducts software validation and verification, and software engineering anomaly resolution Evaluates the quality of proposed and existing software systems and solutions that support various cyber software activities and are planned to be integrated into various networks and architectures Provides support for a cybersecurity lab infrastructure tooling and automation Provides support for cyber analysis deployment kits, to include the automation of provisioning, data archiving and preparation for re-deployment Designs, develops, enhances, debugs, integrates, and implements software Troubleshoots production problems related to software applications Researches, tests, builds, and coordinates the conversion and/or integration of new products based on user requirements Designs or implements complex algorithms requiring adherence to strict timing, system resource, or interface constraints; performs quality control on team products Confers with system engineers and hardware engineers to derive requirements and to obtain information on project limitations and capabilities, performance requirements, and interfaces Required Skills: US Citizenship Must have an active Secret clearance; TS/SCI is preferred Must be able to obtain DHS Suitability 2 years of directly relevant experience in applications development Knowledge of secure software development lifecycle and code versioning and maintenance Experience with assessing and integrating commercial off the shelf (COTS) products. Experience across the entire field of software technologies and engineering, including information, documentation, databases, model and architecture repositories, analysis, training, testing, data synthesis, hardware, software, standards, economic consideration of selecting techniques, and processes, and interoperability Knowledge and familiarity to work with the installation, demonstration, test, validation and evaluation of new and existing software, tools, methods, and software measurement technologies Experience developing in a Linux environment Must be able to work collaboratively across physical locations Desired Skills: Experience with one or more of the following: DevOps concepts and practices, Cloud and Virtualization technologies, Docker, Kubernetes, OpenShift, IDaM, VMWare, Automation, Python, Ansible, Git Experience working in an agile development environment Required Education: BS Computer Science, Computer Engineering, Computer Information Systems, Computer Systems Engineering or related degree. 4-6 years of application development experience with a High School diploma can substitute for a degree and 2 years of experience Desired Certifications: CSSLP Security HIRTRIS 178468 Raytheon is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, creed, sex, sexual orientation, gender orientation, gender identity, national origin, disability, or protected Veteran status.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-01T06:41:39.000Z"
    },
    "company": {
        "name": "JobGet",
        "link": "https://www.linkedin.com/company/jobget"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Burtonsville",
        "region": "MD",
        "postal_code": "20866",
        "street_address": null,
        "latitude": 39.104874,
        "longitude": -76.93374
    }
}