{
    "job": {
        "title": "Software Engineer ( C#/.NET &amp; Angular) - Direct-hire - REMOTE",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "&lt;strong&gt;&lt;u&gt;Job Description&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;strong&gt;Job Title: Software Engineer (C# / .NET)&lt;br&gt;&lt;br&gt;Job Type: Direct-hire&lt;br&gt;&lt;br&gt;Location: Remote&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;Job Summary&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;The Software Engineer analyzes user needs and uses various programming languages to develop, improve, test and/or maintain software that meets user needs. These responsibilities require this team member to take an active role in design and code reviews, assist with delivery estimates and provide feedback about all aspects of the process.&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;Preferred Qualifications&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;A strong foundation in programming fundamentals, design patterns, data structures, object-oriented design principles, unit testing, and modern version control flows&lt;/li&gt;&lt;li&gt;2 years of development experience in a multilayered “ n-tier” style architecture&lt;/li&gt;&lt;li&gt;Comfort with one or more of the following languages: C# (or other .NET language), JavaScript (either back-end, e.g., NodeJS, and/or front-end, such as Angular, React, or Vue), Java (or other JVM-based language), PHP, Python, Ruby, Progress, Erlang/Elixir, or others like these.&lt;/li&gt;&lt;li&gt;Experience working with some form of distributed technology like gRPC, GraphQL, or REST over HTTP.&lt;/li&gt;&lt;li&gt;Understanding of and experience working in a continuous integration and continuous delivery environment&lt;/li&gt;&lt;li&gt;Experience working with software automation frameworks to do functional testing&lt;/li&gt;&lt;li&gt;Experience developing applications in a cloud environment, such as AWS or Azure&lt;/li&gt;&lt;li&gt;Experience using DevOps-focused technologies, such as Docker, Terraform or CircleCI&lt;/li&gt;&lt;li&gt;Comfort working on the command line&lt;/li&gt;&lt;li&gt;Portfolio and code samples you can share&lt;/li&gt;&lt;li&gt;Experience working with functional programming&lt;/li&gt;&lt;li&gt;Willingness to learn new languages and technologies&lt;/li&gt;&lt;li&gt;Awareness to identify and pay off technical debt, as well as realizing and removing code smells early during development and code review&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;&lt;u&gt;Responsibilities&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;Solve problems by crafting software solutions using maintainable, testable and modular code&lt;/li&gt;&lt;li&gt;Collaborate within a team by participating in code reviews, pairing sessions, architecture discussions and planning ceremonies&lt;/li&gt;&lt;li&gt;Write robust, testable code, along with unit, functional, acceptance and/or user tests to validate every change&lt;/li&gt;&lt;li&gt;Challenge your fellow team members to grow and enhance our team with new, diverse talent&lt;/li&gt;&lt;li&gt;Mentor interns and other software engineers to grow their technical skills&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;/strong&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-18T22:19:00.000Z"
    },
    "company": {
        "name": "Talution Group",
        "link": "https://www.linkedin.com/company/talution-group"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Detroit",
        "region": "MI",
        "postal_code": "48242",
        "street_address": null,
        "latitude": 42.33294,
        "longitude": -83.04784
    }
}