{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "",
        "description": "About us:&lt;br&gt;DressX is the biggest digital fashion marketplace partnering with some of the greatest tech and fashion companies in the world to bring the vision of the digital future of fashion to life. Founded around the strong ethos of sustainability, DressX aims to show that some clothes don't have to be produced, they can only exist in their digital versions, worn across various virtual platforms without polluting the environment.&lt;br&gt; &lt;br&gt;We are a team of believers based in the cloud between Los Angeles and Ukraine, working with partners across the globe, and united by the big mission to disrupt the fashion industry.&lt;br&gt; &lt;br&gt;About the project: &lt;br&gt;The project is related to the development of a product for automating many processes related to 3D / 2D clothing, work with AR kit, video streaming, ML and AI frameworks. The Data Science role is to define, develop, test, analyze, and maintain new ML-software applications in support of the achievement of business requirements. The Data Scientist will also research, design, document, and modify ML-software specifications throughout the production life cycle.&lt;br&gt; &lt;br&gt;Your professional qualities:&lt;br&gt;Fluency in at least one programming language (C/C++, Python, Julia)&lt;br&gt;Strong programming skills utilizing Scikit-learn, OpenCV, Keras and/or Tensorflow libraries, PyTorch framework&lt;br&gt;OOP experience&lt;br&gt;Experience in image processing, including traditional statistical methods and feature extraction approaches&lt;br&gt;Familiarity with a broad set of supervised and unsupervised ML-based solutions to image or signal processing&lt;br&gt;Strong analytical, creative problem-solving skills, and experience with fast prototyping of a minimum viable product&lt;br&gt;Experience in implementing real-time machine learning and computer vision algorithms in large scale environments&lt;br&gt;Challenges you’ll need to meet:&lt;br&gt;Solutions research and development &lt;br&gt;Solve difficult and non-routine image/signal processing problems while prototyping and building machine learning tools and pipelines&lt;br&gt;Developing and supporting API&lt;br&gt;For your success we offer:&lt;br&gt;Flexible working hours with remote work&lt;br&gt;Opportunities for professional development and personal growth;&lt;br&gt;Competitive salary, reasonable and fair working conditions&lt;br&gt;Team of strong IT professionals working in a vibrant product environment&lt;br&gt;If you are interested in this opportunity, please apply by sending your CV &amp; portfolio at tech@dressx.com, hello@dressx.com. Include the job title you are applying for in the email subject.&lt;br&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-27T18:59:52.000Z"
    },
    "company": {
        "name": "DRESSX",
        "link": "https://www.linkedin.com/company/dressx"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Los Angeles",
        "region": "CA",
        "postal_code": "90101",
        "street_address": null,
        "latitude": 34.05224,
        "longitude": -118.24335
    }
}