{
    "job": {
        "title": "Senior Data Scientist, India Growth",
        "industry": "Marketing and Advertising,Computer Software,Internet",
        "description": "“The front page of the internet,\" Reddit brings over 430 million people together each month through their common interests, inviting them to share, vote, comment, and create across thousands of communities. Come work with one of the richest datasets in the world and make an impact on the lives of Redditors everywhere.&lt;br&gt;&lt;br&gt;We are looking for a results-oriented and strategically-minded &lt;strong&gt;Senior Data Scientist&lt;/strong&gt; to work with our International Growth team as Reddit expands its user base to India.&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;How You’ll Have Impact&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;Today the majority of Reddit’s user base lives in the US. Reddit’s mission is to bring community and belonging to everyone in the world, which means we’ll be making a major push to expand our audience internationally. We’ve identified India as a key market and need you to be a key player in exploring and understanding the key levers to drive growth.&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;What You’ll Learn&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;As a Data Scientist, you will become an expert in improving Reddit’s product-market fit for a global user base. You’ll be pivotal in understanding how Indian users interact with our product today and how that differs from other audiences. You’ll be a champion to the users through evaluating performance of existing Reddit features for India users, as well as uncovering opportunities for new experiences that are optimized for worse internet connections.&lt;br&gt;&lt;br&gt;You will work side by side with a world-class org of Engineering, Machine Learning, Search, Community Operations, Product Management practitioners who work together to create a variety of capabilities for Reddit to be more successful in its decision-making and product creation. In this process, you will be exposed to a variety of new techniques in experimentation, machine learning, and exploratory analysis&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;What You’ll Do&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;Partner cross functionally with Eng and Product leads to help define and execute international growth’s India roadmap and initiatives&lt;/li&gt;&lt;li&gt;Become the expert at understanding user behavior and long-term trends in India&lt;/li&gt;&lt;li&gt;Generate data-driven insights that propose next steps in the strategic roadmap&lt;/li&gt;&lt;li&gt;Design and evaluate A/B tests for product feature experiments to determine the effectiveness of product strategy&lt;/li&gt;&lt;li&gt;Define team metrics and goals and make them easily available through ETLs (extract/transform/load) and reporting dashboards&lt;br&gt;&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;&lt;u&gt;Who You Might Be&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;4-6 years of experience in quantitative analytical roles, preferably for growing at-scale consumer products outside the US&lt;/li&gt;&lt;li&gt;Proficiency with relational database (e.g., SQL)&lt;/li&gt;&lt;li&gt;Familiarity with statistical analysis and programming languages (e.g., R / Python)&lt;/li&gt;&lt;li&gt;Results-oriented with a strong customer and business focus&lt;/li&gt;&lt;li&gt;Entrepreneurial and self-directed, demonstrated ability to innovate and bias toward action in fast-paced environments.&lt;/li&gt;&lt;li&gt;Ability to communicate and discuss complex topics with technical and non-technical audiences&lt;/li&gt;&lt;li&gt;Ability to tackle ambiguous and undefined problems&lt;/li&gt;&lt;li&gt;Previous experience with the India market preferred but not required&lt;br&gt;&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;em&gt;Reddit is committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation due to a disability, please contact us at &lt;/em&gt;&lt;em&gt;ApplicationAssistance@Reddit.com&lt;/em&gt;&lt;em&gt;.&lt;/em&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-27T05:12:44.000Z"
    },
    "company": {
        "name": "Reddit, Inc.",
        "link": "https://www.linkedin.com/company/reddit-com"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}