{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "Information Technology and Services,Defense &amp; Space,Computer Software",
        "description": "AINS has an exciting opening for a &lt;strong&gt;Machine Learning Engineer&lt;/strong&gt; specializing in designing, developing, and deploying AI models.&lt;br&gt;&lt;br&gt;We are looking for an AI/ML engineer with a specialization in NLP based applications to join a team of data scientists in designing and developing advanced technology-based solutions for contract research and development projects, and then applying these solutions to the design and deployment of mission-focused systems.&lt;br&gt;&lt;br&gt;The &lt;strong&gt;Machine Learning Engineer&lt;/strong&gt; will work with a team of system engineers to help design subsystems and components. Work with other senior data scientists to expand on existing AI/ML models and to evaluate third party services.&lt;br&gt;&lt;br&gt;&lt;strong&gt;C&lt;/strong&gt;&lt;strong&gt; urrently all staff are telecommuting for the foreseeable future &lt;br&gt;&lt;br&gt;&lt;/strong&gt;&lt;strong&gt;&lt;u&gt;Required Skills&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;Relevant experience in building end-to-end Natural Language Processing Applications&lt;/li&gt;&lt;li&gt;Hands-on experience with: data modeling and data engineering, feature engineering, model lifecycle management, and cloud infrastructure; supervised and unsupervised deep learning algorithms such as convolutional neural networks (CNNs), recurrent neural networks (RNNs) like Gated Recurrent Units(GRUs) and Long-Short Term Memory (LSTMs); and working in data analysis, modeling, and visualization packages in Deep Learning Frameworks like TensorFlow, Keras and Pytorch; and developing or integrating analytics in programming languages such as Python&lt;/li&gt;&lt;li&gt;Experience with the following Python Libraries extensively: Numpy, scipy, scikit-learn, pandas, opencv, matplotlib/seaborn&lt;/li&gt;&lt;li&gt;Experience using Python NLP toolkits like spacy, NLTK and Stanza&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;&lt;u&gt;Additional Required Skills&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;Supervised Learning - Linear and Logistic Regression, KNN, SVMs, Decision Trees, Random Forests, Gradient Boosting,&lt;/li&gt;&lt;li&gt;Unsupervised Learning Clustering Algorithms like K-means, Gaussian Mixture Model&lt;/li&gt;&lt;li&gt;Basics of Linear Algebra, Calculus&lt;/li&gt;&lt;li&gt;Back propagation, Loss, cost, accuracy, Gradient Descent, Batching, Variance/Bias Tradeoff, regularization, Hyper parameter tuning, Dimensionality Reduction&lt;/li&gt;&lt;li&gt;Sentence and Document Level Embeddings, word2vec, bag-of-words model&lt;/li&gt;&lt;li&gt;Knowledge of Auto-encoders, GANs, Attention models and Reinforcement Learning is a plus&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;&lt;u&gt;Education&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;A degree in engineering, computer science, data science, or a related discipline, such as statistics or applied mathematics.&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;&lt;u&gt;Clearance&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;strong&gt;US Citizen with an active or interim secret clearance&lt;br&gt;&lt;br&gt;&lt;/strong&gt;SDL2019-128",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-06-14T06:59:57.000Z"
    },
    "company": {
        "name": "AINS, Inc.",
        "link": "https://www.linkedin.com/company/ains_inc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Washington",
        "region": "DC",
        "postal_code": "20398",
        "street_address": null,
        "latitude": 38.892063,
        "longitude": -77.01991
    }
}