{
    "job": {
        "title": "Site Reliability Engineer (SRE)",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Dice is the leading career destination for tech experts at every stage of their careers. Our client, K-Tek Resourcing LLC, is seeking the following. Apply via Dice today!&lt;br&gt;&lt;br&gt;Hello, Greetings for the day! My name is Harsh, and I work as a Technical Recruiter for K-Tek Resourcing. We are searching for Professionals for below business requirement for one of our client. Please read through the requirement and connect with us in case it suits your profile. Job Role Site Reliability Engineer (SRE) Location Denver, CO New York City, NY Rate US60-80hr on C2C Note Should have good experience in monitoring using AppDynamics. Job Description Develop model and set up proactive monitoring for transaction flows Automate operations runbooks Hands-on programming skills - typically this will include scripting languages (e.g. python, powershell, unix shells etc.) Experience in L2 support APM Product Expertise Experience in production management, performance engineering Experience with implementing monitoring using AppDynamics -- -- Thanks Regards Harsh Varma Technical Recruiter KTEK Resourcing India Canada United States 9494 Southwest Freeway, Suite105, Houston, TX - 77074 Houston,TX Tel 1.832.564.3697 EmailSkype mailto",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-23T19:39:32.000Z"
    },
    "company": {
        "name": "Dice",
        "link": "https://www.linkedin.com/company/dice"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}