{
    "job": {
        "title": "Software Engineer - REACT and Node",
        "industry": "Marketing and Advertising",
        "description": "If you are a Software Engineer with experience, please read on!&lt;br&gt;&lt;br&gt;Top Reasons to Work with Us&lt;br&gt;&lt;ul&gt;&lt;li&gt; Work with cutting edge technology- Interesting software impacting our industry&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;What You Will Be Doing&lt;br&gt;&lt;ul&gt;&lt;li&gt; Design, build, implement and support features for the product integration platform as part of an application development team&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;What You Need for this Position&lt;br&gt;&lt;br&gt;Must have: - 5 years hands-on experience with JavaScript (React or Node, ideally both) - Track record in taking features from inception through to delivery and supporting them once live - Passion for best practice design and code and a desire to develop innovative new ideas - Strong understanding of the JavaScript ecosystem on the front and/or backend Nice to have:- Experience with the entertainment industry (tv, film, music videos)- Experience with social media (YouTube, Instagram, Twitch, TikTok etc) - Experience with gaming - Experience with Product Placement, Influencer campaigns, Performance Marketing or Paid Media&lt;br&gt;&lt;br&gt;So, if you are a Software Engineer with experience, please apply today!&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;Email Your Resume In Word To&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:&lt;br&gt;&lt;br&gt;Sandra.Ochoa@CyberCoders.com&lt;br&gt;&lt;ul&gt;&lt;li&gt;Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : SO2-1635589 -- in the email subject line for your application to be considered.***&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;Sandra Ochoa - Lead Recruiter - CyberCoders&lt;br&gt;&lt;br&gt;Applicants must be authorized to work in the U.S.&lt;br&gt;&lt;br&gt;&lt;strong&gt;CyberCoders, Inc is proud to be an Equal Opportunity Employer&lt;br&gt;&lt;br&gt;&lt;/strong&gt;All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.&lt;br&gt;&lt;br&gt;&lt;strong&gt;Your Right to Work&lt;/strong&gt; - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-09T17:41:26.000Z"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Provo",
        "region": "UT",
        "postal_code": "84601",
        "street_address": null,
        "latitude": 40.235123,
        "longitude": -111.66219
    }
}