{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "",
        "description": "&lt;p&gt;Summary:&lt;/p&gt;&lt;p&gt;One of our direct clients looking for a &lt;strong&gt;Machine Learning Engineer&lt;/strong&gt; who has at least 6+ years of working experience.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Job Title: &lt;/strong&gt;ML/AI Engineer&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Location:&lt;/strong&gt; Pleasanton CA (Must be onsite)&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Job Duration:&lt;/strong&gt; 12+ Months Contract (Only W2 Contract)&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Must-Have Skills:&lt;/strong&gt; &lt;/p&gt;&lt;p&gt;&lt;strong&gt;Machine Learning, NLP, Deep Learning, Python, MLLib, PyTorch, TensorFlow, Numpy/Scipy/Pandas, Spark, Hive, Data Science Notebooks, SQL&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Responsibilities:&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;• Provide technical leadership, develop vision, gather requirements, and translate client user requirements into technical architecture.&lt;/p&gt;&lt;p&gt;• Strong Background in Statistical modeling, NLP, and Machine Learning.&lt;/p&gt;&lt;p&gt;• Expertise in various facets of ML and NLP, such as classification, feature engineering, information extraction, clustering, semi-supervised learning, topic modeling, and ranking.&lt;/p&gt;&lt;p&gt;• Strong Hands-on Experience in building, deploying, and productionizing ML models using software such as Spark MLLib, TensorFlow, PyTorch, Python Scikit-learn, etc. is mandatory&lt;/p&gt;&lt;p&gt;• &lt;strong&gt;4-5 years of programming experience in Java, Scala, Python. &lt;/strong&gt;&lt;/p&gt;&lt;p&gt;• Strong Experience with Data Science Notebooks like RStudio, Jupyter, Zeppelin, PyCharm, etc.&lt;/p&gt;&lt;p&gt;• Design and implement an integrated Big Data platform and analytics solution&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;Let me know if you are interested in this job and/or if you can assist us by referring someone who is interested in this job since we offer lucrative referral bonuses.&lt;/p&gt;&lt;p&gt;Please share your resumes or references at &lt;strong&gt;Trilok.dandu@harveynash.com &lt;/strong&gt;or reach out to me directly at 415-527-0892&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;About us: &lt;/strong&gt;&lt;/p&gt;&lt;p&gt;Harvey Nash is a national, full-service talent management firm specializing in technology positions. Our company was founded with a mission to serve as the talent partner of choice for the information technology industry.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;Our company vision has led us to incredible growth and success in a relatively short period of time and continues to guide us today. We are committed to operating with the highest possible standards of honesty, integrity, and a passionate commitment to our clients, consultants, and employees.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;Utilizing our proprietary Predictive Staffing model, our company has enjoyed more than a decade of rapid growth, earning our reputation as a client-focused, efficient provider across a broad range of industries. Today, we serve top Fortune 1000 and successful privately-held companies all over the country, still operating under the simple idea that great people aligned under a common vision can achieve tremendous results.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;We are part of Harvey Nash Group, a global professional services organization with over forty offices worldwide.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;For more information, please visit us at &lt;strong&gt;https://www.harveynashusa.com/&lt;/strong&gt;&lt;/p&gt;",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-06T22:14:28.000Z"
    },
    "company": {
        "name": "Harvey Nash",
        "link": "https://uk.linkedin.com/company/harvey-nash"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 72,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Pleasanton",
        "region": "CA",
        "postal_code": "94588",
        "street_address": null,
        "latitude": 37.658436,
        "longitude": -121.877
    }
}