{
    "job": {
        "title": "Data Scientist, Apple Pay Analytics - Austin",
        "industry": "Consumer Electronics",
        "description": "&lt;br&gt;&lt;strong&gt;Summary&lt;br&gt;&lt;/strong&gt; &lt;br&gt;We are looking for a hands on top-tier full stack analytics professional to join our team and craft the future of Apple Pay. You are both analytically skilled and have a strong eye for business. You will be a thought partner to the product and business teams, understand their goals and then use your analytical power to surface impactful insights in support of these goals. Our culture is about getting things done iteratively and rapidly, with open feedback and debate along the way. We believe analytics is a team sport, but we strive for independent decision-making and taking smart risks.&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Key Qualifications&lt;br&gt;&lt;/strong&gt; &lt;br&gt;5+ years of proven experience in an advanced analytics role analyzing consumer behavior. Prior experience in the financial / fintech space is desirable&lt;br&gt;&lt;br&gt;Self directed and have taken projects from concept to delivery, balancing between multiple priorities and adhering to tight delivery timelines.&lt;br&gt;&lt;br&gt;Experience defining business requirements, developing measurement plans and working with cross functional teams towards driving client and server instrumentation&lt;br&gt;&lt;br&gt;Expertise with SQL / R / Python and familiarity with applying statistical methodologies and supervised / unsupervised ML techniques. Working knowledge of big data technologies such as Hadoop is desirable. &lt;br&gt;&lt;br&gt;Strong business mindset possessing the ability to condense complex analysis and technical concepts into clear and concise takeaways for business leaders.&lt;br&gt;&lt;br&gt;Excellent presentation and communication skills, with strong attention to detail.&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Description&lt;br&gt;&lt;/strong&gt; &lt;br&gt;You will play a key role improving the Apple Pay product experience. As a member of the analytics team you will be supporting a product function. You will partner with business owners, understand goals, craft critical metrics and measure ongoing performance. You will initially engage with the product and engineering teams in ensuring that we have the appropriate instrumentation in place to deliver on these metrics. You will subsequently apply your problem solving skills and your analytical chops to analyze product performance and identify key insights that inform product improvements and business strategy. The role requires a high degree of independence, ownership and collaboration working cross functionally across all levels of a highly matrixed organization.&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Education &amp;amp; Experience&lt;br&gt;&lt;/strong&gt; &lt;br&gt;Bachelor’s degree in Economics, Statistics, Computer Science, Mathematics or relevant field with 5+ years of relevant experience. Master’s degree preferred.&lt;br&gt;&lt;br&gt; &lt;br&gt;Role Number: 200279240&lt;br&gt;&lt;br&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-18T05:18:46.000Z"
    },
    "company": {
        "name": "Apple",
        "link": "https://www.linkedin.com/company/apple"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Austin",
        "region": "TX",
        "postal_code": "78746",
        "street_address": null,
        "latitude": 30.264978,
        "longitude": -97.7466
    }
}