{
    "job": {
        "title": "Software Engineer Intern",
        "industry": "",
        "description": "&lt;p&gt;Internship at a blockchain startup with unrivaled experience and a stellar reputation.&amp;nbsp;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;Koinos Group is a company established by the core development team behind the Steem blockchain who has leveraged their decades of combined experience to build a brand new blockchain with no fees, and no barriers to entry; Koinos. With incredible multi-language support, Koinos will be just as accessible to developers as it is to end-users making smart contracts more accessible than ever. Koinos will empower developers to build free-to-use decentralized applications and even release their own customized blockchains using the very same programming languages they already know and love, like TypeScript!&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;We have already released a prototype of our technology and are progressing rapidly toward the release of our mainnet at which point we expect massive growth.&amp;nbsp;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;We are looking for teachable, aspiring engineers who are passionate about blockchain technology, smart contracts, decentralization, and cryptocurrencies.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;If you’re looking to break into this exciting (and sometimes crazy) industry, then this is the perfect position for you!&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;",
        "employment_type": "INTERN",
        "date_posted": "2021-09-01T23:27:31.000Z"
    },
    "company": {
        "name": "KoinosGroup",
        "link": "https://www.linkedin.com/company/koinosgroup"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "United States",
        "postal_code": "13856",
        "street_address": null,
        "latitude": 42.93923,
        "longitude": -75.62005
    }
}