{
    "job": {
        "title": "Software Development Engineer",
        "industry": "Information Technology and Services,Computer Software,Internet",
        "description": "&lt;strong&gt;&lt;u&gt;Job Title&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;Software Development Engineer&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;Role Overview&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;Does the thought of applying your passion for cloud development to secure the digital lives of millions around the world excite you? McAfee is looking for software engineer that can help build its trusted consumer products, web platforms and services. We dig deeper into customer problems to provide an effective solution that makes customers lives easier. You will be part of a development team that prides in striving to delight the McAfee customers. Join the customer obsessed team!&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;Company Overview&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;From device to cloud, McAfee provides market-leading cybersecurity solutions for both business and consumers. We help businesses orchestrate cyber environments that are truly integrated, where protection, detection, and correction of security threats happen simultaneously. For consumers, McAfee secures your devices against viruses, malware, and other threats, both at home and away. We want to continue to shape the future of cybersecurity by working together to build best in class products and solutions.&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;About The Role&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;Develop and debug complex software in multiple web technologies.&lt;/li&gt;&lt;li&gt;Determine best coding practices, development tools, and validation requirements.&lt;/li&gt;&lt;li&gt;Architect and develop large-scale web and API applications on AWS focusing on performance, scalability and stability.&lt;/li&gt;&lt;li&gt;Work with multiple technologists in the company and within the industry including developers and project managers to evaluate feasibility of requirements and determine priorities for development.&lt;/li&gt;&lt;li&gt;Enjoy learning new things.&lt;/li&gt;&lt;li&gt;Love taking on difficult challenges and finding creative solutions.&lt;/li&gt;&lt;li&gt;Have open minds to new ideas and enjoy helping people so that they are not stuck.&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;&lt;u&gt;About You&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;Your background includes 5+ years of experience in server-side application development.&lt;/li&gt;&lt;li&gt;Fluent in any of these: Golang, NodeJS, C# or Java&lt;/li&gt;&lt;li&gt;Familiar with Serverless Application Model and REST.&lt;/li&gt;&lt;li&gt;You understand the overall AWS Cloud infrastructure (EC2, Lambda, RDS, S3 etc).&lt;/li&gt;&lt;li&gt;You are proficient in developing end debugging cloud-based applications using AWS.&lt;/li&gt;&lt;li&gt;You will have a working knowledge with relational SQL and NoSQL databases.&lt;/li&gt;&lt;li&gt;You have have Software Development process, optimization techniques, and testing methodologies.&lt;/li&gt;&lt;li&gt;Other scripting languages, Python and NodeJS are a bonus.&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;&lt;u&gt;Company Benefits And Perks&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;We work hard to embrace diversity and inclusion and encourage everyone at McAfee to bring their authentic selves to work every day. We offer a variety of social programs, flexible work hours and family-friendly benefits to all of our employees.&lt;br&gt;&lt;ul&gt;&lt;li&gt;Pension and Retirement Plans&lt;/li&gt;&lt;li&gt;Medical, Dental and Vision Coverage&lt;/li&gt;&lt;li&gt;Paid Time Off&lt;/li&gt;&lt;li&gt;Paid Parental Leave&lt;/li&gt;&lt;li&gt;Support for Community Involvement&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;We're serious about our commitment to diversity which is why McAfee prohibits discrimination based on race, color, religion, gender, national origin, age, disability, veteran status, marital status, pregnancy, gender expression or identity, sexual orientation or any other legally protected status.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-14T17:00:37.000Z"
    },
    "company": {
        "name": "McAfee",
        "link": "https://www.linkedin.com/company/mcafee"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Jose",
        "region": "CA",
        "postal_code": "95148",
        "street_address": null,
        "latitude": 37.334793,
        "longitude": -121.888145
    }
}