{
    "job": {
        "title": "Associate Software Engineer for RHEL Migrations - Remote",
        "industry": "Computer Software,Information Technology and Services",
        "description": "&lt;strong&gt;&lt;u&gt;Job Summary&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;The Red Hat Engineering team is looking for a Software Engineer with practical experience in operating system migrations to join our team. In this role, you will help with creating migration tools for moving systems from one version of Red Hat Enterprise Linux (RHEL) to the next. You will also design solutions for migrating other operating systems to Red Hat Enterprise Linux (RHEL). As a Software Engineer, you will work with innovative technology and will help improve the user experience for Linux admins. You will work as part of an international team. This role will allow you to learn more about the inner workings of Linux and to improve your Python language skills. You will work on the upstream projects in GitHub and your contributions will be visible to anyone including the community and customers. Successful applicants must reside in a country where Red Hat is registered to do business.&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;Primary Job Responsibilities&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;Develop next generation migration tools for cloud environments &lt;/li&gt;&lt;li&gt;Contribute to upstream software development for the Convert2RHEL project &lt;/li&gt;&lt;li&gt;Design, develop, and deliver features for Red Hat’s upgrades and migrations teams&lt;/li&gt;&lt;li&gt;Work in a continuous integration (CI) and continuous delivery (CD) environment for rapid development and feedback&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;&lt;u&gt;Required Skills&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;2+ years of software development experience&lt;/li&gt;&lt;li&gt;Practical coding experience in Python or similar language&lt;/li&gt;&lt;li&gt;Linux system administration knowledge &lt;/li&gt;&lt;li&gt;Experience writing scripts to troubleshoot and correct Linux system issues&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;&lt;u&gt;The Following Are Considered a Plus&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;Experience in Linux kernel or Linux user space development &lt;/li&gt;&lt;li&gt;Upstream involvement in open source projects, including patches submitted for upstream inclusion&lt;/li&gt;&lt;li&gt;Practical experience with agile software development &lt;/li&gt;&lt;li&gt;Ability to work in a CI and CD environment&lt;/li&gt;&lt;li&gt;Experience in automation using Ansible or similar&lt;/li&gt;&lt;li&gt;Familiarity with OpenShift &lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;&lt;u&gt;About Red Hat&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;Red Hat is the world’s leading provider of enterprise open source software solutions, using a community-powered approach to deliver reliable and high-performing Linux, hybrid cloud, container, and Kubernetes technologies. Red Hat helps customers integrate new and existing IT applications, develop cloud-native applications, standardize on our industry-leading operating system, and automate, secure, and manage complex environments. Award-winning support, training, and consulting services make Red Hat a trusted adviser to the Fortune 500. As a strategic partner to cloud providers, system integrators, application vendors, customers, and open source communities, Red Hat can help organizations prepare for the digital future.&lt;br&gt;&lt;br&gt;Red Hat is proud to be an equal opportunity workplace and an affirmative action employer. We review applications for employment without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, ancestry, citizenship, age, veteran status, genetic information, physical or mental disability, medical condition, marital status, or any other basis prohibited by law.&lt;br&gt;&lt;br&gt;Red Hat does not seek or accept unsolicited resumes or CVs from recruitment agencies. We are not responsible for, and will not pay, any fees, commissions, or any other payment related to unsolicited resumes or CVs except as required in a written contract between Red Hat and the recruitment agency or party requesting payment of a fee.&lt;br&gt;&lt;br&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:47:18.000Z"
    },
    "company": {
        "name": "Red Hat",
        "link": "https://www.linkedin.com/company/red-hat"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Raleigh",
        "region": "NC",
        "postal_code": "27699",
        "street_address": null,
        "latitude": 35.781303,
        "longitude": -78.64168
    }
}