{
    "job": {
        "title": "Senior Data Scientist / Machine Learning Engineer",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Dice is the leading career destination for tech experts at every stage of their careers. Our client, Medix IT Staffing Solutions, is seeking the following. Apply via Dice today!&lt;br&gt;&lt;br&gt;Medix is currently seeking a Senior Data Scientist Machine Learning Engineer for an exciting DIRECT HIRE job opportunity with one of our top consumer goods clients. This role is an on-site position and will require local candidates. ABOUT OUR CLIENT ABOUT THIS ROLE Our client is seeking a Senior Data Scientist to head-up a growing program for conducting deep analysis on a portfolio of consumer goods and supply chain. This role will also be conducting Machine Learning for consumer analytics customer sentiment, in addition to aiding with other Machine Learning projects across the organization. DAY TO DAY RESPONSIBILITIES WILL INCLUDE Working as a Senior Data Scientist in a highly collaborative, Agile Development environment Working within an AWS Cloud environment, using analytics engine and cluster computing frameworks like Spark, MapR, Tez and Yarn Providing technical guidance and mentorship for new less experienced team members (both onshore and offshore) Working with tools like Data Robot and Dataiku DSS to explore, prototype and build models in collaboration with the team (other Data Analysts and Data Engineers) Working with the Data Integration team to collect and validate the data sets Working extensively with R and Python Python tools to extract and manipulate data (Scikit-learn, Pandas, Numpy, Scipy, PySpark, NLTK) Creating and deploying various machine learning algorithms, such as linear logistic regression, Decision Tree, Random Forest, etc in order to create precision results and outcomes. Running and conducting deep analysis on Supply Chain concerns - Demand Forecasting, Sentiment Analysis, Survival Analysis, NLT, AB Testing and Customer Segmentation analysis. Running predictive analytics to gain insights into consumer behaviors Using data visualization software to effectively redact and communicate data outcomes, and recommendations to senior leadership (using Tableau, RShiny, or similar tools) Presenting outcomes and targeted recommendations to C-level executives REQUIRED PROFESSIONAL EXPERIENCE QUALIFICATIONS Required Master of Science in a Computer Science or Engineering field Required 4+ years experience as a Data Scientist Expertise with Python Python tools (Scikit-learn, Pandas, Numpy, Scipy, PySpark, NLTK) Experience with data manipulation analysis using R Experience working with cloud data tools - Spark MapR Data visualization tools - Tableau or RShiny, or similar Data collaboration tools such as Dataiku, Datarobot or RapidMiner ADDITIONAL INFORMATION Position Location Remote Position Type Direct Hire Full Time Compensation Range 140,000 - 145,000 base salary + bonus Benefits Our client offers an exceptional full-time benefits package, including a fantastic medical benefits package for employee + family members, generous paid time off, a 401K retirement savings plan with company contributions, profit sharing, continuing training and tuition reimbursement, college savings plans, Employee Assistance programs and much more!",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-19T00:00:00.000Z"
    },
    "company": {
        "name": "Dice",
        "link": "https://www.linkedin.com/company/dice"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Owings Mills",
        "region": "MD",
        "postal_code": "21117",
        "street_address": null,
        "latitude": 39.41368,
        "longitude": -76.781654
    }
}