{
    "job": {
        "title": "Cashier",
        "industry": "Construction,Retail,Hospital &amp; Health Care",
        "description": "SUMMARY As a Cashier, you are a vital part of our store team that is responsible for the day to day operations and the care and service provided to our customers/patients. This individual is responsible for provide excellent customer service to people shopping in Rite Aid stores. All duties described in this document are to be performed in keeping with the core values and service attributes consistent with the Rite Aid brand and strategy. The associate is responsible for the functions below, in addition to other duties as assigned: Provide excellent customer service by assisting customers with their shopping needs, answering customer inquiries, and resolving customer complaints. Engage with customers in a friendly and efficient manner while completing customer transactions on the cash register. Maintain the cleanliness and organization of the store. Stock store shelves and end-caps with merchandise when it is delivered to the store. Assist store leadership in ensuring merchandise on the shelves is within date. Ensure the proper identification is produced when selling alcohol, tobacco, and lottery tickets, if applicable. Assist with the operation of the One-hour Photo department, if applicable. Build displays of merchandise and complete new plan-o-grams. Complete inventory counts and order merchandise based on the results. Put up signs that identify items on sale in weekly advertisements and take down this signage when the sale is over. Assist with price markdowns and changes for merchandise on the shelves. Experience / Requirements&lt;br&gt;&lt;ul&gt;&lt;li&gt;Ability to work a flexible schedule to meet the needs of the business. * The above information represents a summary of the functions and requirements of this position. Additional details are available on the full job description. Education N/A&lt;/li&gt;&lt;/ul&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:27:42.000Z"
    },
    "company": {
        "name": "RITE AID",
        "link": "https://www.linkedin.com/company/riteaid"
    },
    "education": {
        "required_credential": "high school"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Oregon",
        "region": "OH",
        "postal_code": "43618",
        "street_address": null,
        "latitude": 41.637054,
        "longitude": -83.4672
    }
}