{
    "job": {
        "title": "Silicon Validation Software Engineer: Linux Driver and Kernel Developer",
        "industry": "Consumer Electronics",
        "description": "&lt;br&gt;&lt;strong&gt;Summary&lt;br&gt;&lt;/strong&gt; &lt;br&gt;Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Dynamic, smart people and inspiring, innovative technologies are the norm here. The people who work here have reinvented entire industries with all Apple Hardware products. The same passion for innovation that goes into our products also applies to our practices strengthening our commitment to leave the world better than we found it. Join us to help deliver the next groundbreaking Apple product.&lt;br&gt;&lt;br&gt;&lt;br&gt;Are you passionate about changing the world? Join our growing Silicon Validation team. We have a critical impact on getting high quality functional products to millions of customers quickly and we are hiring all levels from junior to senior roles. As part of the silicon validation team, you will develop Linux device drivers and user-land tests for exercising and testing the various subsystems in complex SoCs.&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Key Qualifications&lt;br&gt;&lt;/strong&gt; &lt;br&gt;Experienced in embedded Linux kernel development experience&lt;br&gt;&lt;br&gt;Expertise with Linux, USB or USB4, and PCIe&lt;br&gt;&lt;br&gt;Solid knowledge of Linux kernel internals (process scheduler, memory management, concurrency/synchronization, memory allocation, file systems) and networking or storage subsystems architecture&lt;br&gt;&lt;br&gt;You bring extensive device driver development and support (one or more of USB, network, graphics, video, mtd, storage, power management)&lt;br&gt;&lt;br&gt;You have strong debugging skills in kernel context&lt;br&gt;&lt;br&gt;Experience with exercising/validation of system from user space, knowledge of user space API&lt;br&gt;&lt;br&gt;Ported/maintained Linux distribution for a platform&lt;br&gt;&lt;br&gt;Skilled C programmer&lt;br&gt;&lt;br&gt;Familiarity with ARM architecture a plus&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Description&lt;br&gt;&lt;/strong&gt; &lt;br&gt;- You will work closely with designers and architects to understand functional IP blocks and their use-cases&lt;br&gt;&lt;br&gt;&lt;br&gt;- You will be implementing BSP and doing software bringup on pre and post-silicon platforms&lt;br&gt;&lt;br&gt;&lt;br&gt;- You will be developing Linux device drivers and user-land tests for exercising and testing the various subsystems in complex SoCs. &lt;br&gt;&lt;br&gt;&lt;br&gt;- You will debug and root-cause a variety of hardware and software issues&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Education &amp;amp; Experience&lt;br&gt;&lt;/strong&gt; &lt;br&gt;BS / MS / Ph.D in EE or CS is required.&lt;br&gt;&lt;br&gt; &lt;br&gt;Role Number: 200012334&lt;br&gt;&lt;br&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-01T07:44:15.000Z"
    },
    "company": {
        "name": "Apple",
        "link": "https://www.linkedin.com/company/apple"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Diego",
        "region": "CA",
        "postal_code": "92161",
        "street_address": null,
        "latitude": 32.71576,
        "longitude": -117.16382
    }
}