{
    "job": {
        "title": "Big Data Engineer",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Dice is the leading career destination for tech experts at every stage of their careers. Our client, E-Solutions, Inc., is seeking the following. Apply via Dice today!&lt;br&gt;&lt;br&gt;Hi, Hope you are doing well. This is Sid from E-Solutions Inc., we have an urgent positions with our direct client, kindly send me your updated resume, if you are suitable for following Role Big Data Engineer Location Chicago, IL Richardson, TX Duration Long Term Contract Job Description- Experience in building stream-processing systems, using solutions such as Spark-Streaming Candidate must have experience on Scala, Spark and Hadoop. Proven experience on Big Data tools such as, Spark, Hive. Experience with integration of data from multiple data sources. Must have Experience with programming language such as Scala. Experience implementing Web application and Web Services APIs (RESTSOAP) Thanks Regards, Siddharth Chaudhary (Sid) P+1 408-694-3735 Disclaimer E-Solutions provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, disability, genetic information, marital status, amnesty, or status as a covered veteran in accordance with applicable federal, state and local laws. We especially invite women, minorities, veterans, and individuals with disabilities to apply. EEOAAMFVetDisability.",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-18T22:01:12.000Z"
    },
    "company": {
        "name": "Dice",
        "link": "https://www.linkedin.com/company/dice"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Richardson",
        "region": "TX",
        "postal_code": "75080",
        "street_address": null,
        "latitude": 32.960762,
        "longitude": -96.73352
    }
}