{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "Information Technology and Services,Semiconductors",
        "description": "&lt;p&gt;A successful deep learning chip start-up has developed an advanced voice AI processor that can be implemented into a variety of edge devices. &lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;They are looking for a strong speech and audio engineer with experience with classical methods and advanced neural networks to contribute to the further development of speech and audio processing algorithms. &lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;You'll work on a variety of projects including; multi-microphone spatial processing, acoustics echo cancellation, single-channel noise suppression. &lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;As SME, you'll advise current and future customers on integration into their listening and audio devices. You'll be working on IP that will translate to patents and publications in the field, as you work cross-functionally to develop state-of-the-art algorithms.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;To be considered, you'll need;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Ph.D. in a relevant technical field&lt;/li&gt;&lt;li&gt;5 years as a strong technical contributor in speech and/or audio processing&lt;/li&gt;&lt;li&gt;A strong list of patents and publications&lt;/li&gt;&lt;li&gt;In depth technical knowledge, ready to take on a SME role&lt;/li&gt;&lt;li&gt;Experience with; machine learning, deep learning, audio processing, speech processing, speech recognition, multi-microphone spatial processing, acoustics echo cancellation, single-channel noise suppression, acoustic testing, source separation, single-channel noise suppression, dereverberation&lt;/li&gt;&lt;/ul&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-28T08:39:09.000Z"
    },
    "company": {
        "name": "Big Cloud",
        "link": "https://uk.linkedin.com/company/big-cloud"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Irvine",
        "region": "CA",
        "postal_code": "92717",
        "street_address": null,
        "latitude": 33.68591,
        "longitude": -117.82472
    }
}