{
    "job": {
        "title": "Software Engineer - Front End (React)",
        "industry": "Automotive,Renewables &amp; Environment,Utilities",
        "description": "&lt;strong&gt;&lt;u&gt;Role&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;The Digital Experience team at Tesla is at the forefront of building a consistent, global customer experience across all digital touchpoints – web, native apps and in-car infotainment systems. This team is building the next generation products and supporting infrastructure which allows our customers, living in 60+ countries, to understand, interact and purchase our amazing vehicles and energy products.&lt;br&gt;&lt;br&gt;Tesla is seeking a Front-End Software Engineer to join our team and help build the next generation of web solutions for our service partners and customers as it relates to the ownership experience. You will be challenged to turn apps around quickly but thoughtfully, balancing speed to market with longevity and scalability, all in the name of extraordinary customer experiences.&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;Responsibilities&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt; Build awesome web experiences using React.js&lt;/li&gt;&lt;li&gt; Plan and accommodate all mediums, screen sizes and device types&lt;/li&gt;&lt;li&gt; Build in flexibility and customization from the start&lt;/li&gt;&lt;li&gt; Internalize the user and promote good usability and accessibility in every experience&lt;/li&gt;&lt;li&gt; Be nimble and react quickly to changing business conditions&lt;/li&gt;&lt;li&gt; Work with product managers, content producers, QA engineers and release engineers to own your solution from development to production&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;&lt;u&gt;Requirements&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt; 1+ years building web and/or mobile experiences with evidence of exceptional ability&lt;/li&gt;&lt;li&gt; Bachelor’s Degree in Computer Science or related field, or equivalent experience or other evidence of exceptional ability&lt;/li&gt;&lt;li&gt; Solid understanding of fundamental web technologies such as HTTP, REST, AJAX and JSON.&lt;/li&gt;&lt;li&gt; Strong proficiency in JavaScript / ES6, including DOM manipulation and the JavaScript object model&lt;/li&gt;&lt;li&gt; Thorough understanding of React.js and its core principles&lt;/li&gt;&lt;li&gt; Unit Testing with Jest/Enzyme&lt;/li&gt;&lt;li&gt; Experience with Redux&lt;/li&gt;&lt;li&gt; Experience with common front-end development tools such as Babel, Webpack, NPM, etc.&lt;/li&gt;&lt;li&gt; Experience working with RESTful APIs&lt;/li&gt;&lt;li&gt; Experience with Node.js and Express&lt;/li&gt;&lt;li&gt; Excellent mastery of web standards, cross-browser compatibility, accessibility and SEO.&lt;/li&gt;&lt;li&gt; Strong CSS skills w/ experience building responsive applications across a variety of browsers and devices using modern CSS3 techniques&lt;/li&gt;&lt;li&gt; Ability to identify tasks which require automation and automate them&lt;/li&gt;&lt;li&gt; Expert knowledge of maintaining and debugging live software systems&lt;/li&gt;&lt;/ul&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-30T08:14:45.000Z"
    },
    "company": {
        "name": "Tesla",
        "link": "https://www.linkedin.com/company/tesla-motors"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Fremont",
        "region": "CA",
        "postal_code": "94537",
        "street_address": null,
        "latitude": 37.5502,
        "longitude": -121.98083
    }
}