{
    "job": {
        "title": "Manufacturing Test Engineer",
        "industry": "Computer Software,Electrical/Electronic Manufacturing",
        "description": "&lt;br&gt;&lt;br&gt;&lt;strong&gt;Description&lt;br&gt;&lt;br&gt;&lt;/strong&gt;The Manufacturing Test Engineer develops and/or specifies necessary test equipment, software, and procedures for high volume production and testing of industrial and consumer goods. This role develops and maintains test software, technical specifications, and documentation for such equipment per established methods and also develops documentation and procedures as necessary for employee training and ISO compliance. This individual will work closely with other Engineering and Manufacturing personnel and provide assistance as needed for implementing test systems into production. The manufacturing test engineer will also assist with operations, maintenance, validation, troubleshooting, and repair of test equipment and software. &lt;br&gt;&lt;br&gt;&lt;strong&gt;Requirements:&lt;br&gt; Education:&lt;/strong&gt; Bachelor of Science degree in Engineering&lt;br&gt;&lt;br&gt;&lt;strong&gt;Experience: &lt;/strong&gt;Minimum 2 years of related engineering experience in the development of Test Systems using LabView, In-Circuit Testing (ICT), and Design For Test (DFT) Methods. Previous experience working in an environment in which 60 – 80% of the role’s daily activities were related to LabView development, PCBA functional Fixture designs, and electronic circuits analysis.&lt;br&gt;&lt;br&gt;&lt;strong&gt;Skills:&lt;/strong&gt; Specific skills related to the development of Test Systems using LabView for PCBA assemblies and strong understanding of electronic circuits.&lt;br&gt;&lt;br&gt;&lt;strong&gt;Location: &lt;/strong&gt;Tallassee, Alabama&lt;br&gt;&lt;br&gt;&lt;br&gt;&lt;br&gt; Education&lt;br&gt;&lt;br&gt;Required &lt;ul&gt;&lt;li&gt;Bachelors or better&lt;/li&gt; &lt;br&gt;&lt;br&gt;&lt;/ul&gt;Equal Opportunity Employer/Protected Veterans/Individuals with Disabilities&lt;br&gt;&lt;br&gt;The contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor’s legal duty to furnish information. 41 CFR 60-1.35(c)&lt;br&gt;&lt;br&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T22:45:41.000Z"
    },
    "company": {
        "name": "Neptune Technology Group",
        "link": "https://www.linkedin.com/company/neptune-technology-group"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Tallassee",
        "region": "AL",
        "postal_code": "36078",
        "street_address": null,
        "latitude": 32.537907,
        "longitude": -85.87871
    }
}