{
    "job": {
        "title": "Software Test Engineer",
        "industry": "Construction,Staffing and Recruiting,Hospital &amp; Health Care",
        "description": "&lt;strong&gt;Our client has a high-profile position open for an experienced QA Tester. Your career will need to demonstrate extensive experience in advanced softwere testing projects, but functional and automated and in an Agile environment. &lt;br&gt;&lt;br&gt;&lt;/strong&gt;&lt;strong&gt;Excellent global company; flexible and employee-focused and expanding. This is an opportunity to advance your career in a permanent position. Job is onsite in Florida, or remote with occasional travel possible. Compensation open; depends on job fit. Contract duration initially then conversion to in-house full-time hire.&lt;br&gt;&lt;/strong&gt;&lt;ul&gt; &lt;li&gt;Develop automation scripts&lt;/li&gt; &lt;li&gt;Work closely with development team to guide root cause analysis and keep improving automated quality processes.&lt;/li&gt; &lt;li&gt;Design and execute test strategies as part of an Agile scrum team.&lt;/li&gt; &lt;li&gt;Design, code, test, debug and document programs by using Agile development practices&lt;/li&gt; &lt;li&gt;Translate user stories and requirements to test cases&lt;/li&gt; &lt;li&gt;Participate in product design reviews to provide input on testability of functional requirements and product designs.&lt;/li&gt; &lt;li&gt;Collaborate with DevOps and continuous integration project leads to guide test automation infrastructure across multiple products.&lt;/li&gt; &lt;br&gt;&lt;br&gt;&lt;/ul&gt;&lt;strong&gt;&lt;u&gt;Required Skills&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt; &lt;li&gt;4+ years of Software Test Engineer experience&lt;/li&gt; &lt;li&gt;Ability to focus on deadlines and deliverables&lt;/li&gt; &lt;li&gt;A quick learner, a self-starter, able to work independently, and able to keep up with a fast-paced environment&lt;/li&gt; &lt;li&gt;Strong verbal, written, and interpersonal communication skills.&lt;/li&gt; &lt;li&gt;Experience in testing, knowledge of Automation Framework Design and implementation using selenium Tool is required&lt;/li&gt; &lt;li&gt;Experience working in both Agile and Waterfall methodologies&lt;/li&gt; &lt;li&gt;Experience working on cross functional teams.&lt;/li&gt; &lt;li&gt;Must understand version control software&lt;/li&gt; &lt;li&gt;Write writing clear, concise, and comprehensive test plans.&lt;/li&gt; &lt;li&gt;Experience using Azure DevOps&lt;/li&gt; &lt;li&gt;Experience with .NET framework and SQL Server&lt;/li&gt; &lt;li&gt;Knowledge of DevOps concepts and CI/CD tools&lt;/li&gt; &lt;li&gt;Experience using automation tools to test web services (REST, PCF )&lt;/li&gt; &lt;li&gt;Experience with SDLC and QA methodologies, including, Functional testing, E2E testing, Automation, Compatibility testing, Regression Testing and usability testing&lt;/li&gt; &lt;li&gt;Write and maintain test automation scripts&lt;/li&gt;&lt;/ul&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-12T00:00:00.000Z"
    },
    "company": {
        "name": "Gables Search Group",
        "link": "https://www.linkedin.com/company/gables"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Jacksonville",
        "region": "FL",
        "postal_code": "32277",
        "street_address": null,
        "latitude": 30.325968,
        "longitude": -81.65676
    }
}