{
    "job": {
        "title": "Senior Software Engineer - International Sam's Club Technology",
        "industry": "Information Technology and Services,Retail,Financial Services",
        "description": "&lt;strong&gt;&lt;u&gt;Position Summary... What You'll Do...&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;u&gt;What You'll Do...&lt;br&gt;&lt;/u&gt;&lt;ul&gt;&lt;li&gt;Leads and participates in medium- to large-scale projects by reviewing project requirements; translating requirements into technical solutions; gathering requested information (for example, design documents, product requirements, wire frames); writing and developing code; conducting unit testing; communicating status and issues to team members and stakeholders; collaborating with project team and cross functional teams; troubleshooting open issues and bug-fixes; ensuring on-time delivery and hand-offs; interacting with project manager to provide input on project plan; and providing leadership to the project team.&lt;/li&gt;&lt;li&gt;Leads the work of other small groups of four to six engineers, including offshore associates, for assigned Engineering projects by proving pertinent documents, direction, and examples; identifying short and long term solutions and timeline; reviewing and providing feedback for proposed solutions; and performing design and code reviews of changes.&lt;/li&gt;&lt;li&gt;Troubleshoots business and production issues by gathering information (for example, issue, impact, criticality, possible root cause); engaging support teams to assist in the resolution of issues; formulating an action plan; performing actions as designated in the plan; interpreting the results to determine further action; performs root cause analysis to prevent future occurrence of issues; and completing online documentation.&lt;/li&gt;&lt;li&gt;Provides support to the business by responding to user's questions, concerns, and issues (for example, technical feasibility, implementation strategies); identifying short- and long-term solutions; facilitating resolutions; and leading cross-functional partnership.&lt;/li&gt;&lt;li&gt;Leads the discovery phase of medium to large projects to come up with high level design by partnering with the product management, project management, business and user experience teams; and obtaining cross-function approvals. Demonstrates up-to-date expertise and applies this to the development, execution, and improvement of action plans by providing expert advice and guidance to others in the application of information and best practices; supporting and aligning efforts to meet customer and business needs; and building commitment for perspectives and rationales. Provides and supports the implementation of business solutions by building relationships and partnerships with key stakeholders; identifying business needs; determining and carrying out necessary processes and practices; monitoring progress and results; recognizing and capitalizing on improvement opportunities; and adapting to competing demands, organizational changes, and new responsibilities. Models compliance with company policies and procedures and supports company mission, values, and standards of ethics and integrity by incorporating these into the development and implementation of business plans; using the Open Door Policy; and demonstrating and assisting others with how to apply these in executing business processes and practices.&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;&lt;u&gt;About Global Tech&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;Imagine working in an environment where one line of code can make life easier for hundreds of millions of people and put a smile on their face. That’s what we do at Walmart Global Tech. We’re a team of 15,000+ software engineers, data scientists and service professionals within Walmart, the world’s largest retailer, delivering innovations that improve how our customers shop and empower our 2.2 million associates. To others, innovation looks like an app, service or some code, but Walmart has always been about people. People are why we innovate, and people power our innovations. Being human-led is our true disruption.&lt;br&gt;&lt;br&gt;We’re virtual&lt;br&gt;&lt;br&gt;Working virtually this year has helped us make quicker decisions, remove location barriers across our global team, be more flexible in our personal lives and spend less time commuting. Today, we are reimagining the tech workplace of the future by making a permanent transition to virtual work for most of our team. Of course, being together in person is an important part of our culture and shared success. We’ll collaborate in person at a regular cadence and with purpose.&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;Minimum Qualifications&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;3+ years of experience in Java/J2EE/Spring Boot&lt;/li&gt;&lt;li&gt;4+ years of experience in any of the JavaScript framework like React, or Angular&lt;/li&gt;&lt;li&gt;Demonstrated high level design of systems&lt;/li&gt;&lt;li&gt;Solid experience in large scale distributed systems and event-driven architecture.&lt;/li&gt;&lt;li&gt;Solid understanding of building &amp;amp; consuming RESTful APIs.&lt;/li&gt;&lt;li&gt;Have a strong passion for developing elegant and well-designed frameworks.&lt;/li&gt;&lt;li&gt;Experience in building and designing scalable Frontend systems&lt;/li&gt;&lt;li&gt;Agile Methodology practices&lt;/li&gt;&lt;li&gt;Familiarity with CI/CD and unit testing&lt;/li&gt;&lt;li&gt;2+ years of experience with leading teams&lt;/li&gt;&lt;li&gt;Bachelor of Science and 5 years' experience in software engineering&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;&lt;u&gt;Good To Have&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;Have experience designing, building and deploying APIs and applications.&lt;/li&gt;&lt;li&gt;Have experience with Kafka or other high volume-low latency messaging infrastructure &lt;/li&gt;&lt;li&gt;Have experience with Azure Cloud Stack or other cloud stacks&lt;/li&gt;&lt;li&gt;Have the knowledge of open-source libraries, design patterns and micro-service architecture. &lt;/li&gt;&lt;li&gt;Have the knowledge of Kubernetes and other CNCF tools&lt;/li&gt;&lt;li&gt;Curious and have the desire to learn&lt;/li&gt;&lt;li&gt;Approaches risks head-on with options to mitigate &lt;/li&gt;&lt;li&gt;Have ability to influence and mentor a team of developers&lt;/li&gt;&lt;li&gt;Have ability to present and communicate with Executive leadership&lt;/li&gt;&lt;/ul&gt; Minimum Qualifications...&lt;br&gt;&lt;br&gt;&lt;em&gt;&lt;em&gt;Outlined below are the required minimum qualifications for this position. If none are listed, there are no minimum qualifications. &lt;br&gt;&lt;br&gt;&lt;/em&gt;&lt;/em&gt;Bachelor’s degree in Computer Science and 3 years’ experience in software engineering or related field OR 5 years’ experience in software&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;Engineering Or Related Field. Preferred Qualifications...&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;em&gt;&lt;em&gt;Outlined below are the optional preferred qualifications for this position. If none are listed, there are no preferred qualifications. &lt;br&gt;&lt;br&gt;&lt;/em&gt;&lt;/em&gt;Master’s degree in Computer Science or related field and 2 years' experience in software engineering or related field Primary Location...2101 SE SIMPLE SAVINGS DR, BENTONVILLE, AR 72712-4304, United States of America",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-27T05:20:00.000Z"
    },
    "company": {
        "name": "Walmart",
        "link": "https://www.linkedin.com/company/walmart"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Bentonville",
        "region": "AR",
        "postal_code": "72716",
        "street_address": null,
        "latitude": 36.37187,
        "longitude": -94.20272
    }
}