{
    "job": {
        "title": "Distinguished Software Engineer",
        "industry": "Information Technology and Services,Retail,Financial Services",
        "description": "&lt;strong&gt;&lt;u&gt;Position Summary... What You'll Do...&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;Reduces customer impact (for example, sales loss) due to applications systems issues by ensuring high quality using quality standards; measuring&lt;br&gt;&lt;br&gt;sales loss and performing root cause analysis; publishing results; and developing future prevention plan.&lt;br&gt;&lt;br&gt;Develops and executes technical software development strategy for ecommerce applications and systems using current business roadmap by&lt;br&gt;&lt;br&gt;analyzing competitive trends and patterns; analyzing the technology landscape; evaluating short and long term implications; and communicating&lt;br&gt;&lt;br&gt;strategies and change initiatives clearly.&lt;br&gt;&lt;br&gt;Drives continuous process improvement and innovation by identifying inefficiencies in current processes; improving agility of the team; and adopting&lt;br&gt;&lt;br&gt;industry trends for innovation.&lt;br&gt;&lt;br&gt;Ensures product quality by developing and executing quality assurance plan; using data and experience to determine customer needs; directing&lt;br&gt;&lt;br&gt;continuous improvement and eliminating non-value-added work; measuring milestones for quality; and developing mitigation plans to ensure quality.&lt;br&gt;&lt;br&gt;Executes engineering projects by developing resource planning for business roadmap in advance; removing barriers to success; ensuring others&lt;br&gt;&lt;br&gt;have the information, training, resources, and implementation time needed to succeed; developing and upgrading work assignments and processes to&lt;br&gt;&lt;br&gt;accomplish goals across functions, organizations, and geographies; reviewing project progress against timeline; and developing and communicating&lt;br&gt;&lt;br&gt;logical, convincing justifications, including lessons learned, to build commitment and support.&lt;br&gt;&lt;br&gt;Provides overall direction by analyzing business objectives and customer needs; developing, communicating, building support for, and implementing&lt;br&gt;&lt;br&gt;business strategies, plans, and practices; analyzing costs and forecasts and incorporating them into business plans; determining and supporting&lt;br&gt;&lt;br&gt;resource requirements; evaluating operational processes; measuring outcomes to ensure desired results; identifying and capitalizing on improvement&lt;br&gt;&lt;br&gt;opportunities; promoting a customer environment; and demonstrating adaptability and sponsoring continuous learning.&lt;br&gt;&lt;br&gt;Develops and implements strategies to attract and maintain a highly skilled and engaged workforce by diagnosing capability gaps; recruiting,&lt;br&gt;&lt;br&gt;selecting, and developing talent; supporting mentorship, workforce development, and succession planning; and leveraging the capabilities of new and&lt;br&gt;&lt;br&gt;existing talent.&lt;br&gt;&lt;br&gt;Cultivates an environment where associates respect and adhere to company standards of integrity and ethics by integrating these values into all&lt;br&gt;&lt;br&gt;programs and practices; developing consequences for violations or non-compliance; and supporting the Open Door Policy.&lt;br&gt;&lt;br&gt;Develops and leverages internal and external partnerships and networks to maximize the achievement of business goals by sponsoring and leading&lt;br&gt;&lt;br&gt;key community outreach and involvement initiatives; engaging key stakeholders in the development, execution, and evaluation of appropriate&lt;br&gt;&lt;br&gt;business plans and initiatives; and supporting associate efforts in these areas.&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;Minimum Qualifications...&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;em&gt;&lt;em&gt;Outlined below are the required minimum qualifications for this position. If none are listed, there are no minimum qualifications. &lt;br&gt;&lt;br&gt;&lt;/em&gt;&lt;/em&gt;Bachelor’s degree in Computer Science and 7 years’ experience in software engineering or related field OR 9 years’ experience in software engineering or related field. Preferred Qualifications...&lt;br&gt;&lt;br&gt;&lt;em&gt;&lt;em&gt;Outlined below are the optional preferred qualifications for this position. If none are listed, there are no preferred qualifications. &lt;br&gt;&lt;br&gt;&lt;/em&gt;&lt;/em&gt;Master’s degree in Computer Science or related field and 6 years' experience in software engineering Primary Location...2628 NE UNIVERSITY VILLAGE ST, SEATTLE, WA 98105-5023, United States of America",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-30T05:11:49.000Z"
    },
    "company": {
        "name": "Walmart",
        "link": "https://www.linkedin.com/company/walmart"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 84,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Seattle",
        "region": "WA",
        "postal_code": "98133",
        "street_address": null,
        "latitude": 47.60323,
        "longitude": -122.33028
    }
}