{
    "job": {
        "title": "Jr. Web Developer",
        "industry": "Marketing and Advertising,Computer Software,Hospital &amp; Health Care",
        "description": "&lt;strong&gt;&lt;u&gt;Overview&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;We are looking for a Jr. Front-end Associate Web Developer to program user interfaces updates for out web-based applications using HTML, CSS and JavaScript. We are looking for someone who is passionate about taking user interface designs and bringing them to life with clean and elegant code. You must be creative, focused, results-oriented, self-motivated, and a resourceful problem solver. Our ideal candidate is one that can thrive in a fast-moving, creative company.&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;Responsibilities&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;Core Accountabilities:Developing cross-browser SEO friendly pages and updating templates using HTML, CSS and JavaScript.Strong experience working in Adobe Photoshop, including the ability to turn PSD's into usable application assets (images, fonts, etc).Developing HTML email newsletters.Fluency with browser debugging tools/extensions for debugging (firebug, chrome developer tools).Must be able to develop on both PC and Mac OS.Must be able to work in a fast paced environment.Must be able to clearly communicate technical challenges to the business.Must have exceptional attention to detail.Excellent teamwork skills with an ability to get the work done with minimal supervision.&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;Qualifications&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;Education/Experience Required:2+ years of experience with front-end web development.Experience developing adaptive sites for desktop, tablet, and mobile devices.Experience in using Salesforce business manager.Experience using Salesforce Marketing Cloud to create HTML email campaigns.Experience in updating and modifying existing assets and templates. Physical Requirements:The physical demands described here are representative of those that are required by an associate to successfully perform the essential functions of this job. While performing the duties of this job, the associate is regularly required to talk or hear. The associate is frequently required to sit; stand; walk; use hands to finger, handle or feel; as well as reach with hands and arms. The associate must frequently lift and/or move up to 15 pounds and occasionally lift and/or move up to 35 pounds. Specific vision abilities required by this job include close vision, distance vision, depth perception and ability to adjust focus. Ability to work in open environment with fluctuating temperatures and standard lighting.Ability to work on computer and mobile phone for multiple hours; with frequent interruptions.Required to travel in elevator or stairwells to attend meetings and engage with associates on multiple floors throughout building.&lt;br&gt;&lt;br&gt;PDN-94483f50-5b8a-4348-a48e-d3dc485f17f0",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-31T20:47:22.000Z"
    },
    "company": {
        "name": " Professional Diversity Network",
        "link": "https://www.linkedin.com/company/prodivnet"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Anaheim",
        "region": "CA",
        "postal_code": "92812",
        "street_address": null,
        "latitude": 33.83449,
        "longitude": -117.91564
    }
}