{
    "job": {
        "title": "Staff Site Reliability Engineer - McD Tech Labs",
        "industry": "Restaurants",
        "description": "&lt;p&gt;We are currently looking for skilled Site Reliability Engineers to develop, maintain, and support container orchestration (kubernetes), distributed ML workloads, network services, storage layers, and configuration of a petabyte scale AWS storage and Kafka stream stack.&lt;br&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;Responsibilities:&lt;br&gt;&lt;br&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Develop and maintain high performance k8s clusters across multiple regions&lt;/li&gt;&lt;li&gt;Develop and maintain telemetry infrastructure and visualization for metrics, logs, and distributed tracing.&lt;/li&gt;&lt;li&gt;Develop and maintain the operational configuration of a petabyte scale storage and stream analysis service&lt;/li&gt;&lt;li&gt;Work with Audio and Speech AI Engineers to accelerate development and deployment of heterogeneous analysis and distributed training pipelines&lt;/li&gt;&lt;li&gt;Participate in the definition and management of SLIs, SLOs and error budgets for infrastructure and production services.&lt;/li&gt;&lt;li&gt;Design and implement infrastructure-as-code pipelines&lt;br&gt;&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;Qualifications&lt;br&gt;&lt;br&gt;&lt;/strong&gt;&lt;p&gt;Required Qualifications:&lt;br&gt;&lt;br&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;5+ Years Linux experience configuring, supporting, and optimizing &lt;br&gt;&lt;br&gt;&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;4+ Years AWS experience designing, implementing, and support cloud-based infrastructure &lt;br&gt;&lt;br&gt;&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;2+ Years experience architecting, deploying, and supporting kubernetes in cloud environments. &lt;br&gt;&lt;br&gt;&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;3+ years experience designing and supporting distributed systems. &lt;br&gt;&lt;br&gt;&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;Experience writing production code in one of more languages such as Python, Java, Go in a microservices environment. &lt;br&gt;&lt;br&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;Desired Qualifications:&lt;br&gt;&lt;br&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;&lt;p&gt;Familiarity running distributed ML workloads in cluster orchestrated environments &lt;br&gt;&lt;br&gt;&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;Experience building and supporting telemetry infrastructure (Grafana, Prometheus, and similar tools) &lt;br&gt;&lt;br&gt;&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;Experience designing and implementing infrastructure as code pipelines &lt;br&gt;&lt;br&gt;&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;2+ Years PubSub Experience (Kafka, SQS, SNS, MQTT) &lt;br&gt;&lt;br&gt;&lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;Plus for experience implementing best security practices into infrastructure &lt;br&gt;&lt;br&gt;&lt;br&gt;&lt;br&gt;&lt;/p&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;Additional Information&lt;br&gt;&lt;br&gt;&lt;/strong&gt;&lt;p&gt;McDonald’s is committed to providing qualified individuals with disabilities reasonable accommodations to perform the essential functions of their jobs. Additionally, if you (or another applicant of whom you are aware) require assistance accessing or reading this job posting or otherwise seek assistance in the application process, please contact recruiting.supportteam@us.mcd.com&lt;br&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;McDonald’s provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to sex, sex stereotyping, pregnancy (including pregnancy, childbirth, and medical conditions related to pregnancy, childbirth, or breastfeeding), race, color, religion, ancestry or national origin, age, disability status, medical condition, marital status, sexual orientation, gender, gender identity, gender expression, transgender status, protected military or veteran status, citizenship status, genetic information, or any other characteristic protected by federal, state or local laws. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.&lt;br&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;Nothing in this job posting or description should be construed as an offer or guarantee of employment.&lt;br&gt;&lt;br&gt;&lt;/p&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-21T18:26:14.000Z"
    },
    "company": {
        "name": "McDonald's",
        "link": "https://www.linkedin.com/company/mcdonald%27s-corporation"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Mountain View",
        "region": "CA",
        "postal_code": "94040",
        "street_address": null,
        "latitude": 37.39008,
        "longitude": -122.08139
    }
}