{
    "job": {
        "title": "Sr Software Engineer- Access -c++",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Dice is the leading career destination for tech experts at every stage of their careers. Our client, Experis, is seeking the following. Apply via Dice today!&lt;br&gt;&lt;br&gt;We are seeking a Sr Software Engineer Responsibilities Work with a small and talented team to develop scalable, highly performant platform services Develop and contribute to C++ and C SDKs used by AAA titles to integrate against common game services Implement new features and services to support the needs of multiple teams Participate in the ongoing effort to improve our platform infrastructure, with the goal of achieving ever increasing service availability Develop unit and integration test code to validate service reliability Requirements A degree in computer science, or a related field A minimum of 3 years of relevant work experience Ability to work in a collaborative environment Good communication skills Strong understanding of C++ Prior development work on distributed systems and clientserver architectures Strong data-structure, logic, and algorithm skills Experience with protocol and API design Database development experience in one or more of the following MySQL, Oracle, Cassandra, etc. Self-motivated and able to break down complex tasks A desire to help make the service the best that it can be for our players",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:19:15.000Z"
    },
    "company": {
        "name": "Dice",
        "link": "https://www.linkedin.com/company/dice"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Austin",
        "region": "TX",
        "postal_code": "78746",
        "street_address": null,
        "latitude": 30.264978,
        "longitude": -97.7466
    }
}