{
    "job": {
        "title": "Research Scientist, Optical Coating",
        "industry": "Internet",
        "description": "Facebook's mission is to give people the power to build community and bring the world closer together. Through our family of apps and services, we're building a different kind of company that connects billions of people around the world, gives them ways to share what matters most to them, and helps bring people closer together. Whether we're creating new products or helping a small business expand its reach, people at Facebook are builders at heart. Our global teams are constantly iterating, solving problems, and working together to empower people around the world to build community and connect in meaningful ways. Together, we can help people build stronger communities - we're just getting started.&lt;br&gt;&lt;br&gt;At Facebook Reality Labs (FRL), our goal is to explore, innovate and design novel interfaces and hardware subsystems for virtual, augmented, and mixed reality experiences. We are looking for a skilled and motivated Optical Coating Scientist to join our Optical Product Development team at FRL. In this role, you will work on the state-of-the-art thin film coatings for AR/VR products within a fast-paced environment, from concept through technology transfer to high volume manufacturing.&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;Responsibilities&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;Lead project-level optical coating development activities: design novel thin-film coating structure to meet project requirements and product specification, and develop novel thin-film deposition process solutions to fulfill the thin-film coating design.&lt;/li&gt;&lt;li&gt;Work effectively with a diverse, interdisciplinary group of researchers &amp;amp; engineers across teams to deliver the coating solutions into final FRL products.&lt;/li&gt;&lt;li&gt;Take a systematic approach to analyze coating defects and failures to determine root cause and implement corrective actions.&lt;/li&gt;&lt;li&gt;Communicate within a development team, with internal stakeholders, and with outside vendors.&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;Minimum Qualification&lt;br&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;Advanced Degree in applied physics, optics, material science or a related field with emphasis on optical coating design and development.&lt;/li&gt;&lt;li&gt;Knowledge of design, fabrication and metrology techniques for novel thin-film optical coatings, along with a physics-based understanding of coating-substrate material interactions.&lt;/li&gt;&lt;li&gt;Knowledge of display systems and how coatings interact with display characteristics and performance.&lt;/li&gt;&lt;li&gt;2+ years experience with MATLAB, Python, or similar program for coating design and analysis.&lt;/li&gt;&lt;li&gt;Experience with research published in high-impact journals and international conference presentations or publications.&lt;br&gt;&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;&lt;u&gt;Preferred Qualification&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;5+ years hands-on experience in multiple conventional thin film deposition technologies (thermal and electron-beam evaporation, sputtering, chemical vapor deposition) and thorough understanding of the physics and practical mechanics of these processes.&lt;/li&gt;&lt;li&gt;Demonstrated track record of successfully transferring into high volume manufacturing.&lt;/li&gt;&lt;li&gt;Understanding of thin film fundamental design theory and material properties.&lt;/li&gt;&lt;li&gt;Knowledge and experience on hard/dip coating, roll-to-roll and nanostructure coating.&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;Facebook is proud to be an Equal Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Facebook is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at accommodations-ext@fb.com.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-20T06:16:22.000Z"
    },
    "company": {
        "name": "Facebook",
        "link": "https://www.linkedin.com/company/facebook"
    },
    "education": {
        "required_credential": null
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Redmond",
        "region": "WA",
        "postal_code": "98073",
        "street_address": null,
        "latitude": 47.67491,
        "longitude": -122.12399
    }
}