{
    "job": {
        "title": "System Engineer with Security Clearance",
        "industry": "Information Technology and Services,Defense &amp; Space,Computer Software",
        "description": "&lt;strong&gt;&lt;u&gt;Overview&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;Tyto Athene is a full-service integrator focused on helping clients accelerate their ability to make decisions by providing ubiquitous and secure access to enterprise information throughout their operating environment. Tyto Athene uses a myriad of technologies, innovative thinking, and proven processes to deliver successful outcomes for its clients worldwide. Tyto is seeking a System Engineer to support a customer in Columbia, MD. The candidate who fills this role will support management of the requirements and solution architectures for a large enterprise IT services environment. This is a hands-on role that ultimately results in the delivery of large enterprise Information Technology products and services. Responsibilities: Translating the core architecture for business requirements into a technical solution consisting of platform, network, software and COTS hardware through functional, performance and reliability analysis using engineering models and techniques.&lt;br&gt;&lt;br&gt;Investigate and document customer technology requirements.&lt;br&gt;&lt;br&gt;Assess the current functionality, business requirements and gaps between baseline and target hardware, software, data, platforms and systems.&lt;br&gt;&lt;br&gt;Develop solution architectures for IT related technology support systems.&lt;br&gt;&lt;br&gt;Review and recommend solution(s) based on results of independent assessment of current and future performance, stability and systems life cycle issues.&lt;br&gt;&lt;br&gt;Analyze the future state of technology needed to meet customer requirements; summarize business objectives.&lt;br&gt;&lt;br&gt;Follow existing system design processes and standards in the design and development of target architecture.&lt;br&gt;&lt;br&gt;Communicate with various levels of management.&lt;br&gt;&lt;br&gt;Requirements: Active TS/SCI with Polygraph required.&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;Experience In The Following Areas Highly Desired&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;No demonstrated experience is required. Bachelor’s degree in System Engineering, Computer Science, Information Systems, Engineering Science, Engineering Management, or related discipline from an accredited college or university is required. Five (5) years of SE experience may be substituted for a Bachelor’s degree.&lt;br&gt;&lt;br&gt;IT Industry: Trends &amp;amp; Directions&lt;br&gt;&lt;br&gt;Data-driven decisions&lt;br&gt;&lt;br&gt;Operating Systems and Environments&lt;br&gt;&lt;br&gt;Process Management&lt;br&gt;&lt;br&gt;Product &amp;amp; Service Design &amp;amp; Development&lt;br&gt;&lt;br&gt;System and Technology Integration&lt;br&gt;&lt;br&gt;Technology Architecture Equal Opportunity Employer: Disability/Veteran&lt;br&gt;&lt;br&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-31T07:26:37.000Z"
    },
    "company": {
        "name": "ClearanceJobs",
        "link": "https://www.linkedin.com/company/clearancejobs.com"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Columbia",
        "region": "MD",
        "postal_code": "21044",
        "street_address": null,
        "latitude": 39.217525,
        "longitude": -76.86873
    }
}