{
    "job": {
        "title": "Software Engineer II",
        "industry": "Information Technology and Services,Retail,Financial Services",
        "description": "&lt;strong&gt;&lt;u&gt;Position Summary... What You'll Do...&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;As a Software Engineer II on the Global Workforce Management tech team, you will help develop the future of workforce tools. You will be joining an amazing team of engineers developing cloud-based micro-services using NodeJS and Java. The systems and platforms you will contribute to will have significant impact across all retail sectors becoming the next generation of workforce management. Working with business partners you will champion development/architectural best-practices rapidly scaling the platform across international marketplaces in a fun, collaborative, fast-paced environment.&lt;br&gt;&lt;br&gt;What you’ll do…&lt;br&gt;&lt;ul&gt;&lt;li&gt;Partner with several teams to develop technical components and deploying micro-services and event-based systems to public/private cloud environments across the globe.&lt;/li&gt;&lt;li&gt;Collaborate with other software engineers on the various layers of infrastructure for our applications using your experience with NodeJS, Java, Spring, and Docker.&lt;/li&gt;&lt;li&gt;Thrive in a fast-moving team writing solid, scalable, quality, reusable code. &lt;/li&gt;&lt;li&gt;Apply software development practices such as CI/CD, TDD, Scrum, Agile&lt;/li&gt;&lt;li&gt;Develop innovation strategies, processes, and best practices&lt;/li&gt;&lt;li&gt;1+ years developing API’s, event-based workflow, micro-services with NodeJS and Java&lt;/li&gt;&lt;li&gt;Experience with Azure cloud architecture, DevOps (CI/CD, High-Availability, Auto-Scaling) and IaC/IaaS&lt;/li&gt;&lt;li&gt;Experience working with Docker, Kubernetes, and NoSql&lt;/li&gt;&lt;li&gt;Strong logging and Quality experience implementing automated testing platforms and unit tests&lt;/li&gt;&lt;li&gt;Proficient in Git, Jira, SCRUM&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;Benefits &amp;amp; Perks&lt;br&gt;&lt;br&gt;Beyond competitive pay, you can receive incentive awards for your performance. Other great perks include 401(k) match, stock purchase plan, paid maternity and parental leave, PTO, multiple health plans, and much more.&lt;br&gt;&lt;br&gt;Equal Opportunity Employer&lt;br&gt;&lt;br&gt;Walmart, Inc. is an Equal Opportunity Employer – By Choice. We believe we are best equipped to help our associates, customers, and the communities we serve live better when we really know them. That means understanding, respecting, and valuing diversity- unique styles, experiences, identities, ideas, and opinions – while being inclusive of all people.&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;About Global Tech&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;Imagine working in an environment where one line of code can make life easier for hundreds of millions of people and put a smile on their face. That’s what we do at Walmart Global Tech. We’re a team of 15,000+ software engineers, data scientists and service professionals within Walmart, the world’s largest retailer, delivering innovations that improve how our customers shop and empower our 2.2 million associates. To others, innovation looks like an app, service, or some code, but Walmart has always been about people. People are why we innovate, and people power our innovations. Being human-led is our true disruption.&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;Minimum Qualifications...&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;em&gt;&lt;em&gt;Outlined below are the required minimum qualifications for this position. If none are listed, there are no minimum qualifications. &lt;br&gt;&lt;br&gt;&lt;/em&gt;&lt;/em&gt;Bachelor’s degree in Computer Science and 1 years’ experience in software engineering or related field OR 3 years’ experience in software engineering or related field. Preferred Qualifications...&lt;br&gt;&lt;br&gt;&lt;em&gt;&lt;em&gt;Outlined below are the optional preferred qualifications for this position. If none are listed, there are no preferred qualifications. &lt;br&gt;&lt;br&gt;&lt;/em&gt;&lt;/em&gt;Primary Location...805 SE MOBERLY LN, BENTONVILLE, AR 72712, United States of America",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-30T05:09:59.000Z"
    },
    "company": {
        "name": "Walmart",
        "link": "https://www.linkedin.com/company/walmart"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Bentonville",
        "region": "AR",
        "postal_code": "72716",
        "street_address": null,
        "latitude": 36.37187,
        "longitude": -94.20272
    }
}