{
    "job": {
        "title": "Software Engineer",
        "industry": "",
        "description": "&lt;p&gt;&lt;strong&gt;Company Description:&lt;/strong&gt; &lt;/p&gt;&lt;p&gt;Sync Computing is an MIT based startup company on a mission to build the next leap in distributed computing in the cloud. Sync Computing’s foundational technology is capable of solving large-scale scheduling optimization problems instantly, unlocking unprecedented gains in the orchestration of large-scale computing applications. Businesses worldwide will be able to utilize cloud resources with optimal efficiency, saving billions of dollars and endless hours on the cloud. We are targeting applications in data analytics, machine learning, and high-performance computing. &lt;/p&gt;&lt;br&gt;&lt;p&gt;&lt;strong&gt;Job Description:&lt;/strong&gt; &lt;/p&gt;&lt;p&gt;Sync Computing is searching for a full-time&amp;nbsp; software engineer located in Cambridge, MA. &lt;/p&gt;&lt;br&gt;&lt;p&gt;As a software engineer, you will be part of a growing interdisciplinary team and will work closely with other world-class engineers to build, test, and deploy cutting-edge distributed software packages on the cloud. We are looking for someone who loves diving into code, working with complex systems, and building solutions. The responsibilities and qualifications of the position include: &lt;/p&gt;&lt;br&gt;&lt;ol&gt;&lt;li&gt;&lt;p&gt;Provide and document reliable solutions within application development, deployment, and monitoring &lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;Work in cloud development environment such as AWS, GCP &lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;Build connective code between core technology and product &lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;Adhere to code documentation and version control best practices &lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;Strong understanding of modern web applications design architecture (experience with React is a plus), good API design patterns (experience with RESTful is a plus), performance, and scale &lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;2+ years of experience in a similar role &lt;/p&gt;&lt;/li&gt;&lt;li&gt;&lt;p&gt;Proficiency in Python (experience with fastAPI is a plus) &lt;/p&gt;&lt;/li&gt;&lt;/ol&gt;&lt;br&gt;&lt;p&gt;&lt;strong&gt;Qualifications:&lt;/strong&gt; &lt;/p&gt;&lt;p&gt;A technical background in electrical engineering, computer science, applied math, physics, or related fields is required, with a B.S., M.S. or PhD degree. The candidate must be familiar with basic programming languages (e.g. Python) and Linux operating systems. Experience with AWS infrastructure is preferred. Candidates must have excellent written and oral communication skills, a strong desire to learn, be self-directed, and be motivated to work in a fast paced start-up environment. &lt;/p&gt;&lt;br&gt;&lt;p&gt;&lt;strong&gt;How to Apply:&lt;/strong&gt; &lt;/p&gt;&lt;p&gt;To learn more, please send us a CV at careers@synccomputing.com&lt;/p&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-18T01:41:31.000Z"
    },
    "company": {
        "name": "Sync Computing",
        "link": "https://www.linkedin.com/company/synccomputing"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Cambridge",
        "region": "MA",
        "postal_code": "02239",
        "street_address": null,
        "latitude": 42.36525,
        "longitude": -71.10502
    }
}