{
    "job": {
        "title": "Software Engineer",
        "industry": "Consumer Electronics",
        "description": "&lt;br&gt;&lt;strong&gt;Summary&lt;br&gt;&lt;/strong&gt; &lt;br&gt;At Apple, great ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Bring passion and dedication to your job, and there’s no telling what we could accomplish.&lt;br&gt;&lt;br&gt;&lt;br&gt;Apple Cloud Machine Learning team is looking for hardworking and strong Software and ML platform engineers (at all levels of seniority) to help us build the next generation Anomaly detection platform, and other ML platforms. Our team is solving key challenges in detecting outliers in big data using Machine Learning, model delivery, and serving with driven focus on data security and preserving user privacy. &lt;br&gt;&lt;br&gt;&lt;br&gt;You’ll work in a small and dynamic team, building new functionalities for Anomaly detection, and ML platforms and collaborating across groups. You’ll also participate in crafting systems, algorithm, and optimization efforts to ship product with impact.&lt;br&gt;&lt;br&gt;&lt;br&gt;This position requires a broad set of software engineering skills, focusing on developing ML platform pieces. You should have experience with shipping production systems that scale to millions of users.&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Key Qualifications&lt;br&gt;&lt;/strong&gt; &lt;br&gt;You've earned a: (a) PhD in Computer Science with experience building production systems, or (b) MS in CS with 4+ years of experience in working with large data projects with at least 1 year running experiments or building experimentation platform, or (c) BS in CS with 6+ years of experience in the industry with at least 2 year running experiments or building experimentation platform.&lt;br&gt;&lt;br&gt;&lt;br&gt;Proven track record of delivering production software.&lt;br&gt;&lt;br&gt;&lt;br&gt;Experience building large scale applications/services with Java, Scala or Python.&lt;br&gt;&lt;br&gt;&lt;br&gt;Experience with SQL/NoSQL databases, Spark, Hadoop, or other distributed frameworks.&lt;br&gt;&lt;br&gt;&lt;br&gt;Experience with machine learning solution on time-series is a plus.&lt;br&gt;&lt;br&gt;&lt;br&gt;Strong data-driven thinking.&lt;br&gt;&lt;br&gt;&lt;br&gt;Proven mathematical knowledge.&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Description&lt;br&gt;&lt;/strong&gt; &lt;br&gt;In this role, you’ll &lt;br&gt;&lt;br&gt;&lt;br&gt;- Build platforms and features which will help data driven decision-making and improve Apple’s user experience. &lt;br&gt;&lt;br&gt;&lt;br&gt;- Build anomaly detection platform and work closely with partner teams to help integration and analysis.&lt;br&gt;&lt;br&gt;&lt;br&gt;- Build distributed backend systems for training and serving ML models at Apple scale.&lt;br&gt;&lt;br&gt;&lt;br&gt;- Build backend for data visualization tools to facilitate analysis &amp;amp; synthesis of complex datasets. &lt;br&gt;&lt;br&gt;&lt;br&gt;- Provide technical leadership. &lt;br&gt;&lt;br&gt;&lt;br&gt;- Influence data-driven optimization efforts.&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Education &amp;amp; Experience&lt;br&gt;&lt;/strong&gt; &lt;br&gt;B.S. in Computer Science with 6+ years experience&lt;br&gt;&lt;br&gt;&lt;br&gt;M.S. in Computer Science with 4+ years experience&lt;br&gt;&lt;br&gt;&lt;br&gt;Ph.D. in CS, industry experience a plus&lt;br&gt;&lt;br&gt; &lt;br&gt;Role Number: 200269967&lt;br&gt;&lt;br&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-22T06:37:43.000Z"
    },
    "company": {
        "name": "Apple",
        "link": "https://www.linkedin.com/company/apple"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 72,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Seattle",
        "region": "WA",
        "postal_code": "98133",
        "street_address": null,
        "latitude": 47.60323,
        "longitude": -122.33028
    }
}