{
    "job": {
        "title": "Executive Vice President and Chief Operating Officer",
        "industry": "",
        "description": "&lt;p&gt;Trust for America’s Health (TFAH) a leading nonprofit, nonpartisan public health policy research and advocacy organization in Washington DC is recruiting an Executive Vice-President and Chief Operating Officer. If you are committed to strengthening the nation’s public health infrastructure with a focus on health equity TFAH may be the place for you.&lt;/p&gt;&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;p&gt;The Executive Vice President and Chief Operating Officer will be a seasoned and innovative leader with deep knowledge of the public health policy landscape, a strong operational skillset, and significant management experience.&amp;nbsp;The ideal candidate will have a minimum of 10 years of experience in senior leadership roles in policy, advocacy, and/or public health organizations; extensive knowledge of federal legislative, regulatory, and budget processes, decisionmakers, and key stakeholders.&amp;nbsp;A Master’s Degree in Public Policy, Public Health, Juris Doctor, or the equivalent is strongly preferred. Candidates may submit their cover letter, outlining their interest and qualifications, along with their resume via NPAG’s candidate portal (https://recruitcrm.io/apply/25436357)&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:28:04.000Z"
    },
    "company": {
        "name": "Trust for America's Health",
        "link": "https://www.linkedin.com/company/tfah"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 120,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Washington",
        "region": "DC",
        "postal_code": "20239",
        "street_address": null,
        "latitude": 38.892063,
        "longitude": -77.01991
    }
}