{
    "job": {
        "title": "DRUID Software Engineer - Druid, SaaS, AWS",
        "industry": "Internet",
        "description": "If you are a DRUID Software Engineer with experience, please read on! This role is with a rapidly growing Stealth Startup in Santa Clara. Currently there is a urgent need for a skilled Software Engineer with either DRUID data platform or Flink infrastructure to rapidly scale their AWS systems. Sorry more details can not be given until we speak by phone. Only candidates with this specific experience will be considered.&lt;br&gt;&lt;br&gt;What You Need for this Position&lt;br&gt;&lt;ul&gt;&lt;li&gt; Druid&lt;/li&gt;&lt;li&gt; SaaS&lt;/li&gt;&lt;li&gt; AWS&lt;/li&gt;&lt;li&gt; Flink&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;So, if you are a DRUID Software Engineer with experience, please apply today!&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;Email Your Resume In Word To&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also:&lt;br&gt;&lt;br&gt;Stephen.Maroda@CyberCoders.com&lt;br&gt;&lt;ul&gt;&lt;li&gt;Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : SM1-1609077 -- in the email subject line for your application to be considered.***&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;Stephen Maroda - Lead Recruiter - CyberCoders&lt;br&gt;&lt;br&gt;Applicants must be authorized to work in the U.S.&lt;br&gt;&lt;br&gt;&lt;strong&gt;CyberCoders, Inc is proud to be an Equal Opportunity Employer&lt;br&gt;&lt;br&gt;&lt;/strong&gt;All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.&lt;br&gt;&lt;br&gt;&lt;strong&gt;Your Right to Work&lt;/strong&gt; - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-31T07:06:27.000Z"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Santa Clara",
        "region": "CA",
        "postal_code": "95050",
        "street_address": null,
        "latitude": 37.352394,
        "longitude": -121.95308
    }
}