{
    "job": {
        "title": "Data Analyst",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Dice is the leading career destination for tech experts at every stage of their careers. Our client, TechWish, is seeking the following. Apply via Dice today!&lt;br&gt;&lt;br&gt;Responsibilities include Create purchase orders in POD system from given data input(s). Track purchase orders to construction timelines to determine pay date(s). Secure access to data sources Define processes to Improve the quality of data (standards) 1. Frequency of data collection 2. Consistency (normalization) 3. Automate data gathering activities. Leverage design skills to build user-oriented dashboards and meaningful, actionable data visualizations to meet the needs of the Market for monthly and quarterly financial reports. Present all data insights and findings in succinct and creative ways using data visualizations for the Market Leadership Team. Identifies financial status by comparing and analyzing actual results with plans and forecasts. Guides cost analysis process by establishing and enforcing policies and procedures providing trends and forecasts explaining processes and techniques recommending actions. Improves financial status by analyzing results monitoring variances identifying trends recommending actions to management. Reconciles transactions by comparing and correcting data. Maintains database by entering, verifying, and backing up data. Recommends actions by analyzing and interpreting data and making comparative analyses studying proposed changes in methods and materials. Increases productivity by developing automated accounting applications coordinating information requirements. Protects operations by keeping financial information confidential. Well versed with MS. Office (Excel Power point).",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-18T22:01:47.000Z"
    },
    "company": {
        "name": "Dice",
        "link": "https://www.linkedin.com/company/dice"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Tampa",
        "region": "FL",
        "postal_code": "33675",
        "street_address": null,
        "latitude": 27.947424,
        "longitude": -82.45878
    }
}