{
    "job": {
        "title": "C#/.Net Developer (Full Stack)",
        "industry": "Information Technology and Services,Computer Software,Computer &amp; Network Security",
        "description": "&lt;strong&gt;&lt;u&gt;Summary&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;Provides and/or facilitates the planning, analysis, design, development, implementation, and maintenance of software applications.&lt;br&gt;&lt;br&gt;&lt;strong&gt;DUTIES&lt;br&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;Participate in the backlog identification and refinement for new and/or existing systems.&lt;/li&gt;&lt;li&gt;Work with other Application Development team members to estimate, plan and schedule tasks to meet assigned target dates. &lt;/li&gt;&lt;li&gt;Document new and existing systems, develop workflows, and create other supporting documents in adherence to all departmental and corporate standards.&lt;/li&gt;&lt;li&gt;Obtain approvals and consult with production control as needed to prepare programs/systems for implementation; correspond with clients to implement operations programs/enhancements and identify/resolve problems.&lt;/li&gt;&lt;li&gt;Review completed code, documentation and other deliverables to ensure that they meet specifications and requirements based on defined expectations.&lt;/li&gt;&lt;li&gt;Learn, use and enhance the delivery of systems, using Agile Software Engineering and DevOps practices.&lt;/li&gt;&lt;/ul&gt; &lt;strong&gt;REQUIREMENTS&lt;br&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;Bachelor’s degree in Business, Computer Science, Engineering or related field.&lt;/li&gt;&lt;li&gt;Minimum 3 years application development experience.&lt;/li&gt;&lt;li&gt;Insurance or financial services industry experience is a plus.&lt;/li&gt;&lt;li&gt;Demonstrated successful experience and knowledge in the Microsoft .NET platform including one or more of the following .NET, .NET Core, MVC, Web Forms, C#&lt;/li&gt;&lt;li&gt;Demonstrated successful experience and knowledge in one or more source control systems such as: Azure DevOps, Git, TFS.&lt;/li&gt;&lt;li&gt;Demonstrated successful experience and knowledge of one or more database management systems, such as: Microsoft SQL Server or Oracle.&lt;/li&gt;&lt;li&gt;Demonstrated successful experience and knowledge of web services frameworks (development or consumption), such as: REST or SOAP.&lt;/li&gt;&lt;li&gt;Demonstrated successful experience and knowledge of unit and functional testing frameworks, such as: MSTest, XUnit, NUnit, Cucumber or Selenium.&lt;/li&gt;&lt;li&gt;Demonstrated working knowledge of object-oriented analysis and development (OOAD), data structures and relational database concepts.&lt;/li&gt;&lt;li&gt;Demonstrated successful experience in one or more development methodologies, preferably those that support Agile software development.&lt;/li&gt;&lt;li&gt;Demonstrated working knowledge of data structure and database concepts and practices.&lt;/li&gt;&lt;li&gt;Proficient computer skills required including Microsoft Office Suite.&lt;/li&gt;&lt;li&gt;Demonstrated successful ability to build positive relationships and partnerships within department, across the organization and with external customers.&lt;/li&gt;&lt;li&gt;Excellent organizational skills and ability to function in a fast paced, highly visible, and changing environment.&lt;/li&gt;&lt;li&gt;Excellent verbal and written communication skills with the ability to interact with internal and external customers.&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;#.netcore #.net",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-21T01:46:47.000Z"
    },
    "company": {
        "name": "Root Seven",
        "link": "https://www.linkedin.com/company/recruiting-information-technology"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Farmington Hills",
        "region": "MI",
        "postal_code": "48321",
        "street_address": null,
        "latitude": 42.484673,
        "longitude": -83.35918
    }
}