{
    "job": {
        "title": "Software Engineer, Web - iWork",
        "industry": "Consumer Electronics",
        "description": "&lt;br&gt;&lt;strong&gt;Summary&lt;br&gt;&lt;/strong&gt; &lt;br&gt;Imagine what you could do here. At Apple, new ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. &lt;br&gt;&lt;br&gt;&lt;br&gt;** We are hiring in Vancouver, WA, Pittsburgh, PA, Cupertino, CA and Vancouver, Canada ** &lt;br&gt;&lt;br&gt;&lt;br&gt;Are you interested in creating amazing user experiences on the Web with a friendly and inclusive team? Apple’s iWork team is looking for a passionate engineer to bring their unique perspective and join us in building world-class apps used by millions of people to get things done at home, in their communities, and in their jobs every day.&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Key Qualifications&lt;br&gt;&lt;/strong&gt; &lt;br&gt;Solid understanding of JavaScript frameworks and the challenges in the space, preferably with advanced usage of at least one of React, Angular, Vue.js, or SproutCore &lt;br&gt;&lt;br&gt;Ability to learn and quickly work with new and unfamiliar technologies&lt;br&gt;&lt;br&gt;Solid understanding of object-oriented design&lt;br&gt;&lt;br&gt;Ability to work collaboratively and communicating ideas clearly within a team and with outside stakeholders&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Description&lt;br&gt;&lt;/strong&gt; &lt;br&gt;In this role you will help us craft new and innovative features in Keynote, Numbers, and Pages, and take existing features to the next level. You’ll contribute to every facet of our large, sophisticated codebase, from high-level UI to backend integration with Apple's infrastructure. You will work with human interface designers, or site reliability engineers, or quality assurance teams, and teams in other disciplines to go beyond code and bring your ideas to life.&lt;br&gt;&lt;br&gt;&lt;br&gt;The ideal candidate is pragmatic, self-motivated, thoughtful individual with a strong desire to learn and develop technical expertise in a wide array of technologies. iWork engineers have exposure to nearly every technology available on Apple’s platforms, get to ship code targeting many of our products, and get to learn from experienced engineers. You’ll be trusted to work with various teams to come up with the best solutions to technical problems and drive their adoption.&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Education &amp;amp; Experience&lt;br&gt;&lt;/strong&gt; &lt;br&gt;Bachelor’s Degree or equivalent work experience.&lt;br&gt;&lt;br&gt; &lt;br&gt;Role Number: 200254983&lt;br&gt;&lt;br&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-23T06:35:00.000Z"
    },
    "company": {
        "name": "Apple",
        "link": "https://www.linkedin.com/company/apple"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Pittsburgh",
        "region": "PA",
        "postal_code": "15235",
        "street_address": null,
        "latitude": 40.44217,
        "longitude": -79.99496
    }
}