{
    "job": {
        "title": "Data Scientist (Remote)",
        "industry": "Information Technology and Services,Insurance,Financial Services",
        "description": "You are a driven and motivated problem solver ready to pursue meaningful work. You strive to make an impact every day &amp;amp; not only at work, but in your personal life and community too. If that sounds like you, then you've landed in the right place.&lt;br&gt;&lt;br&gt;The Hartford seeks energetic and passionate data science talent to build and create best in class data science teams. Our Data science team has developed industry-leading capabilities, driving streamlined processes and smarter decision making. We support a variety of functions including Actuarial, Product, Underwriting and Sales. Join our team as a Data Scientist to improve our view of segmentation through research of new features and techniques. The areas of our work ranges across a wide range of business use cases including but not limited to underwriting, claims, operations, risk engineering, third party data and digital analytics. Our team’s focus is to develop analytic and predictive modeling solutions and partner with our data engineers to generate and enhance existing feature engineering as well as modeling assets and abilities. Our toolbox consists of but is not limited to predictive modeling techniques, machine learning, cognitive computing, unsupervised learning, and augmented intelligence.&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;Minimum Experience&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt; Master’s in Statistics, Applied Mathematics, Quantitative Economics, Actuarial Science, or similar analytical field or progress towards or attainment of a relevant professional designation (i.e. ACAS/FCAS, ASA/FSA, CFA, CSPA, etc.) &lt;/li&gt;&lt;li&gt; 3+ years of relevant experience in Research Function in Insurance or Financial Services or related field &lt;/li&gt;&lt;li&gt; Experience with database RDBMS technologies (i.e. Oracle, SQL Server, Teradata, etc.) &lt;/li&gt;&lt;li&gt; Subject matter expert in modeling data and analytical capabilities utilizing Python &lt;br&gt;&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;&lt;u&gt;Preferred Skills&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt; Experience with big data technologies (i.e. Hadoop, Spark, Hive, EMR, etc.) &lt;/li&gt;&lt;li&gt; Passion for learning new skills and the ability to adjust priorities on multiple projects based on changing demands/needs &lt;/li&gt;&lt;li&gt; Verbal/written communication skills, with particular emphasis on communicating to non-technical audiences &lt;/li&gt;&lt;li&gt; Experience with Financial Lines insurance a plus &lt;br&gt;&lt;/li&gt;&lt;/ul&gt;Equal Opportunity Employer/Females/Minorities/Veterans/Disability/Sexual Orientation/Gender Identity or Expression/Religion/Age&lt;br&gt;Data Scientist - GD08AE",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-19T16:15:38.000Z"
    },
    "company": {
        "name": "The Hartford",
        "link": "https://www.linkedin.com/company/the-hartford"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}