{
    "job": {
        "title": "Software Engineer",
        "industry": "Internet",
        "description": "&lt;strong&gt;Company&lt;br&gt;&lt;br&gt;&lt;/strong&gt;Dandy is a business-in-a-box for dentists. Our vision is to become the operating system for every dental office in America by leading the transition to digital dentistry for the $200 billion industry. Headquartered in New York City, Dandy is backed by the world's leading venture capital investors.&lt;br&gt;&lt;br&gt;&lt;strong&gt;Job Description&lt;br&gt;&lt;br&gt;&lt;/strong&gt;Dandy is hiring a team of topflight software engineers to build digital products and scale our managed marketplace. As one of Dandy's first engineers, you will play a key role in building our tech team. You'll constantly be challenged to learn new technologies, and be given the freedom to solve problems on your own and learn by doing.&lt;br&gt;&lt;br&gt;Our stack: TypeScript, NodeJS, NestJS, React/Redux, PostgreSQL&lt;br&gt;&lt;br&gt;&lt;strong&gt;What You'll Do&lt;br&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;Build our core engineering infrastructure, including new product features and enhancements.&lt;/li&gt;&lt;li&gt;Work closely across different business functions, incorporating data from our operations, sales, and account management teams in order to craft elegant solutions to our most pressing challenges.&lt;/li&gt;&lt;li&gt;Reinvent a broken experience and disrupt a legacy industry through novel and scalable product design.&lt;br&gt;&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;What We're Looking For&lt;br&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;Software engineering experience, preferably at a big tech or high growth startup environment.&lt;/li&gt;&lt;li&gt;Ability to understand how our business functions and how challenges and bottlenecks can be addressed through the engineering team.&lt;/li&gt;&lt;li&gt;Collaborative, team-centric mindset. We are a small but mighty team and everyone must be aligned on our goals.&lt;/li&gt;&lt;li&gt;With the above stated, we are open to candidates of all backgrounds and encourage you to apply if interested! Dandy is committed to cultivating a diverse and inclusive team and none of the above points are 100% required.&lt;br&gt;&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;Bonus Points For:&lt;br&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;Experience documenting coding and architectural decisions&lt;/li&gt;&lt;li&gt;Experience with TypeScript&lt;/li&gt;&lt;li&gt;Time spent at a venture-backed startup during hyper-growth&lt;/li&gt;&lt;li&gt;Relentlessly positive attitude, strong sense of humor, and the ability to have fun at work&lt;br&gt;&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;Benefits&lt;br&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;Best in class healthcare including medical, dental, and vision&lt;/li&gt;&lt;li&gt;Competitive salary and equity packages&lt;/li&gt;&lt;li&gt;Fully stocked kitchen with snacks and coffee&lt;/li&gt;&lt;li&gt;401k program &lt;br&gt;&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;Dandy is proud to be an equal opportunity employer. We are committed to building a diverse and inclusive culture and celebrate authenticity. We do not discriminate on the basis of race, religion, color, national origin, gender, gender identity, sexual orientation, age, marital status, disability, protected veteran status, or any other legally protected characteristics.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-07T00:00:00.000Z"
    },
    "company": {
        "name": "Dandy",
        "link": "https://www.linkedin.com/company/dandyofficial"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}