{
    "job": {
        "title": "Software Engineer- Entry to Senior Level with Security Clearance",
        "industry": "Information Technology and Services,Defense &amp; Space,Computer Software",
        "description": "&lt;strong&gt;&lt;u&gt;Desired Skills&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;WHERE YOUR STORY BEGINS. At George Street, we see a strong relationship between quality work, technology, and family. We are motivated by our family and motivated to provide and protect our community. SIMPLY PUT, WE TAKE CARE OF OUR CUSTOMERS AND OUR EMPLOYEES. Full benefits provided. The George Street tagline succinctly conveys our philosophy. Our focus is to genuinely invest in our employees and customers success and provide a family culture. We empower our employees with the support, training, and financial incentives they need, freeing them to focus on our customers. Develop, maintain, and enhance complex and diverse software systems (e.g., processing-intensive analytics, novel algorithm development, manipulation of extremely large data sets, real-time systems, and business management information systems) based upon documented requirements Review and test software components for adherence to the design requirements and documents test results Utilize software development and software design methodologies appropriate to the development environment Provide specific input to the software components of system design to include hardware/software trade-offs, software reuse, use of Commercial-Off-the-Shelf (COTS)/Government-Off-the-Shelf (GOTS) in place of new development, and requirements analysis and synthesis from system level to individual software components.&lt;br&gt;&lt;br&gt;GUI/Visualization: Basic Usability Engineering skills, HTML, CSS, Java, JavaScript, D3, WebGL, OpenGL or similar technologies, Java, MongoDB, Accumulo, MapReduce, REST, JSON, JavaScript,Knowledge of Customer’s Corporate Cloud systems&lt;br&gt;&lt;br&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-23T06:23:47.000Z"
    },
    "company": {
        "name": "ClearanceJobs",
        "link": "https://www.linkedin.com/company/clearancejobs.com"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Annapolis Junction",
        "region": "MD",
        "postal_code": "20701",
        "street_address": null,
        "latitude": 39.121826,
        "longitude": -76.78431
    }
}