{
    "job": {
        "title": "Software Engineer I",
        "industry": "Marketing and Advertising,Internet,Retail",
        "description": "zulily is a retailer obsessed with bringing our customers something special every day. Unique products from up-and-coming brands are featured alongside favorites from top brands, including clothing, home decor, accessories, toys and gifts, giving customers something new to discover each morning at an incredible price. We are fast-paced, innovative and metric-driven, with a team passionate for delighting our customers. Whether you want to work with incredible product selection, develop smart marketing plans, help us in our pursuit of faster fulfillment, or do something else awesome in between, we have a place for you. With locations in Seattle, Reno, Columbus and Bethlehem, our team is excited to be changing the way people shop every day - and we are just getting started.&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;Job Description Details&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;As a Software Engineer I at zulily, you are chartered with building the technology that powers tthat powers of the fastest growing online retailers in history. Our incredible growth means we face new challenges on a consistent basis. In this position, you must explore new technologies and collaborate with other engineers to design and build world-class technical services. Your team deploys production code rapidly to keep pace with zulily’s changing business, you are mindful of avoiding technical debt, and you take ownership of your team's roadmap and everything you do. You will be responsible for choosing libraries and building a platform and methodology for building and delivering web applications for both mobile and PC. You will design and implement complex features within a rich UI and work with product managers and directly with end-users to understand their needs and propose solutions. In addition, you will develop a set of software libraries, best practices, and documentation to allow their fellow engineers to painlessly create fantastic applications with considerably less UI experience than the candidate has.&lt;br&gt;&lt;ul&gt;&lt;li&gt;Experience in programming, software design and architecture&lt;/li&gt;&lt;li&gt;Experience in web service or middle tier development of data driven apps.&lt;/li&gt;&lt;li&gt;Ability to work in a fast paced, evolving, growing and dynamic environment Ability to work with and influence others&lt;/li&gt;&lt;li&gt;Ability to think system wide and translate business requirements into code Analytical skills with a data driven approach and ability to measure impact of project&lt;/li&gt;&lt;li&gt;Experience and ability to demonstrate advanced proficiency, in writing complex SQL queries and stored procedures&lt;/li&gt;&lt;li&gt;Willingness to explore new ideas and have a passion to make them happen&lt;/li&gt;&lt;/ul&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-01T01:06:43.000Z"
    },
    "company": {
        "name": "Zulily",
        "link": "https://www.linkedin.com/company/zulily"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Seattle",
        "region": "WA",
        "postal_code": "98133",
        "street_address": null,
        "latitude": 47.60323,
        "longitude": -122.33028
    }
}