{
    "job": {
        "title": "Data Scientist (Remote)",
        "industry": "Marketing and Advertising",
        "description": "&lt;p&gt;Data Scientist, Remote&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;Engineers at VDX.tv develop the next-generation products powering a scalable ad tech platform which enables advertisers across the globe to reach out to their consumers and deliver effective, engaging advertising. We are looking for engineers who are passionate about solving challenges of large-scale system design, artificial intelligence, information retrieval, massive data pipelines, UI design, richmedia frameworks, data insights, optimization and targeting strategies. &lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;We are looking to hire a Data Scientist for our Machine Learning team. The mission of the machine learning team is to develop campaign optimization, price optimization, conversion optimization, identity resolution and geo indexing algorithms, models to help achieve advertiser goals, automate campaign management and improve ROI.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;Responsibilities&lt;/p&gt;&lt;ul&gt;&lt;li&gt;The position requires one to work on complex technical projects with peers in an innovative and fast-paced environment.&lt;/li&gt;&lt;li&gt;Play an individual contributor role with high accountability, positive impact in small teams and work well both as an individual contributor and as part of the team.&lt;/li&gt;&lt;li&gt;Work on algorithms and systems that power the AD platform.&lt;/li&gt;&lt;li&gt;Develop predictive behavioral models.&lt;/li&gt;&lt;li&gt;Develop algorithms for identity resolution.&lt;/li&gt;&lt;li&gt;Develop geo indexing algorithms.&lt;/li&gt;&lt;li&gt;Work on massive semi-structured, time series and graph datasets.&lt;/li&gt;&lt;li&gt;Mentor peers, maintain documentation, share knowledge and help build a great team.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;p&gt;Required Skills&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Excellent problem solving skills with a strong foundation in Statistics, Computer Science including core data structures, algorithms.&lt;/li&gt;&lt;li&gt;Be able to develop hypothesis and test with experimentation.&lt;/li&gt;&lt;li&gt;Experience with building real time and batch processing components.&lt;/li&gt;&lt;li&gt;Experience with development in SQL, python.&lt;/li&gt;&lt;li&gt;Proven ability to work as an independent member of a distributed team.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;p&gt;Desired Skills&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Familiarity with advertising industry and real time bidding systems.&lt;/li&gt;&lt;li&gt;Familiarity with geo spatial data processing.&lt;/li&gt;&lt;li&gt;Experience in building systems with time travel, simulation capabilities.&lt;/li&gt;&lt;li&gt;Experience with development and deployment in Java, Scala.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;Qualifications: &lt;/p&gt;&lt;ul&gt;&lt;li&gt;At least 2 years of hands-on experience as an Individual contributor responsible for developing and supporting software. Degree in quantitative science or PhD preferred.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;/p&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-23T23:29:25.000Z"
    },
    "company": {
        "name": "VDX.tv",
        "link": "https://www.linkedin.com/company/vdx-tv"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Emeryville",
        "region": "CA",
        "postal_code": "94608",
        "street_address": null,
        "latitude": 37.8312,
        "longitude": -122.28581
    }
}