{
    "job": {
        "title": "Data Scientist- Tiktok Ads",
        "industry": "Internet",
        "description": "&lt;p&gt;TikTok is the leading destination for short-form mobile video. Our mission is to inspire creativity and bring joy. TikTok has global offices including Los Angeles, New York, London, Paris, Berlin, Dubai, Mumbai, Singapore, Jakarta, Seoul and Tokyo. &lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;About The Tiktok Monetization Product Data Science Team&lt;/p&gt;&lt;p&gt;We're the TikTok Monetization Products data science team, who enables and champions data driven decision making. Our Vision is to become the world class data science team, where data is used rigorously to drive all decision making. Our Mission is to drive monetization and sustainable revenue growth for TikTok through data science.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Responsibilities&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;- Apply your expertise in quantitative analysis, data mining, and the presentation of data to see beyond the numbers and understand how our users interact with our ads products&lt;/p&gt;&lt;p&gt;- Partner with Product and Engineering teams to solve problems and identify trends and opportunities&lt;/p&gt;&lt;p&gt;- Inform, influence, support, and execute our product decisions&lt;/p&gt;&lt;p&gt;- Build/maintain reports, dashboards, and metrics to monitor the performance of our products&lt;/p&gt;&lt;p&gt;- Mine massive amounts of data and extract useful product insights&lt;/p&gt;&lt;p&gt;- Manage development of data resources, gather requirements, organize sources, and support product launches&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Qualifications&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;- 5+ years experience doing quantitative analysis&lt;/p&gt;&lt;p&gt;- BA/BS in Math, Statistics, Economics, Computer Science, or other quantitative field. Advanced degrees preferred but not required&lt;/p&gt;&lt;p&gt;- Fluency in SQL or other programming languages. Some development experience in at least one scripting language (PHP, Python, Perl, etc.)&lt;/p&gt;&lt;p&gt;- Experience with large data sets and distributed computing (Hive/Hadoop) a plus&lt;/p&gt;&lt;p&gt;- Ability to initiate and drive projects to completion with minimal guidance&lt;/p&gt;&lt;p&gt;- The ability to communicate the results of analyses in a clear and effective manner&lt;/p&gt;&lt;p&gt;- Basic understanding of statistical analysis&lt;/p&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-29T18:12:35.000Z"
    },
    "company": {
        "name": "TikTok",
        "link": "https://www.linkedin.com/company/tiktok"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Mountain View",
        "region": "CA",
        "postal_code": "94040",
        "street_address": null,
        "latitude": 37.39008,
        "longitude": -122.08139
    }
}