{
    "job": {
        "title": "Software Engineer I",
        "industry": "Electrical/Electronic Manufacturing,Logistics and Supply Chain,Machinery",
        "description": "&lt;strong&gt;&lt;u&gt;Requirements&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;Some experience in Python/Script programming and Robots. The tasking involves setting up and programming a Universal Robotic (UR) arm and gripper to pick up grocery items and move them across the plane of a scanner as performed by a human checker. &lt;/li&gt;&lt;li&gt;The UR robot and table are large so this tasking would be in the Holtsville Facility. For safety and security reasons, this tasking can't be fully performed remotely and the candidate would need to be in office approx 4 days a week and some weeks more than others. &lt;/li&gt;&lt;li&gt;The sample set of test items is large. Some training is involved, but the candidate must have some experience with robots and robotic control so the training is limited. &lt;/li&gt;&lt;li&gt;Develops and implements software systems or applications through the use of software best practices such as Specification, Design, Coding, Testing, Documentation, and Maintenance. &lt;/li&gt;&lt;li&gt;Knowledge of Development Environments, Configuration Management Tools, and Operating systems is expected. Bachelor's degree in an appropriate engineering discipline required. Minimum of 0-2 years of engineering experience.&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;Develops and implements software systems or applications through the use of software best practices such as Specification, Design, Coding, Testing, Documentation, and Maintenance. Knowledge of Development Environments, Configuration Management Tools, and Operating systems is expected. Bachelor's degree in an appropriate engineering discipline required. Minimum of 0-2 years of engineering experience.",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-17T23:18:37.000Z"
    },
    "company": {
        "name": "Zebra Technologies",
        "link": "https://www.linkedin.com/company/zebra-technologies"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Holtsville",
        "region": "NY",
        "postal_code": "11742",
        "street_address": null,
        "latitude": 40.8155,
        "longitude": -73.044846
    }
}