{
    "job": {
        "title": "Staff Software Engineer (Java/Cloud)",
        "industry": "Retail",
        "description": "&lt;p&gt;&lt;strong&gt;About the Role&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;As a team member of the Plan, Book and Allocate organization, we’re looking for a Software Engineer who will actively participate in requirement gathering and technical design discussions. This role will design highly scalable and high performing technology solutions in an Agile work environment and produce and deliver code and/or test cases using Agile practices. This individual will work closely with business support teams and product managers to assist in resolving critical production issues help simplify and improve business processes through the latest in technology and automation.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;This individual will need to stay current on the latest in technology and methodology in the market and be able to perform proof of concepts to better understand how they fit into the Gap landscape and to apply usefulness and effectiveness to the organization upon adoption. The role is&amp;nbsp;responsible for technical and architecture implementation against the agreed scope and quality of the end product delivered. The key business partners that will works closely with this team member are the Product Architect, Technical Lead, Technical Manager, Product manager and Scrum Master in order to balance product architecture and to meet delivery timeline.&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Deployment of applications, infrastructure, upgrades, and changes to platform capacity.&lt;/li&gt;&lt;li&gt;Maximize system uptime and availability and ensuring functional and performance SLAs Responsible for establishing end-to-end monitoring and alerting for various systems.&lt;/li&gt;&lt;li&gt;Migrate the existing REST services from on-prem to Azure Cloud infrastructure&lt;/li&gt;&lt;li&gt;Creating services using Springboot Micro services and automating deployment using Jenkins, Groovy (Deployment).&lt;/li&gt;&lt;li&gt;Creating ETL/Ingestion jobs using Apache Spark and monitor/maintain the jobs on Cloud (Azure)d&lt;/li&gt;&lt;li&gt;Identify and surface performance and optimization opportunities and implement caching to improve the performance of derived views and using different joint methodologies like hash, nested, and merge.&lt;/li&gt;&lt;li&gt;Schedule jobs using Scheduler and importing and exporting views to different databases and pre-prod environments and document the best practices and be actively involved in design discussions.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;strong&gt;Who you are&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Bachelor's degree in computer science or equivalent experience and&amp;nbsp;5+ years of software development experience&lt;/li&gt;&lt;li&gt;Robust understanding of Java. Object-oriented design experience, Micro Services and experience applying design patterns&lt;/li&gt;&lt;li&gt;Working experience in Spring Framework, hands-on NoSQL experience, HBase strongly preferred&lt;/li&gt;&lt;li&gt;Strong knowledge of Hadoop and associated technologies such as MapReduce and Spark&lt;/li&gt;&lt;li&gt;Hands-on experience in the DevOps model, production support and Agile methodologies as well understanding the concepts Test Driven Development and Business Driven Development&lt;/li&gt;&lt;li&gt;Experience in using containerization technologies and cloud, Azure and Pivotal Cloud Foundry preferred&lt;/li&gt;&lt;li&gt;Familiarity with Messaging Technology such as RabbitMQ, experience in using CI/CD tools such as Jenkins and NodeJS Familiarity&lt;/li&gt;&lt;li&gt;Possess strong analytical and problem-solving skills&amp;nbsp;and proven ability to think objectively and interpret meaningful themes from quantitative and qualitative data&lt;/li&gt;&lt;/ul&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T23:35:51.000Z"
    },
    "company": {
        "name": "Gap Inc.",
        "link": "https://www.linkedin.com/company/gap-inc-"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "North Carolina",
        "region": "United States",
        "postal_code": "27208",
        "street_address": null,
        "latitude": 35.539375,
        "longitude": -79.18543
    }
}