{
    "job": {
        "title": "Accounts Payable Specialist",
        "industry": "Airlines/Aviation",
        "description": "&lt;p&gt;Our philosophy is to build a culture where problem-solving, teamwork, and leadership results in the ongoing improvement of our organization. This includes fostering on the needs and commitment to hire, train, promote, and retain the best employees in the business. Our fast-paced environment allows creativity while providing a positive challenge that promotes growth and development.&lt;br&gt;&lt;br&gt;&lt;/p&gt;The Temporary Accounts Payable Specialist is responsible for managing vendor and customer service relationships and the processing of Accounts Payable transactions. This role will work as part of a shared services function, with global counterparts and responsibilities. An ideal candidate will contribute to establishment and maintenance of internal controls to ensure accurate, complete, efficient and timely recording of financial transactions.&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;strong&gt;RESPONSIBILITIES:&lt;/strong&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;Own the entire lifecycle of Accounts Payable transactions, which includes timely and accurate processing of vendor invoices and payments in accordance with contract terms and company policies and guidelines.&lt;/li&gt;&lt;li&gt;Manage external vendor and internal customer relations, including the new vendor on boarding process and timely responses to expense or payment inquiries.&lt;/li&gt;&lt;li&gt;Perform reconciliations of vendor statements to the AP sub-ledger for accuracy and work with vendors to resolve any payment discrepancies.&lt;/li&gt;&lt;li&gt;Responsible for proper general ledger coding of purchases, follow up with internal department managers on any discrepancies, perform month-end close processes, including the preparation of AP related accruals.&lt;/li&gt;&lt;li&gt;Participate in annual 1099 reporting and audits.&lt;/li&gt;&lt;li&gt;Assists with special projects as needed.&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;span&gt;&lt;strong&gt;QUALIFICATIONS &amp;amp; EXPERIENCE&lt;br&gt;&lt;br&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Bachelor's degree in Accounting, Finance, or related field preferred.&lt;/li&gt;&lt;li&gt;1-2 years of Accounts Payable experience, in a high-volume environment.&lt;/li&gt;&lt;li&gt;Self-starter with strong attention to details, well organized, with excellent skills in time management and ability to multi-task.&lt;/li&gt;&lt;li&gt;A critical thinker who can adapt to a changing environment and provide process improvements and efficiencies.&lt;/li&gt;&lt;li&gt;Excellent verbal and written communication, interpersonal, conflict resolution, presentation and customer service skills.&lt;/li&gt;&lt;li&gt;Strong work ethic, dependable, reliable, team player, and willingness to learn.&lt;/li&gt;&lt;li&gt;Proficient in Microsoft Office applications (Excel, Power Point and Word).&lt;/li&gt;&lt;li&gt;Experience with SAP or related large ERP systems a plus.&lt;/li&gt;&lt;li&gt;Understanding of the generally accepted accounting principles and procedures.&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;strong&gt;POSITION&lt;/strong&gt;:&lt;br&gt;&lt;br&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Department: Finance &lt;/li&gt;&lt;li&gt;Location: Fort Lauderdale, FL&lt;/li&gt;&lt;li&gt;Reports to: Global Accounts Payable Manager&lt;/li&gt;&lt;li&gt;FLSA Classification: Non-Exempt &lt;/li&gt;&lt;/ul&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:24:55.000Z"
    },
    "company": {
        "name": "XOJET Aviation",
        "link": "https://www.linkedin.com/company/xojet-aviation"
    },
    "education": {
        "required_credential": "high school"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Fort Lauderdale",
        "region": "FL",
        "postal_code": "33309",
        "street_address": null,
        "latitude": 26.188251,
        "longitude": -80.1712
    }
}