{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "Computer Software",
        "description": "&lt;p&gt;&lt;strong&gt;High-level…&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;The Site Reliability Engineer (SRE) is responsible for the availability, performance, monitoring, release engineering, and incident response, among other things, of the platforms and services the company runs and owns. SRE ensures that enterprise services have reliability and uptime appropriate to defined service levels.&amp;nbsp;SRE’s are focused on optimizing existing systems, building cloud infrastructure, and eliminating manual work through automation.&amp;nbsp;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Down in the weeds…&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Analyzing and troubleshooting large-scale distributed systems in the public cloud&lt;/li&gt;&lt;li&gt;Scale systems sustainably through mechanisms like automation and evolve systems by pushing for changes that improve reliability and velocity&lt;/li&gt;&lt;li&gt;Improve and maintain monitoring and logging solutions that measure availability, latency and overall system health of production systems&lt;/li&gt;&lt;li&gt;Provision and manage cloud Infrastructure through automation and infrastructure as code&lt;/li&gt;&lt;li&gt;Restore healthy operation of applications and services through sustainable incident response and blameless postmortems&lt;/li&gt;&lt;li&gt;Follow and monitor security and compliance best practices&lt;/li&gt;&lt;li&gt;Configuration of continuous integration pipeline and release automation&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;About you…&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Adept in one or more of the following: TypeScript, .NET (C# or Core), Python&lt;/li&gt;&lt;li&gt;Experience in Domain-Driven Design and application design patterns&lt;/li&gt;&lt;li&gt;Configuration Management and Infrastructure as Code (e.g CloudFormation)&lt;/li&gt;&lt;li&gt;Building and deploying infrastructure in public cloud platforms (AWS)&lt;/li&gt;&lt;li&gt;Experience with configuration and management of CI/CD pipeline (Jenkins)&lt;/li&gt;&lt;li&gt;Understanding of network and security principles and best practices (CIS, OWASP)&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Education and Experience...&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Bachelor's degree from a four-year college or university, or three to four years related experience and/or training; or equivalent combination of education and experience.&lt;/li&gt;&lt;li&gt;3+ years of software engineering and/or IT operations and infrastructure experience preferred&lt;/li&gt;&lt;/ul&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-10T21:18:35.000Z"
    },
    "company": {
        "name": "Tillster, Inc.",
        "link": "https://www.linkedin.com/company/tillster"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}