{
    "job": {
        "title": "Data Scientist",
        "industry": "Internet",
        "description": "&lt;p&gt;Need Someone who can independently with any employer or without any sponsorship.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;The main function of the Data Scientist is to produce innovative solutions driven by exploratory data analysis from complex and high-dimensional datasets.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;Working on commerce products including Marketplace and shops.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;Job Responsibilities:&lt;/p&gt;&lt;p&gt;• Apply knowledge of statistics, machine learning, programming, data modeling, simulation, and advanced mathematics to recognize patterns, identify opportunities, pose business questions, and make valuable discoveries leading to prototype development and product improvement.&lt;/p&gt;&lt;p&gt;• Use a flexible, analytical approach to design, develop, and evaluate predictive models and advanced algorithms that lead to optimal value extraction from the data.&lt;/p&gt;&lt;p&gt;• Generate and test hypotheses and analyze and interpret the results of product experiments.&lt;/p&gt;&lt;p&gt;• Work with product engineers to translate prototypes into new products, services, and features and provide guidelines for large-scale implementation.&lt;/p&gt;&lt;p&gt;• Provide Business Intelligence (BI) and data visualization support, which includes, but limited to support for the online customer service dashboards and other ad-hoc requests requiring data analysis and visual support.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;Skills:&lt;/p&gt;&lt;p&gt;• Experienced in either programming languages such as Python and/or R, big data tools such as Hadoop, or data visualization tools such as Tableau.&lt;/p&gt;&lt;p&gt;• The ability to communicate effectively in writing, including conveying complex information and promoting in-depth engagement on course topics.&lt;/p&gt;&lt;p&gt;• Experience working with large datasets.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;Education/Experience:&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Master of Science degree in computer science or in a relevant field.&lt;/li&gt;&lt;/ul&gt;",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-20T16:27:57.000Z"
    },
    "company": {
        "name": "Mindlance",
        "link": "https://www.linkedin.com/company/mindlance"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Seattle",
        "region": "WA",
        "postal_code": "98133",
        "street_address": null,
        "latitude": 47.60323,
        "longitude": -122.33028
    }
}