{
    "job": {
        "title": "SME - Software Developer, Applications",
        "industry": "Construction,Information Technology and Services,Computer Software",
        "description": "&lt;strong&gt;&lt;u&gt;Job Description&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;Bachelor Degree or four additional years of experience in lieu of a degree&lt;br&gt;&lt;br&gt;Software development and coding experience developing web based database backend mobile applications&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;Required Education, Experience, &amp;amp; Skills&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;At least 2 years experience leading a team of developers&lt;br&gt;&lt;br&gt;Bachelor Degree or four additional years of experience in lieu of a degree&lt;br&gt;&lt;br&gt;Software development and coding experience&lt;br&gt;&lt;br&gt;IoT development experience&lt;br&gt;&lt;br&gt;Project management experience&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;Preferred Education, Experience, &amp;amp; Skills&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;Experience with project management tools such as JIRA and MS Project&lt;br&gt;&lt;br&gt;PMP&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;About BAE Systems Intelligence &amp;amp; Security&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;BAE Systems, Inc. is the U.S. subsidiary of BAE Systems plc, an international defense, aerospace and security company which delivers a full range of products and services for air, land and naval forces, as well as advanced electronics, security, information technology solutions and customer support services. Improving the future and protecting lives is an ambitious mission, but it's what we do at BAE Systems. Working here means using your passion and ingenuity where it counts – defending national security with breakthrough technology, superior products, and intelligence solutions. As you develop the latest technology and defend national security, you will continually hone your skills on a team—making a big impact on a global scale. At BAE Systems, you'll find a rewarding career that truly makes a difference.&lt;br&gt;&lt;br&gt;Intelligence &amp;amp; Security (I&amp;amp;S), based in McLean, Virginia, designs and delivers advanced defense, intelligence, and security solutions that support the important missions of our customers. Our pride and dedication shows in everything we do—from intelligence analysis, cyber operations and IT expertise to systems development, systems integration, and operations and maintenance services. Knowing that our work enables the U.S. military and government to recognize, manage and defeat threats inspires us to push ourselves and our technologies to new levels.&lt;br&gt;&lt;br&gt;At BAE Systems, we celebrate the array of skills, experiences, and perspectives our employees bring to the table. For us, differences are a source of strength. We're laser-focused on high performance, and we work hard every day to nurture an inclusive culture where all employees can innovate and thrive. Here, you will not only build your career, but you will also enjoy work-life balance, uncover new experiences, and collaborate with passionate colleagues.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-21T01:56:25.000Z"
    },
    "company": {
        "name": "BAE Systems",
        "link": "https://uk.linkedin.com/company/bae-systems"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Arlington",
        "region": "VA",
        "postal_code": "22210",
        "street_address": null,
        "latitude": 38.890762,
        "longitude": -77.084755
    }
}