{
    "job": {
        "title": "Machine Learning Engineer ",
        "industry": "Staffing and Recruiting",
        "description": "&lt;p&gt;&lt;strong&gt;Machine Learning Engineer &lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;&lt;p&gt;We are a Boston-based MIT spinout that are pioneering within AI Acceleration, photonics, Machine Learning, and optics space. We are looking for a Machine Learning Engineer (Python, Mandarin, Deep Learning)&amp;nbsp;to come and help solidify the hardware vision of what we are building.&lt;/p&gt;&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;As a Machine Learning Engineer, you must fluent in Mandarin, you should ideally have a background or knowledge of digital microarchitecture design, logic, simulation, AI acceleration, or general experience in the semiconductor industry. The ideal candidate will also have strong engineering skills with C++ or Python experience. The mandarin component is a necessity as you will be interfacing with their team that is in China.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;We are in a period of rapid growth. This is an opportunity for an ML Engineer to join us at a relatively early stage and apply your skills in a brand-new area of technology that has never been attempted before. If you have experience You will be working on lower-level implementation of deep learning kernels, graph compilers, or training systems this may be the opportunity for you!&lt;/p&gt;&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;What we can offer:&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;An opportunity to work with our collaborative research team on novel work that will revolutionize modern-day computing as we know it.&lt;/li&gt;&lt;li&gt;A culture of openness and collaboration – we are all working together under a shared vision.&lt;/li&gt;&lt;li&gt;A great location in downtown Boston&lt;/li&gt;&lt;li&gt;Excellent benefits.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;em&gt;Key skills include: Machine Learning, Machine Learning Engineer, Software Engineer, Programmer, Programming, Engineering, Python, C++, Mandarin, Deep Learning, Deep Learning Kernels, Training Systems, Machine Learning Models, Algorithm Development, Artificial Intelligence&lt;/em&gt;&lt;/p&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-10T10:18:47.000Z"
    },
    "company": {
        "name": "Understanding Recruitment",
        "link": "https://uk.linkedin.com/company/understanding-recruitment"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Boston",
        "region": "MA",
        "postal_code": "02118",
        "street_address": null,
        "latitude": 42.358994,
        "longitude": -71.05863
    }
}