{
    "job": {
        "title": "Software Engineer",
        "industry": "Computer Networking",
        "description": "&lt;p&gt;Arista Networks is looking for world-class software engineers at multiple levels to join our team to build product features related to SDN, Routing Protocols, Network Management, Packet Forwarding Engines, Linux kernel, and Network OS infrastructure. You will be part of a fast-paced, high caliber team building the software for the routing and switching products used to build the industry&amp;apos;s largest data center networks. At Arista, you will own your projects from definition to deployment, and you will be responsible for the quality of everything you deliver. You will also have the opportunity to work on multiple projects and areas based on business needs and personal interests.&lt;br&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;This role demands a strong and broad software engineering background. Your role will not be limited to any single aspect of software development at Arista but will cover all aspects of software development spanning the addition of new features, debugging problems, and fine-tuning code for scalability and performance.&lt;br&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Responsibilities:&lt;br&gt;&lt;br&gt;&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Architect, design and develop features and solutions. Develop tests for all code to ensure quality. Fix bugs and refactor code as needed.&lt;/li&gt;&lt;li&gt;Review and contribute to the specifications and implementations written by other team members.&lt;/li&gt;&lt;li&gt;Provide technical leadership across features, projects and tools.&lt;/li&gt;&lt;li&gt;Work with Customer Support Engineers to analyze problems in customer networks and provide fixes. for those problems when needed in the form of new software releases or software patches.&lt;/li&gt;&lt;li&gt;Work with the System &lt;em&gt;Test&lt;/em&gt; Engineers to analyze problems found in their tests and provide fixes for those problems.&lt;/li&gt;&lt;li&gt;Mentor new and junior engineers to bring them up to speed in Arista&amp;apos;s software development environment.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt; &lt;br&gt;&lt;br&gt;&lt;br&gt;&lt;br&gt;&lt;/p&gt;&lt;strong&gt;Qualifications&lt;br&gt;&lt;br&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;At least BS Computer Science + 3 years&amp;apos; experience, or MS Computer Science + 2 years’ experience, Ph.D. in Computer Science or equivalent work experience.&lt;/li&gt;&lt;li&gt;Knowledge of one or more of &lt;em&gt;C++&lt;/em&gt;, &lt;em&gt;Python&lt;/em&gt;, Go, C.&lt;/li&gt;&lt;li&gt;Knowledge of UNIX or Linux.&lt;/li&gt;&lt;li&gt;Understanding of IP networking and/or distributed &lt;em&gt;systems&lt;/em&gt;.&lt;/li&gt;&lt;li&gt;Hands on experience in the design and development of Ethernet bridging or routing related software or distributed &lt;em&gt;systems&lt;/em&gt; software.&lt;/li&gt;&lt;li&gt;Applied understanding of software engineering principles.&lt;/li&gt;&lt;li&gt;Strong problem solving and software troubleshooting skills.&lt;/li&gt;&lt;li&gt;Ability to design a solution and implement features independently. Ability to work on small teams solving problems by building features and driving the project with limited oversight..&lt;br&gt;&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;Additional Information&lt;br&gt;&lt;br&gt;&lt;/strong&gt;&lt;p&gt;All your information will be kept confidential according to EEO guidelines.&lt;br&gt;&lt;br&gt;&lt;/p&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-19T15:27:50.000Z"
    },
    "company": {
        "name": "Arista Networks",
        "link": "https://www.linkedin.com/company/arista-networks-inc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Nashua",
        "region": "NH",
        "postal_code": "03064",
        "street_address": null,
        "latitude": 42.75787,
        "longitude": -71.46395
    }
}