{
    "job": {
        "title": "Sr Data Engineer (10+yrs)",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Dice is the leading career destination for tech experts at every stage of their careers. Our client, Takeo, is seeking the following. Apply via Dice today!&lt;br&gt;&lt;br&gt;Takeo tech LLC is a leading next-generation IT products, platforms, and services company delivering guaranteed business outcomes, seamless customer experience, actionable insights and IP-led digital transformation. We bring unparalleled knowledge of domains, markets, and technology platforms, to enable our clients realize their business goals. Senior Data Engineer NYC (Remote till covid) 1+yr Requirement Firm foundation in software development principles and practices 7+ yearsrsquo experience in a data engineeringETLdata warehousing etc Proficiency in SQL a must 10+ yearsrsquo experience in data programing languages such as Python, Java etc 4+ yearsrsquo experience working in a Big Data ecosystem processing data includes file systems, data structuresdatabases, automation, security, messaging, movement, etc. 3+ yearsrsquo experience working in a production cloud infrastructure Prior backgrounds with AWS services (e.g. lambda, S3, Aurora, Redshift) Exposure to CICDCT for software systems Excellent interpersonal skills with proven ability to influence with impact across functions and disciplines. Ability to work independently and as part of a team Regards Praveen Sr Executive Talent Acquisition",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-18T22:00:44.000Z"
    },
    "company": {
        "name": "Dice",
        "link": "https://www.linkedin.com/company/dice"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}