{
    "job": {
        "title": "Property Marketing Coordinator",
        "industry": "Information Technology and Services,Financial Services,Real Estate",
        "description": "RESPONSIBILITIES &lt;br&gt;&lt;br&gt;Responsible for preparing marketing materials, information packages, as well as other administrative duties. Acts as a liaison between clients and other teams. &lt;br&gt;&lt;br&gt;ESSENTIAL DUTIES AND RESPONSIBILITIES &lt;br&gt;&lt;br&gt;Maintains CBRE brand, product, and client messaging and consistency by applying templates to produce marketing materials including flyers, proposals, and marketing packages for multifamily properties. Errors in judgment may cause short to medium-term impact to co-workers, supervisor, department and line of business. &lt;br&gt;&lt;br&gt;Coordinates property tours with local management companies and potential investors. &lt;br&gt;&lt;br&gt;Performs market research, writes content, and edits property photos used in marketing packages. &lt;br&gt;&lt;br&gt;Responsible for creating campaign email releases, as well as custom packages and templates for unique deals and portfolios while being responsible for delivery of collateral to specialists. &lt;br&gt;&lt;br&gt;Updates and maintains various information databases, and generates standard and ad hoc reports as required. &lt;br&gt;&lt;br&gt;Organizes the preparation and production of customized, client specific property information packages in response to Requests for Information (RFIs) and Requests for Proposals (RFPs). &lt;br&gt;&lt;br&gt;Abstracts purchasing letters of intent to create offer summaries for campaigns. &lt;br&gt;&lt;br&gt;Handles small portion of pipeline by communicating with external teams and clients during the valuation process. &lt;br&gt;&lt;br&gt;Other duties may be assigned. &lt;br&gt;&lt;br&gt;SUPERVISORY RESPONSIBILITIES &lt;br&gt;&lt;br&gt;No formal supervisory responsibilities in this position.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:24:26.000Z"
    },
    "company": {
        "name": "CBRE",
        "link": "https://www.linkedin.com/company/cbre"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Seattle",
        "region": "WA",
        "postal_code": "98133",
        "street_address": null,
        "latitude": 47.60323,
        "longitude": -122.33028
    }
}