{
    "job": {
        "title": "Site Reliability Engineer, Ad Platforms",
        "industry": "Consumer Electronics",
        "description": "&lt;br&gt;&lt;strong&gt;Summary&lt;br&gt;&lt;/strong&gt; &lt;br&gt;At Apple, we work every day to create products that enrich people’s lives. Our Advertising Platforms group makes it possible for people around the world to easily access informative and imaginative content on their devices while helping publishers and developers promote and monetize their work. Today, our technology and services power advertising in Search Ads in the App Store and Apple News. Our platforms are highly-performant, deployed at scale, and setting new standards for enabling effective advertising while protecting user privacy. &lt;br&gt;&lt;br&gt;&lt;br&gt;The Ad Platforms team is seeking a Site Reliability Engineer for an extraordinary opportunity. Our mission is to enable Ad Platforms to deliver advertisements in a reliable and scalable way that results in awesome user experiences. We achieve this mission by automation, processes and education to our partner teams.&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Key Qualifications&lt;br&gt;&lt;/strong&gt; &lt;br&gt;At least 3-5 years in a Reliability Engineering, DevOps or Infrastructure focused role.&lt;br&gt;&lt;br&gt;Passion for designing and building reliable systems.&lt;br&gt;&lt;br&gt;Advanced experience with programming languages (GoLang, Python, Java, C++).&lt;br&gt;&lt;br&gt;Experience designing, building and operating solutions built on top of AWS.&lt;br&gt;&lt;br&gt;Experience building and operating container based platforms like EKS.&lt;br&gt;&lt;br&gt;Experience in deployment automation based on Terraform.&lt;br&gt;&lt;br&gt;Automation advocate - you truly believe in removing operation load with software.&lt;br&gt;&lt;br&gt;Experience with deploying, supporting and monitoring new and existing services, platforms, and application stacks.&lt;br&gt;&lt;br&gt;Confirmed experience supporting internet-facing production services and distributed systems.&lt;br&gt;&lt;br&gt;Demonstrated problem solving ability utilizing creative and innovating thinking but also adhering to a strong sense of ownership, customer service, and integrity demonstrated through clear communication.&lt;br&gt;&lt;br&gt;Drive to be be self-motivated, and eager to learn.&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Description&lt;br&gt;&lt;/strong&gt; &lt;br&gt;We are a diverse, global, agile engineering team that moves smart and fast by consuming and optimizing readily-available technology, collaborating to improve and scale capabilities across businesses and use cases, and sharing our own innovative solutions so everyone can benefit. We are not constrained by organization structure and offer flexibility to work on a variety of full-stack and backend systems and we have fun doing it!&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Education &amp;amp; Experience&lt;br&gt;&lt;/strong&gt; &lt;br&gt;Bachelor’s degree in Computer Science or equivalent industry experience&lt;br&gt;&lt;br&gt; &lt;br&gt;Role Number: 200292432&lt;br&gt;&lt;br&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-17T05:26:15.000Z"
    },
    "company": {
        "name": "Apple",
        "link": "https://www.linkedin.com/company/apple"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Austin",
        "region": "TX",
        "postal_code": "78746",
        "street_address": null,
        "latitude": 30.264978,
        "longitude": -97.7466
    }
}