{
    "job": {
        "title": "Entry Level Software Engineer",
        "industry": "Food &amp; Beverages,Food Production,Consumer Goods",
        "description": "&lt;strong&gt;&lt;u&gt;About The AppHarvest Technology Group&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;The AppHarvest Technology Group is redefining agriculture by developing a new class of advanced farming facilities that will be deployed at scale. By combining the latest innovations in agriculture with our proprietary technology, we will make sustainably grown, chemical free food the global standard.&lt;br&gt;&lt;br&gt;Our flagship facility is located in Morehead KY. This 60-acre indoor growing environment produces 30x more produce per-acre, uses 90% less water and its location near major urban centers has allowed us to reduce diesel use in transportation by 80%. But this is just the beginning and as a member of the Appharvest Technology Group you will be at the forefront of driving the innovations that will transform the worlds food supply.&lt;br&gt;&lt;br&gt;AppHarvest is proud to verify our commitment to people and the planet by being a Certified B Corporation. As one of only four public B Corps in the United States, we are focused on balancing people and profit. Our goal is to promote a future of sustainable change in the agriculture industry while reducing our impact on the planet. And we're doing it all while creating jobs and helping Appalachia build a more resilient economy!&lt;br&gt;&lt;br&gt;This is Farming Now.&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;About The Role&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;As an Entry Level Software Engineer at AppHarvest, you will join a team at the forefront of sustainable agriculture by helping architect and build new, innovative solutions to expand our product capabilities. You will work closely with our Technology team, Greenhouse Operations, vendors, and customers to build and optimize products as well as advise on opportunities to work with external partners to grow the value of our technology echo system. &lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;What You'll Do&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;Work in a collaborative team building our next gen platform architecture &lt;/li&gt;&lt;li&gt;Hands-on contributions in designing, building, reviewing, testing, debugging, configuring, integrating, monitoring, documenting, and maintaining - high performance, flexible, and highly scalable microservices and integration pipelines that make up our platform &lt;/li&gt;&lt;li&gt;Review code to ensure that technical implementation meets functional requirements &lt;/li&gt;&lt;li&gt;Collaborate with all the AppHarvest Technology teams to ensure systems are performant, scalable, resilient, and available &lt;/li&gt;&lt;li&gt;Promote best practices for development, deployment, and quality life cycles &lt;/li&gt;&lt;li&gt;Guide the growth &amp;amp; development of engineers with mentoring and training &lt;br&gt;&lt;/li&gt;&lt;/ul&gt;Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. AppHarvest reserves the right to change duties, responsibilities and activities at any time with or without notice.&lt;br&gt;&lt;br&gt;&lt;strong&gt;What We’re Looking For:&lt;/strong&gt; &lt;br&gt;&lt;ul&gt;&lt;li&gt;Strong passion for AppHarvest’s core values and mission to disrupt the global food industry &lt;/li&gt;&lt;li&gt;Bachelor’s degree in Engineering, Computer Science, or Technology; MBA or master's preferred &lt;/li&gt;&lt;li&gt;1+ years of software engineering experience preferably in the cloud, with a proven track record of leading large-scale projects &lt;/li&gt;&lt;li&gt;Experience building web services, distributed systems, and service-oriented architecture &lt;/li&gt;&lt;li&gt;Object-oriented design &amp;amp; programming experience in languages such as Java, C++, or C# &lt;/li&gt;&lt;li&gt;Experience with the full software development lifecycle for a large-scale software product &lt;/li&gt;&lt;li&gt;Passion to solve complex problems and to build great software &lt;/li&gt;&lt;li&gt;Experience of integrating with third party products and applications &lt;/li&gt;&lt;li&gt;A “figure it out” mentality and challenge any notion that “this can’t be done” &lt;/li&gt;&lt;li&gt;Clear, concise, and thorough written and oral communication skills &lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;&lt;u&gt;Benefits&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;100% company paid insurance premiums (Medical, Dental and Vision Plans) &lt;/li&gt;&lt;li&gt;401K Company Match 100% of First 3%- 50% of next 2% and is vested immediately – it is automatically yours &lt;/li&gt;&lt;li&gt;10 company paid holidays &lt;/li&gt;&lt;li&gt;Generous PTO Packages starting at 15 PTO days&lt;/li&gt;&lt;li&gt;2 Paid Mission Days for volunteer work &lt;/li&gt;&lt;li&gt;Company provided uniforms and shoes (for Greenhouse Employees)&lt;/li&gt;&lt;/ul&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-03T00:00:00.000Z"
    },
    "company": {
        "name": "AppHarvest",
        "link": "https://www.linkedin.com/company/appharvest"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Seattle",
        "region": "WA",
        "postal_code": "98133",
        "street_address": null,
        "latitude": 47.60323,
        "longitude": -122.33028
    }
}