{
    "job": {
        "title": "Sr. Software Engineer",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Dice is the leading career destination for tech experts at every stage of their careers. Our client, Savvyan Technologies, is seeking the following. Apply via Dice today!&lt;br&gt;&lt;br&gt;Sr. Software Engineer Santa Clara, CA Client Silicon Valley Bank (SVB) Overall 15+ years of experience in IT services. Extensively knowledge on Commercial Banking domain Managing of end to end complex and large programs Should have handled large onshore and offshore teams In-depth technical knowledge and should design systems should able interpret complex designs Provide technical guidance to team Excellent communication skills both with internal and customer Pro-active risk and mitigation management Strong analytical and problem solving skills Excellent technical knowledge and banking domain knowledge. Experinece in determining and overseeing consistent developemnt, testing, evaluation, and troubleshooting of all products in all stages of completion. Experinece in Tracking milestones, deliverables, and change requests. Experience with JIRA, Confluence and SVN. Experience in Java, Spring framework , multithreading, collections, jdbc, Hibernate etc. Experience in deploying web servers Apache Tomcat, Weblogic 12c and Openshift,database servers and configure them. Experience in sybase, SQL and Oracle 19. Shall be able to create,optimize and Manage structure and building blocks of a database Capable to perform Root cause analysis from Log and debug. (L2 and L3 support) Hands on on below Struts 1.x,Struts 2,JAX -WS,JAX-RS,EJB MDB,JMS,ANT",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-18T22:06:54.000Z"
    },
    "company": {
        "name": "Dice",
        "link": "https://www.linkedin.com/company/dice"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 180,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Santa Clara",
        "region": "CA",
        "postal_code": "95050",
        "street_address": null,
        "latitude": 37.352394,
        "longitude": -121.95308
    }
}