{
    "job": {
        "title": "REMOTE Senior Machine Learning Engineer - ML, AI, Data Science",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Dice is the leading career destination for tech experts at every stage of their careers. Our client, Technology Navigators, is seeking the following. Apply via Dice today!&lt;br&gt;&lt;br&gt;No sponsorship available. No third-partyC2C candidates. This is a 100 REMOTE opportunity. Applicants must reside in the United States. Our client, a major player in the cutting-edge artificial intelligence industry, brings other companiesrsquo AI strategies up to speed. Engineering creative custom solutions with innovative approaches, this company has delivered a clear competitive advantage to both startups and enterprise environments alike. This client has an immediate need for an experienced Senior Machine Learning Engineer to join their technical team. What you get to do Design and develop bleeding edge machine learning models Take ownership of machine learning testing initiatives Carry out machine learning experiments in an innovative, fast-paced environment What you need to succeed Bachelorrsquos or Masterrsquos degree in Computer Science or closely related field of study 4+ years of experience as a Machine Learning (ML) Engineer working in fast-paced environment(s) Hands-on programming experience with Java, Python, andor C++ Proven ability to multi-task on several projects concurrently Strong communication and collaboration skills Whatrsquos in it for you This company sure does know how to spoil their valued employees! With awesome perks and benefits like a substantial transportation allowance and an open PTO policy, they remind employees theyrsquore not just another number here ndash their time and skill sets are both recognized and rewarded. Aside from a great worklife balance, yoursquoll also enjoy 100 company-paid medical insurance coverage, a generous compensation package that includes bonuses and stock, and more! Interested to learn more? Apply online today to get your name in the running for this new opportunity!&lt;br&gt;&lt;br&gt;",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-07-21T11:17:56.000Z"
    },
    "company": {
        "name": "Dice",
        "link": "https://www.linkedin.com/company/dice"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}