{
    "job": {
        "title": "Junior Software Engineer",
        "industry": "Information Technology and Services",
        "description": "&lt;p&gt;&lt;strong&gt;Junior Developer&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Columbus, OH&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Contract to Hire&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;As a Junior Software Developer, you will work on a team developing, testing, debugging, and supporting new software or enhancements to existing software in support of a very complex business model! This role includes meeting with customers to understand their business processes and needs with the objective of determining solutions to support the business.&amp;nbsp;This will sometimes require filling multiple roles to turn the customer's needs into actual solutions.&amp;nbsp;We are looking for someone who takes initiative, owns issues from start to finish, and is a proactive communicator. Daily activities include typical software development activities (developing, testing, debugging, supporting). This is an awesome environment with growth opportunities!&lt;/p&gt;&lt;p&gt;This role will be onsite for the first month, then follow a 2 week onsite/2 week remote schedule!&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;&lt;u&gt;Minimum Requirements:&lt;/u&gt;&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Degree in Computer Science, Computer Engineering, Management Information Systems, Software Engineering, or similar area of study&lt;/li&gt;&lt;li&gt;Understanding of project lifecycle methodologies (Waterfall, Iterative, Agile/Scrum)&lt;/li&gt;&lt;li&gt;Excellent verbal and written communication; ability to explain project risks and issues, and IT related concepts clearly and concisely&lt;/li&gt;&lt;li&gt;Experience with Object Oriented Programming languages such as Java&lt;/li&gt;&lt;li&gt;Knowledge or an interest in learning AWS&lt;/li&gt;&lt;li&gt;Knowledge of relational databases&lt;/li&gt;&lt;li&gt;Ability to create and modify SQL queries&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;&lt;u&gt;Primary Responsibilities:&lt;/u&gt;&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Software analysis activities for new software or enhancements to existing software to include providing high level estimates based on limited information in support of the project governance process.&lt;/li&gt;&lt;li&gt;Software development activities for new software or enhancements to existing software.&lt;/li&gt;&lt;li&gt;Support of new and existing software.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Interaction/communication with business users regarding requirements, design reviews, prototype presentations, etc.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;Eight Eleven Group provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, national origin, age, sex, citizenship, disability, genetic information, gender, sexual orientation, gender identity, marital status, amnesty or status as a covered veteran in accordance with applicable federal, state, and local laws.&lt;/p&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-18T18:54:07.000Z"
    },
    "company": {
        "name": "Brooksource",
        "link": "https://www.linkedin.com/company/brooksource"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": 50000,
        "max_value": 60000,
        "unit": "YEAR"
    },
    "location": {
        "country": "US",
        "locality": "Columbus",
        "region": "Ohio Metropolitan Area",
        "postal_code": "43206",
        "street_address": null,
        "latitude": 39.978302,
        "longitude": -82.99313
    }
}