{
    "job": {
        "title": "Software Engineer",
        "industry": "Industrial Automation,Mechanical or Industrial Engineering",
        "description": "&lt;p&gt;Our global client is seeking a motivated Engineer with some software development/programming experience to join their growing team in the Greater Boston area. To be successful in this role, candidates must have strong analytical and troubleshooting abilities and have some exposure to working with and/or programming automated equipment. The selected candidate will responsible for developing software&amp;nbsp;and test algorithms for high precision automation equipment as well as working directly with the electrical and mechanical systems that are controlled by this software.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;Candidate’s should be enthusiastic about learning new programing languages, as they will be exposed to a varied tech-stack of in-house and external components, and should enjoy working directly with customers.&amp;nbsp;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;Please consider applying for this direct hire opportunity if you are a degreed engineer with a mechanical and electrical aptitude who has an interest in pursuing a career in software engineering. Travel required up to 25% of the time.&amp;nbsp;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Additional Responsibilities&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;• Develop software and algorithms to meet required functionality of our high precision equipment and test systems.&amp;nbsp;&lt;/p&gt;&lt;p&gt;• Ensure high-quality product by developing and executing test plans.&lt;/p&gt;&lt;p&gt;• Integrate, debug, and troubleshoot in a hardware and software environment.&lt;/p&gt;&lt;p&gt;• Participate in project planning, technical reviews and status meetings.&lt;/p&gt;&lt;p&gt;• Occasional On-site factory visits in the US, Europe, and Asia for system installation and support working with customers and partners.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Requirements&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;• BS or MS in Computer Science, Mechanical Engineering, Electrical Engineering, or similar technical field&lt;/p&gt;&lt;p&gt;• Previous programming experience (C++, C#, Python) and the desire to learn new languages in order to integrate new technologies.&amp;nbsp;&lt;/p&gt;&lt;p&gt;• Strong problem solving / debugging skills, both in software and basic hardware (simple mechanical and electrical components).&lt;/p&gt;&lt;p&gt;• Ability to interact with customers and stakeholders.&amp;nbsp;&lt;/p&gt;&lt;p&gt;• Ability to resolve complex issues in creative, efficient, methodical, and effective ways.&lt;/p&gt;&lt;p&gt;• Strong data analysis and problem-solving skills.&lt;/p&gt;&lt;p&gt;• Ability to work on challenging assignments with aggressive schedules.&lt;/p&gt;&lt;p&gt;&lt;/p&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-30T16:06:52.000Z"
    },
    "company": {
        "name": "TRIAD Engineering Corp",
        "link": "https://www.linkedin.com/company/triad-engineering-corp"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Woburn",
        "region": "MA",
        "postal_code": "01815",
        "street_address": null,
        "latitude": 42.479126,
        "longitude": -71.1518
    }
}