{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "Information Technology and Services,Computer Software,Telecommunications",
        "description": "&lt;p&gt;As part of a high performing global team, the right candidate will play a hands-on role in the design and development for implementing Machine learning best practices in network traffic data collection, processing, analysis, and monitoring.&lt;/p&gt;&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;p&gt;Responsibilities&amp;nbsp;:-&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Design, develop and maintain key frameworks, services and applications for network traffic data collection, processing, analysis, correlation, and monitoring in Cloud Products.&amp;nbsp;&lt;/li&gt;&lt;li&gt;Experience with applying statistical distribution analysis to data.&lt;/li&gt;&lt;li&gt;Hands on experience in designing batch-based, real-time streaming and event-based data solutions (Spark, Storm, Flink etc.&amp;nbsp;Kafka expertise highly desired)&lt;/li&gt;&lt;li&gt;Proficient with microservices-based, API/Endpoint architectures&lt;/li&gt;&lt;li&gt;Experience in network traffic data collection, processing, analysis, and monitoring, and solid understanding of protocols TCP/IP, IPv4/IPv6, NetFlow, sFlow, IPFix. Netconf/Yang&lt;/li&gt;&lt;li&gt;Understanding of concepts of Radius, PPPoE IP, DHCP IP, SNMP.&lt;/li&gt;&lt;li&gt;Highly proficient in Java, Go, Nodejs, Scala, or similar programming languages.&lt;/li&gt;&lt;li&gt;Experience in building and productizing cloud-based/scale data ingestion (preferably in AWS)&lt;/li&gt;&lt;li&gt;Experience in cloud data solutions like Elastic, Greenplum, Redshift or like technologies a plus.&amp;nbsp;&lt;/li&gt;&lt;li&gt;5 -10 years of highly technical, hands-on software engineering experience. Independent and Self driven and works in a Team.&lt;/li&gt;&lt;li&gt;Customer facing engineering role in debugging and resolving field issues.&lt;/li&gt;&lt;li&gt;Participate and drive technical discussions within engineering group in all phases of the SDLC: review requirements, produce design documents, participate in Peer reviews, produce test plans, support QA team, provide internal training and support TAC team.&amp;nbsp;&lt;/li&gt;&lt;li&gt;Organized and goal-focused, ability to deliver in a fast-paced environment.&lt;/li&gt;&lt;li&gt;Strong, creative problem-solving skills and ability to abstract and share details to create meaningful articulation.&lt;/li&gt;&lt;li&gt;Implementation background in various data processing, consumption patterns, and pipelines.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;/p&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-13T17:44:58.000Z"
    },
    "company": {
        "name": "HCL Technologies",
        "link": "https://in.linkedin.com/company/hcl-technologies"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}