{
    "job": {
        "title": "CoreMedia Captions Software Engineer",
        "industry": "Consumer Electronics",
        "description": "&lt;br&gt;&lt;strong&gt;Summary&lt;br&gt;&lt;/strong&gt; &lt;br&gt;The Interactive Media Group (IMG) provides the media and graphics foundation across all of Apple's innovative products, including Mac, iPhone, AppleTV, iPad and iPod, as well as professional and consumer applications from Final Cut to iMovie, Photos and iTunes. Our team is responsible for providing software services enabling clients to operate on linear audiovisual media. This includes local media playback, video-on-demand and live streaming of multimedia content. Our media engine is used across Apple products such as iTunes, Safari, QuickTime Player, TV and Music on iOS as well as 3rd party applications. Our team is looking for a software engineer with a strong technical and programming background to expand our support for subtitles and captions processing for various formats. Experience in development and debugging of large software systems and/or significant components of such systems is desired.&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Key Qualifications&lt;br&gt;&lt;/strong&gt; &lt;br&gt;You will have experience working as part of a software development team C/C++ &lt;br&gt;&lt;br&gt;You will have strong object-oriented programming skills&lt;br&gt;&lt;br&gt;You will have excellent verbal and written communication skills&lt;br&gt;&lt;br&gt;You will have excellent problem solving and debugging skills&lt;br&gt;&lt;br&gt;You have excellent judgment and integrity with the ability to make timely and sound decisions&lt;br&gt;&lt;br&gt;You are upbeat, adaptable, and results oriented with a positive attitude&lt;br&gt;&lt;br&gt;You bring passion and dedication to your job and are committed to our vision and supporting the developer community&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Description&lt;br&gt;&lt;/strong&gt; &lt;br&gt;You will be a dedicated, detail-oriented professional with excellent communication skills and appropriate in a fast-paced environment. You will work in the area of subtitles and captions processing for playback and/or authoring use cases. You will follow good software development practices and put strong emphasis on producing high-quality, well-tested software. You will interface and collaborate with various teams to come up with innovative, clean and maintainable solutions that can be delivered in a timely manner. You will thrive in a high-paced environment.&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Education &amp;amp; Experience&lt;br&gt;&lt;/strong&gt; &lt;br&gt;Masters degree in Computer Science/Engineering, or equivalent&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Additional Requirements&lt;br&gt;&lt;/strong&gt; &lt;br&gt;Nice to have but not required: &lt;br&gt;&lt;br&gt;You will have experience with subtitles and captions processing including rendering and/or authoring&lt;br&gt;&lt;br&gt;You will have familiarity with one or all of the formats - WebVTT, CEA-608, TTML, IMSC.&lt;br&gt;&lt;br&gt;You will have experience collaborating with Apple technologies like CoreText, CoreGraphics, CoreAnimation or equivalent technologies on other platforms&lt;br&gt;&lt;br&gt;You will have experience using the CoreFoundation, AVFoundation or CoreMedia frameworks or equivalent technologies is a plus&lt;br&gt;&lt;br&gt;You will have experience analyzing and optimizing software performance, both to improve speed and efficiency and to reduce power consumption&lt;br&gt;&lt;br&gt;You will have familiarity with Objective-C, Swift and Xcode is a plus iOS and/or macOS software development experience preferred&lt;br&gt;&lt;br&gt; &lt;br&gt;Role Number: 200141044&lt;br&gt;&lt;br&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-23T06:37:03.000Z"
    },
    "company": {
        "name": "Apple",
        "link": "https://www.linkedin.com/company/apple"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Cupertino",
        "region": "CA",
        "postal_code": "95014",
        "street_address": null,
        "latitude": 37.319313,
        "longitude": -122.02927
    }
}