{
    "job": {
        "title": "Lead Software Quality Assurance Engineer (Remote Option Available)",
        "industry": "Information Technology and Services,Computer Software,Hospital &amp; Health Care",
        "description": "&lt;strong&gt;&lt;u&gt;Overview&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;Altarum, a nonprofit systems research and consulting organization serving government and private sector clients, is pleased to announce an opening for a Lead Software Quality Assurance Engineer within the Center for Connected Health. The Center for Connected Health advances population health management and healthcare delivery through the development of novel applications and health information exchange and interoperability solutions.&lt;br&gt;&lt;br&gt;This position in conjunction with team members, will develop and implement quality assurance standards and measures within the project. This role is responsible for writing test plans, creating and executing both functional and automated tests, for tracking defects and fixes and reporting the progress of each. The Analyst will apply proven analytical and problem-solving skills to help validate IT processes through careful testing in order to maximize the benefit of business investments in IT initiatives.&lt;br&gt;&lt;br&gt;This is a W-2 position that will be dedicated to working on one of our cutting-edge projects to revamp a public health disease surveillance system that is anticipated to end in December 2022.&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;Responsibilities&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt; Demonstrate knowledge and experience using various testing methodologies. &lt;/li&gt;&lt;li&gt; Define and create overall application testing strategy and ensures it is being achieved. &lt;/li&gt;&lt;li&gt; Take on a lead role for the QA effort which includes, but is not limited to: creating test plans, writing test cases, performing functional and exploratory testing, effectively communicating statuses, and coordinating meetings. &lt;/li&gt;&lt;li&gt; Oversee and delegate work to QA Associates. &lt;/li&gt;&lt;li&gt; Define test process for the application and responsible to perform all aspects of testing including manual execution, automated execution and system performance. &lt;/li&gt;&lt;li&gt; Execute and evaluate manual or automated test cases and report test results. &lt;/li&gt;&lt;li&gt; Promote, foster and proactively implement the use of quality assurance best practices and standards on a daily basis. &lt;/li&gt;&lt;li&gt; Create and maintain efficient automated scripts that utilize clean code and best practice coding standards. &lt;/li&gt;&lt;li&gt; Manage and maintain efficiency in the automated script execution and script development through the implementation of automation best practices. &lt;/li&gt;&lt;li&gt; Stay current with new technologies, including tools, components, and frameworks. &lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;&lt;u&gt;Qualifications&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt; BS in Computer Science or Information Systems &lt;/li&gt;&lt;li&gt; At least 5 years of experience in performing QA for web applications. &lt;/li&gt;&lt;li&gt; Experience in an agile development environment. &lt;/li&gt;&lt;li&gt; Ability to lead a team of QA engineers &lt;/li&gt;&lt;li&gt; Able to communicate with the developers and analysts effectively. &lt;/li&gt;&lt;li&gt; Proven ability to work in a team-oriented, collaborative environment. &lt;/li&gt;&lt;li&gt; Experience with test automation frameworks and testing tools like Protractor, Selenium, Cucumber, TestNG, or Junit, Sauce Labs/Browser Stack, Load Runner etc. &lt;/li&gt;&lt;li&gt; Experience with SQL is preferred. &lt;/li&gt;&lt;li&gt; Experience with Jira, bug tracking and version control systems is required. &lt;/li&gt;&lt;li&gt; At this time we will only accept candidates who are presently eligible to work in the United States and will not require sponsorship &lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;&lt;u&gt;About Altarum&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;Altarum Institute (Altarum) is a nonprofit organization headquartered in Ann Arbor, Michigan. We improve the health of at-risk and disenfranchised populations by building better systems of care and empowering all people to make well informed health decisions. Public sector clients include the U.S. Department of Defense, Department of Health and Human Services, Department of Agriculture, Department of Veterans Affairs, and various state agencies nationwide. Altarum also serves clients in the philanthropic and private sectors. Areas of expertise include military health, women’s health, behavioral health and substance use disorders, health disparities and equity, continuing medical education and quality improvement, eldercare, public health interoperability, and disease surveillance.&lt;br&gt;&lt;br&gt;In addition to the meaningful and challenging work, Altarum offers an outstanding benefits program that includes paid time off, tuition reimbursement, 401k (5% employer contribution), a flexible work environment, and much more. We invite you to explore exciting and rewarding career opportunities with us.&lt;br&gt;&lt;br&gt;Altarum provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-21T01:46:58.000Z"
    },
    "company": {
        "name": "Altarum",
        "link": "https://www.linkedin.com/company/altarum"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}