{
    "job": {
        "title": "Project Engineer",
        "industry": "",
        "description": "DEMS is a provider of differentiated professional services, consulting, and digital transformation technologies across the asset and the program life-cycle serving the Energy, Chemical, Health Care and Public Infrastructure industries. The Company's business is organized into three business units: Engineering Solutions, Technology Solutions and Program Management Office (PMO) Solutions. Its capabilities and offerings include feasibility and solution development; technical and management consulting; research and development; engineering and design services; asset operations and maintenance services; and engineering, procurement and construction services for small, medium and large-scale, complex capital projects and programs.&lt;br&gt;&lt;br&gt;We are looking for an accountable project engineer to be responsible for all engineering and technical disciplines that projects involve. You will schedule, plan, forecast, resource and manage all the technical activities aiming at assuring project accuracy and quality from conception to completion.&lt;br&gt;&lt;br&gt;Responsibilities:&lt;br&gt;&lt;br&gt;1. Prepare, schedule, coordinate and monitor the assigned engineering projects.&lt;br&gt;2. Monitor compliance to applicable codes, practices, QA/QC policies, performance standards and specifications.&lt;br&gt;3. Interact daily with the clients to interpret their needs and requirements and represent them in the field.&lt;br&gt;4. Perform overall quality control of the work (budget, schedule, plans, personnel’s performance) and report regularly on project status.&lt;br&gt;5. Assign responsibilities and mentor project team.&lt;br&gt;6. Cooperate and communicate effectively with project manager and other project participants to provide assistance and technical support.&lt;br&gt;7. Review engineering deliverables and initiate appropriate corrective actions&lt;br&gt;&lt;br&gt;Skills:&lt;br&gt;&lt;br&gt;1. Proven working experience as a project engineer.&lt;br&gt;2. Excellent knowledge of design and visualisations software such as AutoCAD&lt;br&gt;Advanced MS Office skills.&lt;br&gt;3. Familiarity with rules, regulations, best practices and performance standards.&lt;br&gt;4. Ability to work with multiple discipline projects.&lt;br&gt;5. Project management and supervision skills&lt;br&gt;6. Decision making ability and leadership skills&lt;br&gt;Current engineer license.&lt;br&gt;7. Time management and organization skills.&lt;br&gt; &lt;br&gt;BS degree in Engineering or relevant field",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-12T05:06:31.000Z"
    },
    "company": {
        "name": "DEMS,LLC",
        "link": "https://www.linkedin.com/company/dems-llc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Greater Houston",
        "region": null,
        "postal_code": "77039",
        "street_address": null,
        "latitude": 29.757027,
        "longitude": -95.3556
    }
}