{
    "job": {
        "title": "Machine Learning Engineer - Speech Recognition",
        "industry": "Restaurants",
        "description": "&lt;p&gt;We are currently looking for a Machine Learning Engineer – Speech Recognition, to help us build and improve our state-of-the-art streaming bilingual speech recognition system, using real-world data from our conversational AI Drive Thru product. The Speech Recognition Engineer will be a key member of the Speech/ML team within the core technology group at McD Tech Labs and will have the ability to make a large impact on our AI Drive Thru technology.&lt;br&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;Responsibilities:&lt;br&gt;&lt;br&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Work closely with the Speech and Machine Learning groups to explore, implement, and evaluate state-of-the-art approaches to speech recognition&lt;/li&gt;&lt;li&gt;Contribute to ASR model optimization based on large scale real-world data&lt;/li&gt;&lt;li&gt;Deploy and support production ASR models in the real world&lt;/li&gt;&lt;li&gt;Collaborate with the Infrastructure, Data Engineering, and ML Evaluation teams to improve data pipelines and tooling for continuously training and benchmarking ASR at scale&lt;br&gt;&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;Qualifications&lt;br&gt;&lt;br&gt;&lt;/strong&gt;&lt;p&gt;Must have received or be willing to receive the COVID-19 vaccination by date of hire to be considered. Proof of vaccination required.&lt;br&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;Required Qualifications:&lt;br&gt;&lt;br&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;M.S. or Ph.D. in Computer Science, Speech Recognition, or Machine Learning, or equivalent professional experience&lt;/li&gt;&lt;li&gt;2+ years experience using Python, C++, or similar languages&lt;/li&gt;&lt;li&gt;Research or experience in Machine Learning, Deep Learning and/or Speech Recognition&lt;/li&gt;&lt;li&gt;Experience with one or more deep learning frameworks, such as PyTorch, TensorFlow, MXNet, or similar tools&lt;/li&gt;&lt;li&gt;Excellent written and verbal communication skills&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;Desired Qualifications:&lt;br&gt;&lt;br&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Experience with standard ASR toolkits such as Kaldi, HTK, or similar&lt;/li&gt;&lt;li&gt;Working proficiency in Spanish&lt;/li&gt;&lt;li&gt;Experience designing and deploying bilingual ASR models or systems&lt;/li&gt;&lt;li&gt;Experience with MLOps and/or ML at scale&lt;/li&gt;&lt;li&gt;Experience with Spanish NLP&lt;/li&gt;&lt;li&gt;Experience with Linux based development&lt;br&gt;&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;Additional Information&lt;br&gt;&lt;br&gt;&lt;/strong&gt;&lt;p&gt;McDonald’s is committed to providing qualified individuals with disabilities reasonable accommodations to perform the essential functions of their jobs. Additionally, if you (or another applicant of whom you are aware) require assistance accessing or reading this job posting or otherwise seek assistance in the application process, please contact recruiting.supportteam@us.mcd.com &lt;br&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;McDonald’s provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to sex, sex stereotyping, pregnancy (including pregnancy, childbirth, and medical conditions related to pregnancy, childbirth, or breastfeeding), race, color, religion, ancestry or national origin, age, disability status, medical condition, marital status, sexual orientation, gender, gender identity, gender expression, transgender status, protected military or veteran status, citizenship status, genetic information, or any other characteristic protected by federal, state or local laws. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.&lt;br&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;Nothing in this job posting or description should be construed as an offer or guarantee of employment.&lt;br&gt;&lt;br&gt;&lt;/p&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-12T14:55:39.000Z"
    },
    "company": {
        "name": "McDonald's",
        "link": "https://www.linkedin.com/company/mcdonald%27s-corporation"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Mountain View",
        "region": "CA",
        "postal_code": "94040",
        "street_address": null,
        "latitude": 37.39008,
        "longitude": -122.08139
    }
}