{
    "job": {
        "title": "Software Engineer",
        "industry": "",
        "description": "We are presently looking for an experienced Software Engineer to join a team focused on developing software that aids in the collection and processing of images. Our customers' appetite for images is unbounded and you will help meet their needs by designing/building/supporting a variety of applications that enable us to collect, catalog, and process more images, more efficiently, and with higher quality. &lt;br&gt;&lt;br&gt;BA/BS in Computer Science or related technical field&lt;br&gt;3+ years of software development experience&lt;br&gt;2+ years experience developing with Python, Java or other OO languages&lt;br&gt;Built applications using relational databases such as MySQL, Postgresql&lt;br&gt;Experience with HTML, JavaScript (React &amp; JQuery), CSS&lt;br&gt;Experience building and supporting batch or real-time data processes with technologies including Docker, Kubernetes, Terraform, Ansible, AWS Lambda&lt;br&gt;A solid foundation in software development and software design principles&lt;br&gt;Experience with Agile methodologies such as Scrum and test-driven development&lt;br&gt;Strong communication skills; you’ll be interfacing with users and other technical teams&lt;br&gt;Ability and passion for learning new technology",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-05T17:21:36.000Z"
    },
    "company": {
        "name": "Gracenote",
        "link": "https://www.linkedin.com/company/gracenote"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}