{
    "job": {
        "title": "NetSuite (ERP) Business Analyst - Remote",
        "industry": "Information Technology and Services",
        "description": "&lt;p&gt;Business Analysts are responsible for defining scope, eliciting business requirements, and documenting in a concise manner for business and technology-enabled process improvement projects. They quickly learn and understand business operational processes and the technology applications used to support them. Additionally, they work closely with stakeholders to understand needs, create and improve processes, and propose solutions aligned with needs.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Duties&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;* Experience implementing Netsuite or Similar ERP / CRM Systems through the full life cycle &lt;/p&gt;&lt;p&gt;Strong experience with Data Mapping, conversion, and systems integrations &lt;/p&gt;&lt;p&gt;* Evaluates business needs, analyzes current processes, assists in evaluating alternatives, and recommends solutions.&lt;/p&gt;&lt;p&gt;* Collaborates with business and information technology teams to ensure sufficient current and designed future state process documentation is captured, allowing technology development teams to successfully code and implement technology-enabled projects.&lt;/p&gt;&lt;p&gt;* Develops strong relationships with stakeholders, and promotes company culture and service philosophy.&lt;/p&gt;&lt;p&gt;* Supports assessing, prioritizing, and executing strategic projects.&lt;/p&gt;&lt;p&gt;* Elicits business requirements utilizing a variety of collaborative techniques including interviews, work sessions, storyboarding, and prototyping.&lt;/p&gt;&lt;p&gt;* Facilitates requirements gathering sessions with business stakeholders; creates process flows and develops various requirements and other artifacts.&lt;/p&gt;&lt;p&gt;* Measures and compiles reports on operational effectiveness and improvements introduced through technology or business process improvements.&lt;/p&gt;&lt;p&gt;* Creates diagrams to include use cases, activity charts, and process flow diagrams.&lt;/p&gt;&lt;p&gt;* Evaluates and determines level of effort and time required for solution delivery to ensure completion in a timely manner.&lt;/p&gt;&lt;p&gt;* Assists with the development of test strategies, plans, scenarios and test cases.&lt;/p&gt;&lt;p&gt;* Facilitates requirements reviews with business and information technology teams.&lt;/p&gt;&lt;p&gt;* Identifies and assists in resolving issues, questions, and scope/requirement gaps quickly and effectively to enable delivery and support of applications.&lt;/p&gt;&lt;p&gt;* Other duties and special projects assigned.&lt;/p&gt;&lt;p&gt;* Utilizes standard templates to accurately and concisely write requirements specifications.&lt;/p&gt;&lt;p&gt;* Conducts peer reviews of the business requirements to ensure that requirement specifications are correctly interpreted.&lt;/p&gt;&lt;p&gt;* Communicates changes, enhancements, and modifications of business requirements, verbally or through written documentation to project managers, sponsors, and other stakeholders to ensure understanding of issues and solutions.&lt;/p&gt;&lt;p&gt;* Participates in design review and QA testing of proposed solutions to ensure features and functions have been enabled and optimized.&lt;/p&gt;&lt;p&gt;&lt;/p&gt;",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-25T17:24:41.000Z"
    },
    "company": {
        "name": "Vaco",
        "link": "https://www.linkedin.com/company/vaco"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": 90000,
        "max_value": 120000,
        "unit": "YEAR"
    },
    "location": {
        "country": "US",
        "locality": "Southfield",
        "region": "MI",
        "postal_code": "48037",
        "street_address": null,
        "latitude": 42.480198,
        "longitude": -83.241
    }
}