{
    "job": {
        "title": "Senior Strategic Sourcing Specialist",
        "industry": "Arts and Crafts,Building Materials,Consumer Goods",
        "description": "&lt;p&gt;&lt;strong&gt;Senior Strategic Sourcing Specialist&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Gastonia, NC&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Competitive Compensation and Benefits Package&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;The Senior Strategic Sourcing Specialist&lt;/strong&gt; will be responsible for all tactical sourcing and supplier management duties associated with assigned product categories. The position must support Marketing and Sales in new product introductions and innovations to existing products.&amp;nbsp;The Senior Strategic Sourcing Specialist is also responsible for supporting Operations by pursuing improvements in supplier performance, controlling inventory and the overall reduction of product and supply chain costs.&lt;/p&gt;&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Senior Strategic Sourcing Specialist Responsibilities:&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;The Senior Strategic Sourcing Specialist is empowered to make decisions regarding:&lt;/li&gt;&lt;li&gt;Supplier selection with supervisor approval.&lt;/li&gt;&lt;li&gt;Managing and communicating supplier performance and key actions for improvement for the suppliers within the category/categories that they manage after review with direct supervisor.&lt;/li&gt;&lt;li&gt;Establish purchase agreements with the suppliers they manage after review with direct supervisor.&lt;/li&gt;&lt;li&gt;Negotiations:&amp;nbsp;&amp;nbsp;This position is responsible for establishing programs to regularly identify the lowest total cost through request for proposals, product category reviews and identifying cost-out opportunities. This scope includes participation in negotiations regarding price, terms, quality, inventory programs, and lead time for assigned suppliers/categories.&lt;/li&gt;&lt;li&gt;Market Trends:&amp;nbsp;&amp;nbsp;The position is responsible for monitoring relevant raw material market prices and to develop knowledge of industry for assigned category.&amp;nbsp;&lt;/li&gt;&lt;li&gt;Sourcing:&amp;nbsp;&amp;nbsp;The Senior Strategic Sourcing Specialist has responsibility for locating and assisting supervisor in the qualification of potential suppliers. Responsible for assisting in the development of secondary suppliers as needed.&lt;/li&gt;&lt;li&gt;Supplier Relations:&amp;nbsp;&amp;nbsp;This position is responsible for initiating and maintaining effective relationships with actual and potential suppliers for their area of responsibility.&amp;nbsp;&amp;nbsp;Provide regular communications of supplier performance through evaluations.&lt;/li&gt;&lt;li&gt;Supplier Management:&amp;nbsp;&amp;nbsp;Assist supervisor in the facilitation of solutions to supplier quality problems, delivery performance issues, supplier supply chain constraints, etc. by fully understanding supplier processes, supply chain and product make-up to the extent that the supplier will share this information.&lt;/li&gt;&lt;li&gt;Product Engineering:&amp;nbsp;&amp;nbsp;Participate in cross-functional team in the design and development of new products, leveraging supplier engineering capabilities together with internal technical resources.&amp;nbsp;&amp;nbsp;Assist in specification development.&lt;/li&gt;&lt;li&gt;Continuous Improvement/Q.A.:&amp;nbsp;&amp;nbsp;In conjunction with Q.A., the Strategic Sourcing Specialist is responsible for establishment and maintenance of supplier quality control and continuous improvement and the development of supplier certification programs.&lt;/li&gt;&lt;li&gt;Transactional Management:&amp;nbsp;&amp;nbsp;Purchase orders, receipt of goods, items set-up and costing, terms and conditions and invoice resolution.&lt;/li&gt;&lt;li&gt;Expediting: Support Buyer/Planners in expediting purchase orders for problem situations as requested or as dictated by conditions.&lt;/li&gt;&lt;li&gt;Purchasing Policies: Senior Strategic Sourcing Specialist is responsible for understanding and implementing industry accepted purchasing policies and procedures.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Senior Strategic Sourcing Specialist Requirements:&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Bachelors’ degree required.&lt;/li&gt;&lt;li&gt;5-10 years of Strategic Sourcing experience required.&amp;nbsp;&lt;/li&gt;&lt;li&gt;Institute of Supply Management self-paced course required – Building Blocks of Supply Management.&lt;/li&gt;&lt;li&gt;Excellent communication and negotiation skills.&lt;/li&gt;&lt;li&gt;Strong analytical and organizational skills.&lt;/li&gt;&lt;li&gt;PC/Software knowledge.&amp;nbsp;&amp;nbsp;Must be proficient at navigating SAP and running Purchasing reports.&lt;/li&gt;&lt;li&gt;Some international and domestic travel required.&lt;/li&gt;&lt;/ul&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:24:12.000Z"
    },
    "company": {
        "name": "Hunter International Recruiting",
        "link": "https://www.linkedin.com/company/hunter-international-recruiting"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": 56000,
        "max_value": 80000,
        "unit": "YEAR"
    },
    "location": {
        "country": "US",
        "locality": "Gastonia",
        "region": "NC",
        "postal_code": "28053",
        "street_address": null,
        "latitude": 35.262157,
        "longitude": -81.1871
    }
}