{
    "job": {
        "title": "Embedded SW Engineer- C++ S",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Dice is the leading career destination for tech experts at every stage of their careers. Our client, Sovereign Technologies, is seeking the following. Apply via Dice today!&lt;br&gt;&lt;br&gt;Title Embedded SW Engineer- C++ Location Mossville, IL Duration 6 Months + Rate Open Visa Status Any work Status Candidate Responsibilities This is a position for a software engineer to develop Onboard Core Information software for Displays and Telematics used on Caterpillar machine engine applications. The candidatersquos duties will include but are not limited to developing, configuring, and testing Onboard Core Information software troubleshooting and correcting software issues and reporting development status. This position involves working closely with systems engineers, and the Core Information software development team Typical Day The candidate will be developing, configuring, and testing Onboard Core Information software. They will also be troubleshooting and correcting software issues. There is a daily stand-up for reporting development status. Education Requirement BSEE, BSCE, or BSCS Technical Skills Required o Required Qualifications sect BSEE, BSCE, or BSCS sect 3 years of development experience using C++ andor C programming languages sect 3 years of development experience with Linux kernel Linux device drivers sect Prior experience with embedded software development, design, and architecture o Desired Qualifications sect Desire to work in a fast-paced Agile team environment sect Experience in Cybersecurity sect Experience with GIT configuration management tool sect Ability to read electrical schematics sect Experience with scripting using Python sect Experience with RTOS development (i.e. Free RTOS) sect Experience with Ethernet, TCPIP, and WiFi sect Experience with CAN, J1939, and other data link protocols sect Experience using Design Patterns and Object Oriented programming sect Experience with developing Unit Tests and Test Driven Development sect Experience using debugging tools for embedded systems (e.g. Lauterbach, GDB) Soft Skills Required Team Player, good communication",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-18T22:02:18.000Z"
    },
    "company": {
        "name": "Dice",
        "link": "https://www.linkedin.com/company/dice"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Mossville",
        "region": "IL",
        "postal_code": "61552",
        "street_address": null,
        "latitude": 40.816647,
        "longitude": -89.5687
    }
}