{
    "job": {
        "title": "Data Scientist",
        "industry": "Defense &amp; Space",
        "description": "Are you ready to take your career to a new level and work at an extraordinary company in Herndon, VA?&lt;br&gt;&lt;br&gt;The coolest jobs on this planet… or any other… are with Lockheed Martin Space.&lt;br&gt;&lt;br&gt;Lockheed Martin is a pioneer, partner, innovator and builder. Our amazing people are on a mission to make a difference in the world and every single day we use our unique skills and experiences to create, design and build solutions to some of the worlds’ hardest engineering problems.&lt;br&gt;&lt;br&gt;Do you want to be part of a culture that inspires employees to think big, perform with excellence and build incredible products? We provide the resources, inspiration and focus - if you have the passion and courage to dream big, then we want to build a better tomorrow with you.&lt;br&gt;&lt;br&gt;Do you have a passion for working on emerging technologies? Cyber is an essential element of Space’s strategy for growth as these skill-sets have become essential to meeting customer and internal needs. In support of new programs, our Cyber Exploitation teams are building capabilities and specialized tools and techniques. We are increasing focus and emphasis on our customer’s hardest problems, including challenges unique to the of cyber security tools and integrated effects.&lt;br&gt;&lt;br&gt;We are looking for a Data Scientist who will support our product with insights gained from analyzing customer data. The ideal candidate is adept at using large data sets to find opportunities for product and process optimization and using models to test the effectiveness of different courses of action. They must have strong experience using a variety of data mining/data methods, using a variety of data tools, building and implementing models, using/creating and creating/running . They must have a proven ability to drive business results with their data-based insights.&lt;br&gt;&lt;br&gt;They must be comfortable working with a wide range of stakeholders and functional teams. The right candidate will have a passion for discovering solutions hidden in large data sets and working with stakeholders to improve business outcomes.&lt;br&gt;&lt;br&gt;Applicants selected will be subject to a government security investigation and must meet eligibility requirements for access to classified information.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-06T22:24:37.000Z"
    },
    "company": {
        "name": "Lockheed Martin",
        "link": "https://www.linkedin.com/company/lockheed-martin"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Herndon",
        "region": "VA",
        "postal_code": "22092",
        "street_address": null,
        "latitude": 38.96973,
        "longitude": -77.38387
    }
}