{
    "job": {
        "title": "Software Quality Engineer",
        "industry": "Electrical/Electronic Manufacturing,Information Technology and Services,Automotive",
        "description": "RGBSI, is dedicated to providing the highest quality of services to our clients and employees. We are proud to be the primary partner to top companies in the automotive, aerospace &amp;amp; defense, IT, media &amp;amp; entertainment, sports, energy, and finance industries. As a result of our clients' continued growth, we are looking for energetic, personable professionals to partner with these leading US companies.&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;Description&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;Perform software quality assurance activities on the software development process. &lt;/li&gt;&lt;li&gt;Includes review of software documentation, perform audits and evaluations on software products and documentation to ensure compliance with company standards and applicable government regulations.&lt;/li&gt;&lt;li&gt;In addition to the Software Quality Engineering activities there may be a need to provide assistance to product quality engineers such as helping with Hardware Acceptance Data Packages, review manufacturing and test work instructions. Generate reports and analyze quality data for improvements.&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;&lt;u&gt;Education&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;Bachelors&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;We offer attractive, competitive compensation and benefits including, medical, dental, 401k, Short Term Disability, AD&amp;amp;D and Tuition Reimbursement, etc. If you take pride in your work and are committed to personal and professional success we want to talk to you. Please visit www.rgbsi.com to learn more.&lt;br&gt;&lt;br&gt;RGBSI is a Multi-National Corporation headquartered in Troy, MI with branches throughout the USA, Canada, Germany, Mexico, and India.",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-07-07T06:47:44.000Z"
    },
    "company": {
        "name": "RGBSI",
        "link": "https://www.linkedin.com/company/rgbsi"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Windsor Locks",
        "region": "CT",
        "postal_code": "06096",
        "street_address": null,
        "latitude": 41.924953,
        "longitude": -72.627174
    }
}