{
    "job": {
        "title": "Software Engineer",
        "industry": "Electrical/Electronic Manufacturing,Information Technology and Services,Computer Software",
        "description": "&lt;strong&gt;&lt;u&gt;Job Description&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;As a software engineer in the Technology Development Analytics and Technology Automation (TD ATA) Factory Data Systems group, you will partner with other engineers to create integrated software systems that improve manufacturing output and productivity for Intel's semiconductor manufacturing factories. These state-of-the-art systems include tracking the product as it moves through the factory to enable traceability of material processed by Intel manufacturing plants worldwide.&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;Responsibilities Will Include But Not Be Limited To&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;Analyzing the customer requirements and designing software solutions to meet requirements&lt;/li&gt;&lt;li&gt;Maintaining clear communications with customers and stakeholders&lt;/li&gt;&lt;li&gt;Work as part of a software development team to create robust, reliable, and high-performance applications that achieve customer requirements&lt;/li&gt;&lt;li&gt;Creating and running test suites to prove the functionality, reliability, and performance of the applications developed&lt;/li&gt;&lt;li&gt;Providing expert level support to end users on use of these applications&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;The candidate should also exhibit the following behavioral traits and/or skills:&lt;br&gt;&lt;ul&gt;&lt;li&gt;Analytical problem solving and troubleshooting skills&lt;/li&gt;&lt;li&gt;Written and oral communication skills&lt;/li&gt;&lt;li&gt;Teamwork skills and collaboration skills&lt;/li&gt;&lt;li&gt;Tolerance of ambiguity and self-motivation&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;&lt;u&gt;Qualifications&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;Minimum qualifications are required to be initially considered for this position. Preferred qualifications are in addition to the minimum requirements and are considered a plus factor in identifying top candidates.&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;Minimum Qualifications&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;Candidate must possess a bachelors, masters, or PhD in Computer Science, Computer Engineering, or related discipline.&lt;/li&gt;&lt;li&gt;5+ years of experience in:&lt;/li&gt;&lt;ul&gt;&lt;li&gt;Object-Oriented software design and development (e.g., C#, Java, C++)&lt;/li&gt;&lt;li&gt;Database development (e.g., Oracle, Microsoft SqlServer)&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;/ul&gt;&lt;strong&gt;&lt;u&gt;Preferred Qualifications&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;3+ years of experience in:&lt;/li&gt;&lt;ul&gt;&lt;li&gt;Oracle DB development&lt;/li&gt;&lt;li&gt;Microsoft development tools (Visual Studio, .NET)&lt;/li&gt;&lt;li&gt;Building distributed systems- Semiconductor device traceability&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;/ul&gt;&lt;strong&gt;Inside this Business Group&lt;br&gt;&lt;br&gt;&lt;/strong&gt;As the world's largest chip manufacturer, Intel strives to make every facet of semiconductor manufacturing state-of-the-art -- from semiconductor process development and manufacturing, through yield improvement to packaging, final test and optimization, and world class Supply Chain and facilities support. Employees in the Technology and Manufacturing Group are part of a worldwide network of design, development, manufacturing, and assembly/test facilities, all focused on utilizing the power of Moore’s Law to bring smart, connected devices to every person on Earth&lt;br&gt;&lt;br&gt;&lt;strong&gt;Posting Statement&lt;br&gt;&lt;br&gt;&lt;/strong&gt;All qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, sex, national origin, ancestry, age, physical or mental disability, medical condition, genetic information, military and veteran status, marital status, pregnancy, gender, gender expression, gender identity, sexual orientation, or any other characteristic protected by local law, regulation, or ordinance.&lt;br&gt;&lt;br&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-12T04:08:40.000Z"
    },
    "company": {
        "name": "Intel Corporation",
        "link": "https://www.linkedin.com/company/intel-corporation"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Phoenix",
        "region": "AZ",
        "postal_code": "85009",
        "street_address": null,
        "latitude": 33.448204,
        "longitude": -112.072586
    }
}