{
    "job": {
        "title": "Software Engineer - Backend - VMware / Windows",
        "industry": "Information Technology and Services,Computer Software,Internet",
        "description": "&lt;strong&gt;Software Engineer - VMware/Windows&lt;br&gt;&lt;br&gt;&lt;/strong&gt;&lt;strong&gt;&lt;u&gt;About The Team&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;VMware and Windows are the most widely used data protection and management services in Rubrik. You and the team's work will make a huge impact for our customers and for Rubrik.&lt;br&gt;&lt;br&gt;Our team builds products to protect and manage Rubrik customers’ deployment of VMware and Windows hosts in both data centers and cloud. We make it easier for customers to protect their deployment, faster to recover from unforeseen events.&lt;br&gt;&lt;br&gt;Our engineers are self-starters, driven, and proactive. We provide opportunities for personal growth and support for professional development. Our goal is to motivate and challenge you to do your best work.&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;About The Job&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;As a Software Engineer, you will be responsible for:&lt;br&gt;&lt;ul&gt;&lt;li&gt;Full stack ownership including design, implementation, and testing of new features protecting customers’ virtual machine / Windows host deployment in data centers and in the cloud&lt;/li&gt;&lt;li&gt;Troubleshooting issues experienced by customers or internal product test, and providing remedic solutions&lt;/li&gt;&lt;li&gt;Analyzing field and internal data, and develop product improvement&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;&lt;u&gt;About You&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;You are passionate about working with complex distributed systems that serve business and enterprise customers:&lt;br&gt;&lt;ul&gt;&lt;li&gt;BS/MS/PhD in Computer Science or in any related field&lt;/li&gt;&lt;li&gt;2-4 years of product development experience&lt;/li&gt;&lt;li&gt;Ability to identify scalable and elegant solutions to complex problems&lt;/li&gt;&lt;li&gt;Strong interest and ability to learn new technologies&lt;/li&gt;&lt;li&gt;Proficient in Python, and either C++, Java, Go or Scala&lt;/li&gt;&lt;li&gt;Full stack development experience is a plus&lt;/li&gt;&lt;li&gt;Distributed systems design and development experience is preferred&lt;/li&gt;&lt;li&gt;Experience with popular workload such as Virtual Machines is a bonus&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;&lt;u&gt;About Rubrik&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;Rubrik is one of the fastest growing companies in Silicon Valley, revolutionizing data protection and management in the emerging multi-cloud world. We are the leader in cloud data management, delivering a single platform to manage and protect data in the cloud, at the edge, and on-premises. Enterprises choose Rubrik to simplify backup and recovery, accelerate cloud adoption, enable automation at scale, and secure against cyberthreats. Rubrik has raised over $553 million in venture funding, most recently at a valuation of $3.3 billion. We’ve been recognized as a Forbes Cloud 100 Company two years in a row and as a LinkedIn Top 10 startup.&lt;br&gt;&lt;br&gt;&lt;em&gt;Rubrik provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, Rubrik complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training. &lt;br&gt;&lt;br&gt;&lt;/em&gt;&lt;em&gt;Equal Opportunity Employer/Veterans/Disabled: Rubrik is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or protected veteran status and will not be discriminated against on the basis of disability.&lt;br&gt;&lt;br&gt;&lt;/em&gt;&lt;em&gt;Rubrik provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. In addition to federal law requirements, Rubrik complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training. &lt;br&gt;&lt;br&gt;&lt;/em&gt;&lt;em&gt;Federal law requires employers to provide reasonable accommodation to qualified individuals with disabilities. Please contact us at hr@rubrik.com if you require a reasonable accommodation to apply for a job or to perform your job. Examples of reasonable accommodation include making a change to the application process or work procedures, providing documents in an alternate format, using a sign language interpreter, or using specialized equipment.&lt;br&gt;&lt;br&gt;&lt;/em&gt;&lt;em&gt;EEO IS THE LAW&lt;br&gt;&lt;br&gt;&lt;/em&gt;&lt;em&gt;EEO IS THE LAW - POSTER SUPPLEMENT&lt;br&gt;&lt;br&gt;&lt;/em&gt;&lt;em&gt;PAY TRANSPARENCY NONDISCRIMINATION PROVISION&lt;br&gt;&lt;br&gt;&lt;/em&gt;&lt;em&gt;NOTIFICATION OF EMPLOYEE RIGHTS UNDER FEDERAL LABOR LAWS&lt;br&gt;&lt;br&gt;&lt;/em&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T22:58:52.000Z"
    },
    "company": {
        "name": "Rubrik, Inc.",
        "link": "https://www.linkedin.com/company/rubrik-inc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Palo Alto",
        "region": "CA",
        "postal_code": "94310",
        "street_address": null,
        "latitude": 37.445103,
        "longitude": -122.16036
    }
}