{
    "job": {
        "title": "Software Engineer, Full Stack",
        "industry": "Computer Software,Internet,Financial Services",
        "description": "At Forge, we know our team is our greatest asset. As innovators in the private market, our vision is to deliver a richer future for everyone. We live that vision through our values of being bold, humble and accountable. We experience the value that our vision brings to the world every day, helping the teams behind the greatest innovations of our generation, from space travel to planet-saving, plant-based nutrition and more.&lt;br&gt;&lt;br&gt;Forge Global is building the operating system for the private market innovation economy. We have raised over $250 million in venture capital to date, and facilitated more than $10 billion in private market transactions across over 400 of the world’s most famous unicorn companies. With companies staying private longer and longer, we offer employees and founders financial freedom, which also helps companies retain a happy team when an IPO may be an unknown number of years away. Whether through unlocking their ability to exercise stock options, enabling them to leverage their hard-earned equity, or diversifying their portfolio to secure a strong financial future for themselves and their families, Forge is building innovative liquidity solutions for everyone involved in private companies today.&lt;br&gt;&lt;br&gt;Needless to say, our ability to offer these powerful financial solutions has generated incredible interest from investors, demand from customers, and a need to grow our team to meet the needs of more companies, teams and innovators in this way.&lt;br&gt;&lt;br&gt;&lt;strong&gt; The Role &lt;br&gt;&lt;br&gt;&lt;/strong&gt;Forge’s software engineering team is passionate about innovation and building scalable solutions that drive liquidity and growth in the private market. Our teams are leveraging a broad range of new technologies and are well-versed in delivering high quality, innovative solutions. We thrive on moving fast, delivering value, and living our values of being bold, humble and accountable.&lt;br&gt;&lt;br&gt;We're looking for engineers with ideally of a couple years of experience at a rapidly growing startup, cutting edge teams at a larger tech company, building systems and technology for financial services firms, or a suggested one year of experience post coding bootcamp.&lt;br&gt;&lt;br&gt;We are a full stack shop and our primary web applications are React + Ruby on Rails. All future development will be in Ruby on Rails.&lt;br&gt;&lt;br&gt;Forge is proud to be an equal opportunity employer and values diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-10T17:03:32.000Z"
    },
    "company": {
        "name": "Forge ",
        "link": "https://www.linkedin.com/company/forgeglobal"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Seattle",
        "region": "WA",
        "postal_code": "98133",
        "street_address": null,
        "latitude": 47.60323,
        "longitude": -122.33028
    }
}