{
    "job": {
        "title": "Senior Specialist, Federal ServiceNow Developer",
        "industry": "Management Consulting",
        "description": "&lt;strong&gt;Requisition Number:&lt;/strong&gt; 68949 - 93&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;Description&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;The KPMG Advisory practice is currently our fastest growing practice. We are seeing tremendous client demand, and looking forward we don't anticipate that slowing down. In this ever-changing market environment, our professionals must be adaptable and thrive in a collaborative, team-driven culture. At KPMG, our people are our number one priority. With a wealth of learning and career development opportunities, a world-class training facility and leading market tools, we make sure our people continue to grow both professionally and personally. If you're looking for a firm with a strong team connection where you can be your whole self, have an impact, advance your skills, deepen your experiences, and have the flexibility and access to constantly find new areas of inspiration and expand your capabilities, then consider a career in Advisory.&lt;br&gt;&lt;br&gt;KPMG is currently seeking a Senior Specialist to join our Federal Advisory practice.&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;Responsibilities&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;Perform configuration, integration, custom programming, and other hands-on technical activities in relation to implementation of ServiceNow&lt;/li&gt;&lt;li&gt;Implement ServiceNow customization's including: UI Policies, UI Actions, Business Rules, Client Scripts, workflow administration, and data import&lt;/li&gt;&lt;li&gt;Participate in full software development life cycle: Analysis, Design, Coding, Testing, Training, and Operational support&lt;/li&gt;&lt;li&gt;Serve as an individual contributor or team member on KPMG ServiceNow engagements&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;&lt;u&gt;Qualifications&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;A minimum of three years of ITSM or ServiceNow Development experience; U.S. Federal government consulting experience preferred&lt;/li&gt;&lt;li&gt;Bachelor's degree in Information Systems, Computer Science, or a related discipline from an accredited college/university&lt;/li&gt;&lt;li&gt;Experience working in an Agile or Scrum software development environment&lt;/li&gt;&lt;li&gt;Familiarity with implementing solutions on the ServiceNow platform&lt;/li&gt;&lt;li&gt;Experience with scripting in the ServiceNow platform using JavaScript: Business rules, Client Scripts, UI Actions, UI Pages&lt;/li&gt;&lt;li&gt;Ability to travel as required to support firm engagements&lt;/li&gt;&lt;li&gt;U.S. citizenship required and an active U.S. Federal government Secret security clearance&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;KPMG LLP (the U.S. member firm of KPMG International) offers a comprehensive compensation and benefits package. KPMG is an affirmative action-equal opportunity employer. KPMG complies with all applicable federal, state and local laws regarding recruitment and hiring. All qualified applicants are considered for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other category protected by applicable federal, state or local laws. The attached link contains further information regarding the firm's compliance with federal, state and local recruitment and hiring laws. No phone calls or agencies please.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T22:49:48.000Z"
    },
    "company": {
        "name": "KPMG US",
        "link": "https://www.linkedin.com/company/kpmg-us"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "McLean",
        "region": "VA",
        "postal_code": "22101",
        "street_address": null,
        "latitude": 38.93759,
        "longitude": -77.18378
    }
}