{
    "job": {
        "title": "AI Chatbot Trainer",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "&lt;strong&gt;Position: &lt;/strong&gt;NLU Grammar or AI / Chatbot Trainer&lt;br&gt;&lt;br&gt;&lt;strong&gt;Type: &lt;/strong&gt;12 month contract&lt;br&gt;&lt;br&gt;&lt;strong&gt;Location: &lt;/strong&gt;Remote&lt;br&gt;&lt;br&gt;&lt;strong&gt;Shift:&lt;/strong&gt; M-F 40 hr work week&lt;br&gt;&lt;br&gt;&lt;strong&gt;Number of openings:&lt;/strong&gt; 1&lt;br&gt;&lt;br&gt;&lt;strong&gt;Eligible To Enroll In Apex Benefits During Contract Period&lt;br&gt;&lt;br&gt;&lt;/strong&gt;&lt;strong&gt;Hours worked = hours paid during contract period &lt;br&gt;&lt;br&gt;&lt;/strong&gt;&lt;strong&gt;Job Description:&lt;br&gt;&lt;br&gt;&lt;/strong&gt;Do you have experience working with data? Does conversational interfaces or voice experiences excite you? Are you interested in growing conversational experiences at a Fortune 100? We are looking for an AI Trainer or Data Scientist to join the conversational platform team. Our ideal candidate is a strong in understanding grammar and data related to conversational interfaces. This is an exciting opportunity on a new and growing team.&lt;br&gt;&lt;br&gt;&lt;strong&gt;Day to Day Responsibilities: &lt;br&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;Implement complex dialogues and repair flows using regression testing, context, and/or variety of variables to provide an optimal customer experience.&lt;/li&gt;&lt;li&gt;Understands how business metrics and cognition interrelate and can communicate these insights with key stakeholders and/or business line leaders.&lt;/li&gt;&lt;li&gt;Uses k-fold analysis to improve bot cognition.&lt;/li&gt;&lt;li&gt;Helps with identifying new reports that will allow other team members to self-serve.&lt;/li&gt;&lt;li&gt;Monitors and analyzes conversational interface performance after initial release to find and implement new improvements or opportunities.&lt;/li&gt;&lt;li&gt;Advises business on technical roadmap between NLU capabilities and business priorities (e.g., API needs, data, modeling) and helps with implementing complex transactional dialogues.&lt;/li&gt;&lt;li&gt;Understands personalized responses, proactive engagement, and multi-modal experiences.&lt;br&gt;&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;Requirements: &lt;br&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;2-4 years of experience in training NLU or ML models&lt;/li&gt;&lt;li&gt;Experience working on chatbots, voice assistant, or AI products&lt;/li&gt;&lt;li&gt;Certified in NLU or Grammar Training&lt;/li&gt;&lt;li&gt;Understands complexity of training data, confidence scoring and improving NLU models&lt;br&gt;&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;EEO Employer&lt;br&gt;&lt;br&gt;Apex Systems is an equal opportunity employer. We do not discriminate or allow discrimination on the basis of race, color, religion, creed, sex (including pregnancy, childbirth, breastfeeding, or related medical conditions), age, sexual orientation, gender identity, national origin, ancestry, citizenship, genetic information, registered domestic partner status, marital status, disability, status as a crime victim, protected veteran status, political affiliation, union membership, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-02T05:18:00.000Z"
    },
    "company": {
        "name": "Apex Systems",
        "link": "https://www.linkedin.com/company/apex-systems"
    },
    "education": {
        "required_credential": null
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Antonio",
        "region": "TX",
        "postal_code": "78266",
        "street_address": null,
        "latitude": 29.42517,
        "longitude": -98.49461
    }
}