{
    "job": {
        "title": "Remote Senior DevOps Engineer / Site Reliability Engineer",
        "industry": "Information Technology and Services,Computer Software",
        "description": "&lt;strong&gt;Unlimited PTO, every other Fridays off, consistently voted best places to work!&lt;br&gt;&lt;br&gt;&lt;/strong&gt;This Jobot Job is hosted by Amber Heigerick&lt;br&gt;&lt;br&gt;Are you a fit? Easy Apply now by clicking the \"Apply\" button and sending us your resume.&lt;br&gt;&lt;br&gt;Salary $150,000 - $175,000 per year&lt;br&gt;&lt;br&gt;&lt;strong&gt;A Bit About Us&lt;br&gt;&lt;br&gt;&lt;/strong&gt;We are a well established Technology company consistently voted best places to work! Do you want to work with the latest tech stack?&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;br&gt;&lt;br&gt;&lt;strong&gt;Why join us?&lt;br&gt;&lt;br&gt;&lt;br&gt;&lt;/strong&gt;&lt;/strong&gt;We believe that everyone deserves to thrive at the company they are part of! We treat our employees like our clients, without you we wouldn't have a company! We give our employees unlimited PTO, flexible work hours, and every other Fridays off. These are just some of our perks. We have very low turn-over, because we have happy employees. We like to promote from with in whenever possible and 90% of the time, are able to do that. Come join a company that you can learn, grow, have fun, and create memories and experiences that will last a lifetime!&lt;br&gt;&lt;br&gt;&lt;strong&gt;Job Details&lt;br&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;You will be a key member of our fast-growing and high-performing team that keeps our production environments stable, as well as creates tooling to enable our internal customers. &lt;/li&gt;&lt;li&gt;Build software releases and testing new code; as an automation expert using tools that automate the development, testing and integration of software releases/fixes&lt;/li&gt;&lt;li&gt;Ensure each and every release is stable and; as a security officer, continually monitoring our product's health and security after update deployment.&lt;/li&gt;&lt;li&gt;Design, develop, and implement software that defines and evolves our infrastructure.&lt;/li&gt;&lt;li&gt;Troubleshoot production issues and coordinate with the development team to streamline code deployment.&lt;/li&gt;&lt;li&gt;Implement automation tools and frameworks (CI/CD pipelines).&lt;/li&gt;&lt;li&gt;Analyze code and communicate detailed reviews to development teams to ensure a marked improvement in applications and the timely completion of projects.&lt;/li&gt;&lt;li&gt;Collaborate with team members to improve the company's engineering tools, systems and procedures, and data security.&lt;/li&gt;&lt;li&gt;Optimize the company's computing architecture.&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;You should know the following&lt;br&gt;&lt;ul&gt;&lt;li&gt;Mid-Level Experience in DevOps Engineering&lt;/li&gt;&lt;li&gt;Knowledge on Source Control Tools such as GIT, and GitHub&lt;/li&gt;&lt;li&gt;Experience with with Infrastructure-as-code concepts and tools, such as Terraform.&lt;/li&gt;&lt;li&gt;Experience with Continuous Integration (CI) tools such as Jenkins/Bamboo, source control systems such as Bitbucket/Git.&lt;/li&gt;&lt;li&gt;Must be proficient in one or more scripting languages Unix Shell, Perl, Python.&lt;/li&gt;&lt;li&gt;Experience in a production environment with AWS or GCP.&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;Interested in hearing more? Easy Apply now by clicking the \"Apply\" button.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-03T00:00:00.000Z"
    },
    "company": {
        "name": "Jobot",
        "link": "https://www.linkedin.com/company/jobot"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Charlotte",
        "region": "NC",
        "postal_code": "28241",
        "street_address": null,
        "latitude": 35.223785,
        "longitude": -80.84114
    }
}