{
    "job": {
        "title": "Sr. Security Engineer",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Dice is the leading career destination for tech experts at every stage of their careers. Our client, Fuse3 Solutions, is seeking the following. Apply via Dice today!&lt;br&gt;&lt;br&gt;One of our best and favorite clients is growing!!!! They are looking to build out their already solid infrastructure team. They are looking to add a talented Security Engineer to this great team! This company offers amazing culture, work-life balance, incredible benefits, bonus, and other incentives! GREAT leadership as well! They are looking for \"hands-on\" and deep technical knowledge. A true Cyber Security guru who wants to do interesting work and get hisher hands dirty! Essential Responsibilities of the Security Engineer Evaluating existing systems and providing technical direction to the organization Responsible for maintaining and managing existing security systems and procedures Responsible for establishing processes for the configuration, testing, and maintaining operating systems, application software, and security management tool Advising other divisions on security issues and resolutions Responsible for applying a security frameworks Monitoring compliance with internal and external security and data protection Performing complex tasks on critical security projects and infrastructure enhancements. Designing, implementation, and monitoring of network activities, devices, uptime, on all security platforms. Key Qualifications of NetworkCyber Security Engineer Bachelor's Degree or 4+ Years Equivalent Experience CISSP, CISM, CISA, or similar 4+ Years Experience Security frameworks Internet and network services IT operations User access and authentication Security within software applications Advanced leadership of security technologies experience necessary Hands on Salary 70k +- Depending on Experience plus solid bonus",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-18T22:04:08.000Z"
    },
    "company": {
        "name": "Dice",
        "link": "https://www.linkedin.com/company/dice"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Oklahoma City",
        "region": "OK",
        "postal_code": "73118",
        "street_address": null,
        "latitude": 35.468494,
        "longitude": -97.52126
    }
}