{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "Information Technology and Services,Computer Networking,Computer Software",
        "description": "&lt;ul&gt;&lt;li&gt;Responsible for maintaining and scaling production services and servers across multiple data centers and regional public clouds for complex and data-intensive cloud services&lt;/li&gt;&lt;li&gt;Improve scalability, service reliability, capacity, and performance&lt;/li&gt;&lt;li&gt;Write automation code for provisioning and operating infrastructure at massive scale, you are not an operator, you’re an experienced software engineer focused on operations.&lt;/li&gt;&lt;li&gt;Work with development teams to make sure the applications fit nicely within the infrastructure and scalability/reliability is designed and implemented from the grounds up&lt;/li&gt;&lt;li&gt;Participate in the occasional on-call rotation supporting the infrastructure.&lt;/li&gt;&lt;li&gt;You will roll up the sleeves to troubleshoot incidents, formulate theories and test your hypothesis, and narrow down possibilities to find the root cause.&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;Skills &lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Strong development/automation skills.&lt;/li&gt;&lt;li&gt;Must be very comfortable with reading and writing Python code. Java is a plus.&lt;/li&gt;&lt;li&gt;3+ years of Unix/Linux experience, with some experience in managing 100+ nodes.&lt;/li&gt;&lt;li&gt;Tools-first mindset.&lt;/li&gt;&lt;li&gt;Experience with public cloud GCP/AWS/Azure.&lt;/li&gt;&lt;li&gt;Experience with Configuration Management and CI/CD. Salt and Ansible preferred.&lt;/li&gt;&lt;li&gt;Familiar with web servers (Nginx preferred) and HA Proxy.&lt;/li&gt;&lt;li&gt;Preferred experience: Hadoop, Kafka, RabbitMQ, Spark, HBase, Elastic Search, Containers, OpenStack. Organized, focused on building, improving, resolving and delivering. &lt;/li&gt;&lt;li&gt;Good communicator in and across teams, taking the lead&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;At HCL, we don’t just accept the differences—we support it and celebrate it. We are committed to cultivating and preserving a culture of inclusion and connectedness. We are able to grow and learn better together with a diverse team of employees. As an equal opportunity employer, we stay true to our mission by ensuring that our place can be anyone’s place.&lt;/p&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-26T14:52:17.000Z"
    },
    "company": {
        "name": "HCL Technologies",
        "link": "https://in.linkedin.com/company/hcl-technologies"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Santa Clara",
        "region": "CA",
        "postal_code": "95050",
        "street_address": null,
        "latitude": 37.352394,
        "longitude": -121.95308
    }
}