{
    "job": {
        "title": "Software Engineers (Java, C++ or JavaScript) - All Levels with Security Clearance",
        "industry": "Information Technology and Services,Defense &amp; Space,Computer Software",
        "description": "We are looking for multiple Software Engineers (at all levels!) to assist in developing a next generation, cutting-edge, extensible framework for Mission Management, Command &amp;amp; Telemetry, and Flight Dynamics. Our clients' complex domain requires innovative solutions to meet evolving customer needs. On this program, you will work with teams of engineers to develop and improve advanced algorithms that handle large data sets with complex constraints. You will gain experience with the full software lifecycle including design, development, test, delivery, and maintenance. In addition to working with other software disciplines, our developers are exposed to various technologies including multi-tiered architectures, Amazon Web Services, and geospatial visualization tools. Our program follows modern Agile/DevOps development practices and utilizing an agile framework - experience in this area is a plus. We provide robust and easy-to-use tools for reporting status and estimates to your agile team leadership - meaning more time for true problem solving. Our small agile teams adapt to evolving problem sets, and engineers benefit from a flexible work environment where engineers can migrate between teams to contribute to new domains. Required Skills:&lt;br&gt;&lt;ul&gt;&lt;li&gt;Active TS/SCI Security Clearance&lt;/li&gt;&lt;li&gt;2+ years of Java/C++ programming experience&lt;/li&gt;&lt;li&gt;2+ years of SW development experience using object-oriented techniques&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-23T06:25:37.000Z"
    },
    "company": {
        "name": "ClearanceJobs",
        "link": "https://www.linkedin.com/company/clearancejobs.com"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Aurora",
        "region": "CO",
        "postal_code": "80018",
        "street_address": null,
        "latitude": 39.712933,
        "longitude": -104.81936
    }
}