{
    "job": {
        "title": "Software Engineer I",
        "industry": "Marketing and Advertising,Automotive,Financial Services",
        "description": "Who we are&lt;br&gt;Collaborative. Respectful. A place to dream and do. These are just a few words that describe what life is like at Toyota. As one of the world’s most admired brands, Toyota is growing and leading the future of mobility through innovative, high-quality solutions designed to enhance lives and delight those we serve. We’re looking for diverse, talented team members who want to Dream. Do. Grow. with us.&lt;br&gt;Who we’re looking for&lt;br&gt;This person will support the CPO Manage the entire product life cycle from strategic to tactical planning and execution to improve system quality by identifying issues and common patterns and developing standard operating procedures.&lt;br&gt;What you’ll be doing&lt;br&gt;• Enhance applications by identifying opportunities for improvement, making recommendations, and designing and implementing systems.&lt;br&gt; • Maintain and improve existing codebases for the NA and Global market. Liaison with colleagues to implement technical designs.&lt;br&gt; • Support the CPO to deliver consistent and relevant user experiences by developing a common global platform across all Toyota affiliate regions. Utilize Toyota’s server and application platform to enable connected services within each affiliate region.&lt;br&gt; • Creation and execution of evaluation requirement documents, test cases, and test scripts.&lt;br&gt; • Research and identify new opportunities for CT to innovate and improve customer satisfaction.&lt;br&gt; • Identify product development dependencies and integration points.&lt;br&gt; • Provide up-to-date development status.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T19:39:40.000Z"
    },
    "company": {
        "name": "Toyota North America",
        "link": "https://www.linkedin.com/company/toyota-north-america"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Plano",
        "region": "TX",
        "postal_code": "75093",
        "street_address": null,
        "latitude": 33.019695,
        "longitude": -96.697586
    }
}