{
    "job": {
        "title": "AI/ML - Software Engineer, Speech, Siri Understanding",
        "industry": "Consumer Electronics",
        "description": "&lt;br&gt;&lt;strong&gt;Summary&lt;br&gt;&lt;/strong&gt; &lt;br&gt;Play a part in the next revolution in human-computer interaction. Contribute to a product that is redefining mobile computing. Create groundbreaking technology for large scale systems, spoken language, and artificial intelligence. And work with the people who built the intelligent assistant that helps millions of people get things done — just by asking. Join the Siri Machine Hearing team at Apple.&lt;br&gt;&lt;br&gt;&lt;br&gt;Siri’s Machine Hearing Product team is looking for resourceful software engineer to develop Siri’s next generation of natural interaction platforms on Apple’s innovative devices. You should be eager to do hands-on work to improve and build features to help improve overall Siri capabilities. You should enjoy working in a rapidly changing environment with changing priorities, be passionate about using new technologies to solve real problems and to improve the state of intelligent assistants.&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Key Qualifications&lt;br&gt;&lt;/strong&gt; &lt;br&gt;Strong object oriented programming skills (C/C++/ObjC).&lt;br&gt;&lt;br&gt;Solid understanding and experience working on software frameworks and optimizations.&lt;br&gt;&lt;br&gt;Interest and demonstrated ability in prototyping and developing on-device software.&lt;br&gt;&lt;br&gt;Outstanding communication and collaboration skills with cross functional teams.&lt;br&gt;&lt;br&gt;Passionate about delivering great user experience and have great attention to detail.&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Description&lt;br&gt;&lt;/strong&gt; &lt;br&gt;The Siri Team is looking for someone with a combination of strong programming skills and a creative, user-focused mindset. This role would take Siri to the next level of intelligence and accuracy by using advanced statistical techniques to improve the quality of customer features. This involves working on core machine learning algorithms and systems that are part of Siri's ability to understand and respond to requests. You should be able to thrive in a fast-paced environment with rapidly-changing priorities and technology stacks. A thirst for designing new technology with a user-first mindset is essential.&lt;br&gt;&lt;br&gt;&lt;br&gt;Specific responsibilities include:&lt;br&gt;&lt;br&gt;- Develop Siri features end-to-end, including proactively collaborating with XF teams as needed for progression.&lt;br&gt;&lt;br&gt;- Work with multiple teams across the organization to gain a deep understanding of the Siri architecture.&lt;br&gt;&lt;br&gt;- Develop systems that are highly reliable, scalable, but surprisingly easy to maintain.&lt;br&gt;&lt;br&gt;- Be actively involved in collaborating on product direction, giving feedback in the right way to the team, and bringing new issues up in a safe way for team discussion.&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Education &amp;amp; Experience&lt;br&gt;&lt;/strong&gt; &lt;br&gt;B.S. or M.S. degree in Computer Science, or equivalent experience&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Additional Requirements&lt;br&gt;&lt;/strong&gt; &lt;br&gt;Software development experience with voice assistant systems, preferred.&lt;br&gt;&lt;br&gt; &lt;br&gt;Role Number: 200224188&lt;br&gt;&lt;br&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-23T06:33:25.000Z"
    },
    "company": {
        "name": "Apple",
        "link": "https://www.linkedin.com/company/apple"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Seattle",
        "region": "WA",
        "postal_code": "98133",
        "street_address": null,
        "latitude": 47.60323,
        "longitude": -122.33028
    }
}