{
    "job": {
        "title": "Machine learning Engineer",
        "industry": "Marketing and Advertising,Computer Software,Internet",
        "description": "The Opportunity XAI.bio aspires to create the future of drug discovery and development. We’re looking to recruit a Machine Learning Engineer who will help build our technology platform to engineer medicines. Working in an interdisciplinary team of scientists and engineers, you will take the lead in developing a groundbreaking machine learning environment and in designing algorithms to tackle biological complexity. You have the opportunity to become an integral part of our foundational team and to influence the Company’s future development. Competitive salary and benefits apply. Salary- £40,000 to £50,000 pa, depending on skills and experience. To apply, please submit your CV and cover letter. The deadline for applications is Friday 9 July 2021. Minimum Qualifications&lt;br&gt;&lt;br&gt;Bachelors, Masters or PhD in a technical field or equivalent practical experience&lt;br&gt;&lt;br&gt;Extensive knowledge of ML developer environments (e.g. TensorFlow, PyTorch), ML methods, libraries, data structures, data modelling, and software architecture&lt;br&gt;&lt;br&gt;Experience in general purpose programming languages, including C/C++ and Python&lt;br&gt;&lt;br&gt;Experience in developing software pipelines, applications, or packages/libraries. Preferred Qualifications&lt;br&gt;&lt;br&gt;PhD in a field such as computer science, computational neuroscience or physics&lt;br&gt;&lt;br&gt;Post-doctoral research experience and a proven track record of publications&lt;br&gt;&lt;br&gt;Experience as an ML engineer and in deep learning&lt;br&gt;&lt;br&gt;Experience coding in Julia&lt;br&gt;&lt;br&gt;Self-directed, independent, and highly motivated, able to learn new concepts quickly, comfortable in a fast-paced environment&lt;br&gt;&lt;br&gt;Broad knowledge of scientific disciplines related to drug discovery and development&lt;br&gt;&lt;br&gt;Familiarity with computational neuroscience&lt;br&gt;&lt;br&gt;A passion for AI.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-05T00:00:00.000Z"
    },
    "company": {
        "name": "UK Startup Jobs",
        "link": "https://uk.linkedin.com/company/uk-startup-jobs"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Oxford",
        "region": "NC",
        "postal_code": "27565",
        "street_address": null,
        "latitude": 36.31321,
        "longitude": -78.590164
    }
}