{
    "job": {
        "title": "Machine Learning Engineer-Photos",
        "industry": "Consumer Electronics",
        "description": "&lt;br&gt;&lt;strong&gt;Summary&lt;br&gt;&lt;/strong&gt; &lt;br&gt;Do you have a passion for building the best photo library in the world?&lt;br&gt;&lt;br&gt;&lt;br&gt;iPhone is the most popular camera in the world. Detailed integration of software and hardware has delivered magical experiences like Photos Memories and Portrait Mode. The Camera &amp;amp; Photos team creates privacy-respecting machine learning technologies to ship emotional experiences to hundreds of millions of users worldwide.&lt;br&gt;&lt;br&gt;&lt;br&gt;We are looking for an outstanding machine learning engineer to develop state-of-the-art algorithms and infrastructure for the next generation of thoughtful and personal products we deliver. If you thrive at the intersection of algorithms, applied machine learning and graphs this position will excite and inspire you.&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Key Qualifications&lt;br&gt;&lt;/strong&gt; &lt;br&gt;Demonstrated expertise machine learning related to graphs or ranking/recommendation systems&lt;br&gt;&lt;br&gt;Exceptional problem-solving and interpersonal skills&lt;br&gt;&lt;br&gt;Knowledge of data structures, algorithms, and object-oriented programming&lt;br&gt;&lt;br&gt;Good programming skills in Python&lt;br&gt;&lt;br&gt;Hands-on experience working with deep learning toolkits such as Tensorflow, PyTorch, or Keras.&lt;br&gt;&lt;br&gt;Proven experience or education in linear algebra statistics (graph theory, Bayesian statistics desirable)&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Description&lt;br&gt;&lt;/strong&gt; &lt;br&gt;In this role you will ideate, prototype and develop new ways of using (knowledge) graphs to power machine learning algorithms for a suite of learning problems, including clustering, ranking and classification.&lt;br&gt;&lt;br&gt;&lt;br&gt;Candidates should have a proven track record that demonstrates academic aptitude, strong collaboration, excellent communication skills and a passion for designing high quality algorithms with the user experience in focus.&lt;br&gt;&lt;br&gt;&lt;br&gt;The candidate needs to show initiative, take ownership of a problem and work cross-functionally to collect information, solve problems and disseminate findings.&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Education &amp;amp; Experience&lt;br&gt;&lt;/strong&gt; &lt;br&gt;M.S / PhD in Computer Science or equivalent experience&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Additional Requirements&lt;br&gt;&lt;/strong&gt; &lt;br&gt;Performing quality assurance and testing of the developed routines and applications&lt;br&gt;&lt;br&gt;Prototyping, designing, developing, and shipping new personalized experiences.&lt;br&gt;&lt;br&gt;Working multi-functionally to connect knowledge across the platform and create intelligent customer-facing features.&lt;br&gt;&lt;br&gt; &lt;br&gt;Role Number: 200273865&lt;br&gt;&lt;br&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-17T05:12:28.000Z"
    },
    "company": {
        "name": "Apple",
        "link": "https://www.linkedin.com/company/apple"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Cupertino",
        "region": "CA",
        "postal_code": "95014",
        "street_address": null,
        "latitude": 37.319313,
        "longitude": -122.02927
    }
}