{
    "job": {
        "title": "Software Engineer",
        "industry": "Consumer Electronics",
        "description": "&lt;br&gt;&lt;strong&gt;Summary&lt;br&gt;&lt;/strong&gt; &lt;br&gt;The Apple Cloud Infrastructure (ACI) team builds and provides systems that power many of Apple’s customer facing services (like iCloud, iTunes, Siri, Maps). We provide infrastructure primitives that enable teams across Apple to build services that our customers love.&lt;br&gt;&lt;br&gt;&lt;br&gt;Our team is building a low latency distributed storage block storage system, which will be made available to workloads running on ACI’s private-cloud infrastructure. As a general purpose “disk” service, we need to support workloads ranging from databases and ML/analytics frameworks to orchestration of large scale containerized and virtualized jobs.&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Key Qualifications&lt;br&gt;&lt;/strong&gt; &lt;br&gt;Problem solving skills using foundational data structures and distributed system concepts&lt;br&gt;&lt;br&gt;Coding skills in languages like Rust, C++, C, Go, Java or C# &lt;br&gt;&lt;br&gt;2 - 15+ years of professional software development experience&lt;br&gt;&lt;br&gt;Strong ownership and track record of delivering results&lt;br&gt;&lt;br&gt;Excellent verbal and written communication skills&lt;br&gt;&lt;br&gt;Preferred: Proficiency in Rust&lt;br&gt;&lt;br&gt;Preferred: Experience in the bottom layers of the storage software stack (Filesystem, Block Device, SSD)&lt;br&gt;&lt;br&gt;Preferred: Experience with high-performance asynchronous IO systems programming&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Description&lt;br&gt;&lt;/strong&gt; &lt;br&gt;Engineers on this team will have the rare opportunity to work on storage device optimized low-level storage, large-scale distributed systems, and high performance IO stacks operating at mission critical levels of availability and durability. Each component is being built using first principles from the ground up in order to unlock optimization opportunities at every layer of the stack.&lt;br&gt;&lt;br&gt;&lt;br&gt;We are looking for collaborative, curious and pragmatic Software Engineers to be part of this innovative team. You will have the opportunity to shape the product’s features and its architecture as it scales orders of magnitude. Being a part of Apple’s Cloud Infrastructure organization opens the door to exert cross-functional influence and make larger organizational impact.&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Education &amp;amp; Experience&lt;br&gt;&lt;/strong&gt; &lt;br&gt;BS/MS in Computer Science or Equivalent work experience.&lt;br&gt;&lt;br&gt; &lt;br&gt;Role Number: 200275619&lt;br&gt;&lt;br&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-30T15:02:55.000Z"
    },
    "company": {
        "name": "Apple",
        "link": "https://www.linkedin.com/company/apple"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Seattle",
        "region": "WA",
        "postal_code": "98133",
        "street_address": null,
        "latitude": 47.60323,
        "longitude": -122.33028
    }
}