{
    "job": {
        "title": "Site Reliability Engineer / SRE",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Dice is the leading career destination for tech experts at every stage of their careers. Our client, iTech Solutions, is seeking the following. Apply via Dice today!&lt;br&gt;&lt;br&gt;Site Reliability Engineer Duties We are looking for a Site Reliability Engineer (SRE) who is passionate around solving business problems through innovation and engineering practices. The SRE would serve as the bridge between our operations members and service delivery members. The individual will be embedded in the operations team and enable the SRE community of practice by helping to bridge the needs and technologies of both teams while enabling the operations members to streamline and automate the repetitive and manual activities. The application environment is a blend between on premise cloud. The role requires a wide variety of strengths and capabilities, including 5+ years of experience in Developer, Operations roles Knowledge of application, data and infrastructure architecture dislines Working proficiency in development and monitoring tools Ability to work in large, collaborative teams to achieve organization goals A mindset focused on reliability, uptime and the customer experience 4+ years of SRE experience 3+ years of public cloud experience Willing to work on a distributed team spanning multiple time zones. Analytical and problem-solving skills Good communication skills The desire to continually learn and test your own boundaries Exposure to standard software development practices including agile, deployment pipelines, continuous integrations and continuous delivery Understanding of software skills such as business analysis, development, maintenance and software improvements Qualifications Experience with monitoring and observability systems like Dynatrace, CA APM, Splunk etc. Experience in one or more programming languages Python, Java, Scala, PySpark Experience with build and deployment pipeline technologies like Jenkins, Cloudbees, Terraform, Urban Code Deploy, Ansible, Maven, GitHub Experience working with relational databases or HDFS or cloud storage Hands on experiences in AWS technologies - Cloud Watch, Step Functions, Lambda, Glue, EC2, Redshift, DynamoDB, SQS, ECSEKS, Elastic Search, SnowFlake, Elastic Cache, databricks, to name a few Exposure to containerization - Docker and Kubernetes Experiences with additional enterprise technologies OpenShift, Kafka, Redhat, DataBricks The primary responsibilities include Monitoring, Alerting and Communication Manage and monitor production systems Application Availability performance issues Data and Integration issues Stakeholder communication Incident Management and root cause analysis Facilitate the incident management Guide the team on root cause analysis Manage performance metrics Work with stakeholders to identify define the service level indicators and objectives Measure and report the performance metrics. Automation and tools Work with the service delivery teams in developing and testing automation of repetitive and manual efforts. Work closely with engineering teams on monitoring and performance management tools initiatives to improve system reliability and performance. Team building Help teams transition to SRE mind set Help with SRE adoption across teams For more information please contact Karen Schur ator Since 1995, iTech Solutions Inc., has been providing IT Consulting and Direct Hire Services to the Insurance, Financial, Communications, Manufacturing and Government sectors with local offices in Connecticut, Minnesota, Colorado, Massachusetts, Tennessee, North Carolina, and New Jersey Pennsylvania area. Our recruiting strategy is simple, if you want to find qualified IT professionals then use IT professionals to find them. So at iTech Solutions, our personnel are all career IT professionals with a wide range of IT experience. We can honestly say our staff understands the technologies, the complexities of finding and selecting the appropriate personnel and the pressures of running successful IT projects. Employer will not sponsor applicants for any employment visas, at hiring or in the future, including but not limited to H-1B visas. Corp-to-Corp or subcontract personnel will not be considered for this position.",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-12T06:00:31.000Z"
    },
    "company": {
        "name": "Dice",
        "link": "https://www.linkedin.com/company/dice"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Bloomfield",
        "region": "NJ",
        "postal_code": "07003",
        "street_address": null,
        "latitude": 40.809128,
        "longitude": -74.18716
    }
}