{
    "job": {
        "title": "SharePoint Programmer",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Dice is the leading career destination for tech experts at every stage of their careers. Our client, Chandra Technologies, Inc., is seeking the following. Apply via Dice today!&lt;br&gt;&lt;br&gt;Hourly Rate 58 W2 67 CTC1099 Job Description Projects 1. Migrate BidStamp from on prem to online 2. Will be included in part of the BidStamp 2.0 project Required Skills SPFX (SharePoint Framework) (tools Yeoman templates, Gulp-based Build Process, NodeJSNPM, Webpack, TypeScript etc.) 2. SharePoint Designer, and PowerShell 2. Extensive knowledge of C, and .NET 5. JavaScript, SQL, XML, jQuery and REST API. (5 years) Experience SharePoint online experience, .Net, C Javascript, migration from on prem to online, developing custom modules using SharePoint object model and .Net 4.04.5, developing SharePoint Add-ins on Office 365SharePoint Online (5 years) Experience Migrating SharePoint Provider-Hosted App from SharePoint On-Premise to Office 365SharePoint Online (5 years) Experience Includes a specific focus on Portal, Enterprise Integration and Architecture on SharePoint 2013 On-Premise and Office 365SharePoint Online (5 years) SharePoint Programmer .NET, JavaScript, SQL, SML, PowerShell, SharePoint Designer Higher Competitive Rates will be considered for consultants with advanced skill set Corp to Corp Resumes are welcome Consultants may need a criminal background check",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-18T22:04:31.000Z"
    },
    "company": {
        "name": "Dice",
        "link": "https://www.linkedin.com/company/dice"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Austin",
        "region": "TX",
        "postal_code": "78746",
        "street_address": null,
        "latitude": 30.264978,
        "longitude": -97.7466
    }
}