{
    "job": {
        "title": "Software Development Engineer III - Android",
        "industry": "Financial Services",
        "description": "Mobile Developer: Android&lt;br&gt; &lt;br&gt;LOCATION:&lt;br&gt;Berkley Heights, NJ&lt;br&gt; &lt;br&gt;Primary Requirement:&lt;br&gt; &lt;br&gt;&lt;ul&gt;&lt;li&gt;&lt;strong&gt;W2 only&lt;/strong&gt;&lt;/li&gt;&lt;li&gt;Minimum 5 years hands-on software development experience, including 3 years writing native Android mobile.&lt;/li&gt;&lt;li&gt;Experience must include experience within past 3 years&lt;/li&gt;&lt;/ul&gt; &lt;br&gt;Role Purpose and Context:&lt;br&gt; &lt;br&gt;The Product Development team is responsible for building and maintaining software for mobile banking. Building and maintaining our products includes development of new features and enhancements, maintenance and support of existing features, technical design and documentation, integration, deployment and testing.&lt;br&gt;As a Software Developer in the Product Development organization, you will contribute to all aspects of project delivery with specific focus on the development of new features and enhancements to our products.&lt;br&gt;Key Relationships&lt;br&gt;This position is part of a team of Developers, Business Analysts and Quality Analysts. The team receives leadership and guidance from Managers, Technical Leads, Team Leads, Scrum Masters and Product Delivery Managers.&lt;br&gt; &lt;br&gt;Additional Skills:&lt;br&gt; &lt;br&gt;&lt;ul&gt;&lt;li&gt;Software development qualifications preferred.&lt;/li&gt;&lt;li&gt;An advanced understanding of common computer programming algorithms.&lt;/li&gt;&lt;li&gt;An advanced understanding of object orientated design principles.&lt;/li&gt;&lt;li&gt;A solid understanding of software development patterns and their application in several programming languages.&lt;/li&gt;&lt;li&gt;An advanced understanding of coding techniques which contribute to the reliability, maintainability, readability, simplicity, performance, and testability of software.&lt;/li&gt;&lt;li&gt;A solid understanding of IT environments including networking, server technologies, databases, security and performance.&lt;/li&gt;&lt;li&gt;Proficient in the day-to-day practicalities of Agile software development methodologies such as Kanban, Scrum, or the XP.&lt;/li&gt;&lt;li&gt;Tertiary qualification in Information Technology or Computer Sciences or relevant work experience.&lt;/li&gt;&lt;/ul&gt;",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-07-14T17:20:43.000Z"
    },
    "company": {
        "name": "Matlen Silver",
        "link": "https://www.linkedin.com/company/matlen-silver"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Berkley Heights",
        "region": "OH",
        "postal_code": "43334",
        "street_address": null,
        "latitude": 39.708393,
        "longitude": -84.19994
    }
}