{
    "job": {
        "title": "Software Engineer I - Tiger Institute",
        "industry": "Information Technology and Services,Computer Software,Hospital &amp; Health Care",
        "description": "As a Software Engineer onsite at the Tiger Institute, you will be assigned to a specific research focus wherein you will be involved in writing and configuring code to meet user interface specifications for new and upgraded solutions. In this role, you will be participating in the full development life cycle of software solutions including defining the needs of the client, providing input for functional designing, testing, troubleshooting, and documenting. You will also implement designs by utilizing development languages and tools as per design specifications, routine review of solutions, suggest aesthetic improvements, and participate in project-related sessions such as code reviews and project status meetings. Additionally, you will be at the forefront of technology migration, rolling out cutting-edge tools to the larger developer community, and involved in the new generation Continuous Integration Framework for an enterprise solution. &lt;strong&gt;Qualifications&lt;/strong&gt; &lt;strong&gt;Basic Qualifications :&lt;br&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt; At least 4 years total combined higher education and related work experience including:&lt;/li&gt;&lt;ul&gt;&lt;li&gt; Bachelor’s Degree in Computer Science, Computer Engineering, Software Engineering, Computer Information Systems, Information Technology, or Information Systems, or related field; or equivalent work experience &lt;/li&gt;&lt;/ul&gt;&lt;/ul&gt; &lt;strong&gt;Preferred Qualifications :&lt;br&gt;&lt;br&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt; Experience in full-stack web development with an emphasis in CSS, JavaScript, HTML, Python and/or Ruby &lt;/li&gt;&lt;li&gt; Familiarity with Oracle, SQL Server &lt;/li&gt;&lt;li&gt; Knowledge in Java and OOP design &lt;/li&gt;&lt;li&gt; Experience or basic understanding of agile development &lt;/li&gt;&lt;/ul&gt; &lt;strong&gt;Expectations :&lt;br&gt;&lt;br&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt; Must live in or around the Columbia, Missouri area &lt;/li&gt;&lt;li&gt; Willing to work additional or irregular hours as needed and allowed by local regulations &lt;/li&gt;&lt;li&gt; Work in accordance with corporate and organizational security policies and procedures, understand personal role in safeguarding corporate and client assets, and take appropriate action to prevent and report any compromises of security within scope of position &lt;/li&gt;&lt;li&gt; Perform other responsibilities as assigned&lt;/li&gt;&lt;/ul&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T23:20:21.000Z"
    },
    "company": {
        "name": "Cerner Corporation",
        "link": "https://www.linkedin.com/company/cerner-corporation"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Columbia",
        "region": "MO",
        "postal_code": "65201",
        "street_address": null,
        "latitude": 38.95155,
        "longitude": -92.32859
    }
}