{
    "job": {
        "title": "Software Engineer I",
        "industry": "Marketing and Advertising,Internet,Retail",
        "description": "Zulily is a retailer obsessed with bringing our customers something special every day. Unique products from up-and-coming brands are featured alongside favorites from top brands, including clothing, home decor, accessories, toys and gifts, giving customers something new to discover each morning at an incredible price. We are fast-paced, innovative and metric-driven, with a team passionate for delighting our customers. Whether you want to work with incredible product selection, develop smart marketing plans, help us in our pursuit of faster fulfillment, or do something else awesome in between, we have a place for you. With locations in Seattle, Reno, Columbus and Bethlehem, our team is excited to be changing the way people shop every day - and we are just getting started.&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;Job Description Details&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;Bachelors Degree in Computer Science or related field required. A combination of education plus equivalent work experience may be considered.&lt;/li&gt;&lt;li&gt;1-2 years programming experience &lt;/li&gt;&lt;li&gt;Ability to think system wide and translate business requirements into code&lt;/li&gt;&lt;li&gt;Ability to explore new ideas and have a passion to make them happen&lt;/li&gt;&lt;li&gt;Ability to work in a fast paced, evolving, growing and dynamic environment&lt;/li&gt;&lt;li&gt;Strong communication and relationship building skills&lt;/li&gt;&lt;li&gt; Experience in coding in modern programming languages such as Java, GoLang, Python, C#, and/or NodeJS &lt;/li&gt;&lt;li&gt; Education: Bachelor’s Degree in Computer Science or related field or equivalent experience&lt;/li&gt;&lt;/ul&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-27T20:02:03.000Z"
    },
    "company": {
        "name": "Zulily",
        "link": "https://www.linkedin.com/company/zulily"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Seattle",
        "region": "WA",
        "postal_code": "98133",
        "street_address": null,
        "latitude": 47.60323,
        "longitude": -122.33028
    }
}