{
    "job": {
        "title": "Software Engineer Manager",
        "industry": "Information Technology and Services,Management Consulting",
        "description": "Cognizant is seeking Software Engineer Manager for the Healthcare Industry&lt;br&gt;&lt;br&gt;Location: Teaneck, NJ&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;Job Description&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;Temp Remote Allowed. \"Skills- .NET, Angular, GRPC/WCF(SOA),ENTITY FRAMEWORK,SQL,HTML,CSSHands on leading by examples and contributing to software.&lt;br&gt;&lt;ul&gt;&lt;li&gt; Assist in maintenances and upgrades of existing software applications.&lt;/li&gt;&lt;li&gt; Participate in Design reviews and recommend improvements.&lt;/li&gt;&lt;li&gt; Provide support in all phases of SDLC and ensure to deliver high-quality products. - Provide trainings and mentor other Engineers when required.&lt;/li&gt;&lt;li&gt; Analyze and troubleshoot application issues in a timely fashion.&lt;/li&gt;&lt;li&gt; Develop most effective technical solutions to meet business requirements.&lt;/li&gt;&lt;li&gt; Work with other as part of Scrum Team, planning, prioritizing and executing assigned tasks within deadlines.&lt;/li&gt;&lt;li&gt; Attend Team meetings to communicate technical project status and discuss about new ideas and any issues.&lt;/li&gt;&lt;li&gt; ensure quality and productivity while working.&lt;/li&gt;&lt;li&gt; Work with QA Team in preparing test cases, plans and procedures.\"&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;Employee Status : Full Time Employee&lt;br&gt;&lt;br&gt;Shift : Day Job&lt;br&gt;&lt;br&gt;Travel : No&lt;br&gt;&lt;br&gt;Job Posting : Aug 16 2021&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;About Cognizant&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;Cognizant (Nasdaq-100: CTSH) is one of the world's leading professional services companies, transforming clients' business, operating and technology models for the digital era. Our unique industry-based, consultative approach helps clients envision, build and run more innovative and efficient businesses. Headquartered in the U.S., Cognizant is ranked 185 on the Fortune 500 and is consistently listed among the most admired companies in the world. Learn how Cognizant helps clients lead with digital at www.cognizant.com or follow us @USJobsCognizant.&lt;br&gt;&lt;br&gt;Applicants may be required to attend interviews in person or by video conference. In addition, candidates may be required to present their current state or government issued ID during each interview.&lt;br&gt;&lt;br&gt;Cognizant is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected Veteran status, age, or any other characteristic protected by law.&lt;br&gt;&lt;br&gt;If you have a disability that requires a reasonable accommodation to search for a job opening or submit an application, please email CareersNA2@cognizant.com with your request and contact information.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T07:12:33.000Z"
    },
    "company": {
        "name": "Cognizant",
        "link": "https://www.linkedin.com/company/cognizant"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Teaneck",
        "region": "NJ",
        "postal_code": "08810",
        "street_address": null,
        "latitude": 40.88482,
        "longitude": -74.00655
    }
}