{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "",
        "description": "Job Title: Machine Learning Support (Fulltime)&lt;br&gt;Location: Washington&lt;br&gt;&lt;br&gt;EXP: 0-5 Years&lt;br&gt;&lt;br&gt;JD: Summary View&lt;br&gt;&lt;br&gt;• Minimum 3 + years’ Experience on programming languages such as C#, Java &amp; C++. &lt;br&gt;• Experienced and fully engaged in Software Development Life Cycle (SDLC).&lt;br&gt;• Design, code and debug applications in various software languages&lt;br&gt;• Experience in a technical role such as software engineer, solutions engineer, or similar. &lt;br&gt;• Knowledge on Code analysis, requirements analysis, software review, identification of code metrics, system risk analysis, software reliability analysis&lt;br&gt;• Good communication skills and ability to articulate tech issues accurately and succinctly in a manner that business users can understand and support.&lt;br&gt;• Azure Knowledge is an added advantage.&lt;br&gt;• Experience in production support and customer interaction&lt;br&gt;• Delivers Professional Services to sound technical, business, and professional standards while ensuring strong customer satisfaction and success. &lt;br&gt;• Provides technical design and construction expertise to Customer implementations and deployments. &lt;br&gt;&lt;br&gt;&lt;br&gt;&lt;br&gt;&lt;br&gt;• Soft Skills&lt;br&gt;o Leadership - handle technically challenging and politically sensitive customer situations&lt;br&gt;o Strong communications skills – Excellent spoken and written English communication skills &lt;br&gt;o Effective, polished interaction with customer to gather information quickly; explain customer responsibilities in resolving issue; communicate next steps and status; and inspire confidence&lt;br&gt;o The successful Support Engineer has the drive and intellectual horsepower to resolve difficult customer issues; directly supports customers through telephone, email, and chat services as applicable&lt;br&gt;o Demonstrable troubleshooting skills&lt;br&gt;o Cross-team collaboration&lt;br&gt;&lt;br&gt;• Azure Cognitive &amp; Machine Learning Skills&lt;br&gt;• Experience on C#, Jave and C++ &lt;br&gt;• Basic knowledge on Windows Azure cloud platform (IaaS and PaaS) and Azure CLI &amp; Azure PaaS, Storage, IaaS, Resource Groups and other services.&lt;br&gt;• Experience in production support and customer interaction &lt;br&gt;• Experience analyzing telemetry and logs &lt;br&gt;• Good debugging skills &lt;br&gt;• Experience in production support and customer interaction &lt;br&gt;• Willingness to learn and adapt&lt;br&gt;&lt;br&gt;• Time of operation: This track will be in 24X7 shift model. Therefore, candidates should be flexible to cover during holidays and weekends to accommodate MS roster&lt;br&gt;&lt;br&gt; &lt;br&gt;Skill Requirement: (list top 3-4 skills):&lt;br&gt;&lt;br&gt;Technical / Soft Skills Expertise Level (Expert / Good / Knowledge)&lt;br&gt;C# and Java Expert&lt;br&gt;C++ Good&lt;br&gt;Communication Skills Expert&lt;br&gt;Azure Good &lt;br&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T14:21:38.000Z"
    },
    "company": {
        "name": "Diamondpick",
        "link": "https://in.linkedin.com/company/diamondpick"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Seattle",
        "region": "WA",
        "postal_code": "98133",
        "street_address": null,
        "latitude": 47.60323,
        "longitude": -122.33028
    }
}