{
    "job": {
        "title": "Sr. Site Reliability Engineer",
        "industry": "Computer Hardware,Computer Software,Computer Networking",
        "description": "Please note this posting is to advertise potential job opportunities. This exact role may not be open today, but could open in the near future. When you apply, a Cisco representative may contact you directly if a relevant position opens.&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;What You'll Do&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt; Actively support and lead the planning, design, implementation and integration of recently released software solutions in customer environments. &lt;/li&gt;&lt;li&gt; Drive solution delivery improvements through automation, testing and best practices implementation to optimize deployments, accelerate customer value-realization and improve overall online service reliability. &lt;/li&gt;&lt;li&gt; Practice SRE delivery principles, including building CI/CD pipelines and measure KPIs via Service Level Indicators (SLIs), Service Level Objectives (SLOs) and Service Level Agreement (SLAs). &lt;/li&gt;&lt;li&gt; Collaborate in transformational initiatives to define and improve new delivery methodologies in accordance with DevOps and SRE models. &lt;/li&gt;&lt;li&gt; Interact with professional services delivery, product management, and BU teams to integrate automation in our offers to improve quality and customer experience. &lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;&lt;u&gt;Who We Are&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;You will be part of the SRE Cross Domain Team in Cisco’s Customer Experience (CX) Technology and Transformation Group for the Americas region. Service Reliability Engineering (SRE) is a discipline that incorporates aspects of software engineering and applies them to infrastructure and operations problems. At Cisco, we practice SRE principles to create scalable and highly reliable software systems and solutions. We focus on fixing reliability problems in our solutions as well as building tools and systems that will contribute to the reliability of the systems that it supports.&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;Minimum Qualifications&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt; 10+ years’ experience after a B.S or M.S in Computer Science, Electrical Engineering, or a related field. &lt;/li&gt;&lt;li&gt; 2+ years of hands on SRE experience. &lt;/li&gt;&lt;li&gt; Ability to define good SLI, SLO and error budget to maintain reliability of any system wile utilizingtools such as AppDynamics, ThousandEyes, Prometheus, Grafana, DataDog. &lt;/li&gt;&lt;li&gt; Subject matter expertise in software development (Docker, OpenStack, Kubernetes), programmability (Python, Java, Angular, Django) , automation (Ansible, Terraform) and DevOps related tools (Git, Jenkins). &lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;&lt;strong&gt;Why Cisco&lt;br&gt;&lt;br&gt;&lt;/strong&gt;&lt;/strong&gt;At Cisco, each person brings their unique talents to work as a team and make a difference.&lt;br&gt;&lt;br&gt;Yes, our technology changes the way the world works, lives, plays and learns, but our edge comes from our people. We connect everything – people, process, data and things – and we use those connections to change our world for the better.&lt;br&gt;&lt;br&gt;We innovate everywhere - From launching a new era of networking that adapts, learns and protects, to building Cisco Services that accelerate businesses and business results. Our technology powers entertainment, retail, healthcare, education and more – from Smart Cities to your everyday devices.&lt;br&gt;&lt;br&gt;We benefit everyone - We do all of this while striving for a culture that empowers every person to be the difference, at work and in our communities.&lt;br&gt;&lt;br&gt;Colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? T",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-13T05:25:19.000Z"
    },
    "company": {
        "name": "Cisco",
        "link": "https://www.linkedin.com/company/cisco"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 120,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Raleigh",
        "region": "NC",
        "postal_code": "27699",
        "street_address": null,
        "latitude": 35.781303,
        "longitude": -78.64168
    }
}