{
    "job": {
        "title": "Data Scientist, Health Strategic Initiatives",
        "industry": "Consumer Electronics",
        "description": "&lt;br&gt;&lt;strong&gt;Summary&lt;br&gt;&lt;/strong&gt; &lt;br&gt;Have you ever wanted to work on something that really matters? Is it important to you to help others live longer, more fulfilling lives? The Health Strategic Initiatives team is focused on just that — enabling individuals to live a healthier, happier life through personalized and compelling products. We are an experienced team of business leaders, doctors, designers, PMs, engineers, and data scientists. We work in a collaborative and dynamic environment where we push ourselves to redefine the industry and create delightful user experiences.&lt;br&gt;&lt;br&gt;&lt;br&gt;Data is central to the success of our team — data insights drive feature development and design as well as defining future strategy and products.&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Key Qualifications&lt;br&gt;&lt;/strong&gt; &lt;br&gt;5+ years as an analyst or data scientist&lt;br&gt;&lt;br&gt;Expertise working in Spark, SQL, Python or R&lt;br&gt;&lt;br&gt;Strong product, data, and analytics intuition&lt;br&gt;&lt;br&gt;Intensely curious about data and love finding hidden relationships and patterns&lt;br&gt;&lt;br&gt;Passionate about health and wellness&lt;br&gt;&lt;br&gt;Strong cross-functional experience working with product, business, design, and engineering teams&lt;br&gt;&lt;br&gt;Strong interpersonal skills&lt;br&gt;&lt;br&gt;Proven experience boiling down technical approaches and complex findings into simple and compelling narratives that drive change&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Description&lt;br&gt;&lt;/strong&gt; &lt;br&gt;As a key member of the Health Strategic Initiatives team you will work cross functionally providing insights that drive feature innovation and development, product personalization, program and feature evaluation, marketing insights, and understanding customer behavior. You will have the opportunity to work with rich datasets to solve some of the most meaningful questions in health and wellness.&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Education &amp;amp; Experience&lt;br&gt;&lt;/strong&gt; &lt;br&gt;Masters (PhD preferred) in Computer Science, Economics, Engineering, Mathematics, Neuroscience, Psychology, Statistics, or equivalent and 5+ years of experience&lt;br&gt;&lt;br&gt; &lt;br&gt;Role Number: 200264842&lt;br&gt;&lt;br&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-19T18:26:02.000Z"
    },
    "company": {
        "name": "Apple",
        "link": "https://www.linkedin.com/company/apple"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Cupertino",
        "region": "CA",
        "postal_code": "95014",
        "street_address": null,
        "latitude": 37.319313,
        "longitude": -122.02927
    }
}