{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "",
        "description": "Morpheus Space is creating an ecosysyem for satellite mobility in space. Through a novel approach a new solution has been created to plan, manage and coordinate large networks (constellations) of satellites as one entity. Through deep reinforcement learning we are changing the way satellite missions are designed and operated.&lt;br&gt;&lt;br&gt;You will...&lt;br&gt; • … conduct ambitious product development in Reinforcement Learning and adaptive control that solves open problems of high practical and ethical value and validate it in real-world applications. &lt;br&gt;• ... collaborate with other researchers and engineers in a multidisciplinary team to discuss, develop and implement the product development agenda. &lt;br&gt;• … write code that will be used in the space industry on a large scale &lt;br&gt;• ... design and implement experiments to test research ideas on a variety of problems. &lt;br&gt;&lt;br&gt;Are you passionate about satellites, innovative technology and New Space? Do you want to be part of an international team and help shape the future of our planet as well as space? &lt;br&gt;We should get to know each other if you... &lt;br&gt;• … are a creative problem solver who can use every asset at their disposal &lt;br&gt;• ... have experience solving analytical problems using quantitative approaches &lt;br&gt;• ... have experience coding in C++, Python, Java or other similar language &lt;br&gt;• … have published at high-impact conferences/journals (e.g., CoRL, ICLR, NeurIPS, ICML, UAI, RSS, ICRA, COLT, CDC, L4DC, CVPR, ICCV, ECCV, PAMI, IJCV, etc.) &lt;br&gt;• ... have work authorization in US &lt;br&gt;• ... are a team player, like to solve problems independently and reliably and bring in new ideas &lt;br&gt;• … are willing to revolutionize the space industry",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-28T14:19:53.000Z"
    },
    "company": {
        "name": "Morpheus Space",
        "link": "https://de.linkedin.com/company/morpheus-space"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}