{
    "job": {
        "title": "Systems Software Engineer",
        "industry": "Consumer Electronics",
        "description": "&lt;br&gt;&lt;strong&gt;Summary&lt;br&gt;&lt;/strong&gt; &lt;br&gt;The team is looking for a skilled and motivated engineer that wants to be part of a team that will drive the development of all new Home and Audio products. The ideal candidate would be a skilled SW generalist with a great investigative attitude and strong sense of curiosity. Previous experience in working on large scale projects is a great plus as well as having a full understanding of the overall system. In addition, experience on product lifecycle from conception through shipping is required. Specifically, his/her responsibilities will span from writing and debugging SW specific to a product (communication services, drivers, UI etc) to efficiently integrate general platform services provided by other teams.&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Key Qualifications&lt;br&gt;&lt;/strong&gt; &lt;br&gt;You will have more than 7+ years hands on experience on integration of medium/large projects based on a full OS: Linux, Android, or BSD. &lt;br&gt;&lt;br&gt;You will be proficient in C and C++ with both kernel and user space programming. &lt;br&gt;&lt;br&gt;Strong experience in debugging complex systems fundamental. &lt;br&gt;&lt;br&gt;Experience in large scale production support is a plus. Ability to easily and quickly move between different areas is a big plus. &lt;br&gt;&lt;br&gt;Experience working on cross functional projects between Engineering, QA, operations would be a huge plus. &lt;br&gt;&lt;br&gt;May require some travel to china for factory support.&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Description&lt;br&gt;&lt;/strong&gt; &lt;br&gt;This is a highly technical role. The Product Development will directly maintain a number of product specific services such as UI, Power management tuning, system control and drivers but the team is fundamentally responsible for the overall SW running on a product and the successful integration of the full device. This team will work with a large number of Engineering teams (HW and SW) and QA to analyze global failures and act as first responders as well as own the full lifecycle of a product.&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Education &amp;amp; Experience&lt;br&gt;&lt;/strong&gt; &lt;br&gt;BS/CS/EE/CE or relevant work experience&lt;br&gt;&lt;br&gt; &lt;br&gt;Role Number: 200248125&lt;br&gt;&lt;br&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-09T19:59:21.000Z"
    },
    "company": {
        "name": "Apple",
        "link": "https://www.linkedin.com/company/apple"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 84,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Culver City",
        "region": "CA",
        "postal_code": "90232",
        "street_address": null,
        "latitude": 34.0225,
        "longitude": -118.39429
    }
}