{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "Telecommunications,Hospital &amp; Health Care,Information Technology and Services",
        "description": "&lt;p&gt;&lt;strong&gt;(SRE) Site Reliability Engineer &lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;100% Remote &lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Desired Skills and Experience&amp;nbsp;*&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;Strong Kubernetes development experience - creating, deploying and running clusters&lt;/p&gt;&lt;p&gt;Strong experience working with Elastic Search, Prometheus, ELK, Kibana, or Grafana tools for LMA&lt;/p&gt;&lt;p&gt;Strong experience with Python OR Golang development&lt;/p&gt;&lt;p&gt;Experience monitoring cloud platforms (NOT apps/infrastructure on-premise)&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Day-to-Day&amp;nbsp;*&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;An employer is looking for a Senior Site Reliability Engineer to join their Cloud Platforms organization. This organization delivers a private cloud responsible for hosting business critical workloads, such as 5G and other network functions. The Cloud Platforms Development organization is responsible for integrating several open source services and tools to provide this cloud infrastructure at telecom scale. Team members can expect to work with technologies such as Kubernetes, Airship, Openstack, Python, Golang, and many more. The development organization is made up of many scrum teams and offers the opportunity to be involved in solving a diverse set of technological challenges, including Baremetal Cloud Provisioning, supporting CICD for a large-scale development organization, Site Reliability Engineering, or working to ensure the program’s logging/monitoring/alerting system is operating efficiently and effectively. The development teams in this organization operate at a fast pace and work diligently to stay on the cutting edge of software engineering technologies, principles, and methodologies.&lt;/p&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-13T17:44:18.000Z"
    },
    "company": {
        "name": "Insight Global",
        "link": "https://www.linkedin.com/company/insight-global"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}