{
    "job": {
        "title": "Site Reliability Engineer ( SRE )",
        "industry": "Consumer Electronics",
        "description": "&lt;br&gt;&lt;strong&gt;Summary&lt;br&gt;&lt;/strong&gt; &lt;br&gt;The Site Reliability Engineer (SRE) position requires a mix of strategic engineering and design along with hands-on, technical work. An ideal candidate will have experience in being a Systems Administrator that has moved on to DevOps/Automation in their career, and have coding skills to automate tasks and build tools to help with our service operations. The SRE will configure, tune, and troubleshoot multi-tiered systems to achieve optimal application performance, stability and availability. The SRE will work closely with the software engineers, infrastructure and network engineers to deploy and maintain our services.&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Key Qualifications&lt;br&gt;&lt;/strong&gt; &lt;br&gt;* Strong sense of ownership, customer service, and integrity demonstrated through clear communication.&lt;br&gt;&lt;br&gt;* Deep understanding of the Linux and system administration at large-scale&lt;br&gt;&lt;br&gt;* Understanding of standard networking protocols and components such as: HTTP, DNS, TCP/IP, the OSI Model, Subnetting and Load Balancing strategies.&lt;br&gt;&lt;br&gt;* Coding experience using a high-level programming language like: Java, Ruby, Python, PHP, Perl or C.&lt;br&gt;&lt;br&gt;* Experience with Kubernetes is a plus, but not required&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Description&lt;br&gt;&lt;/strong&gt; &lt;br&gt;The successful candidate will be highly self-motivated with a passion for excellence, quality and attention to detail. The SRE will work on automation, deployments, aid in architectural design and work closely with the development engineers within the team to assist with the implementation of complex features. Responsibilities of the SRE include the following: - Passion for quality and automation, an ability to understand complex systems and a desire to constantly make things better. - Determine optimal configurations for application software, application servers, database connections and indexes, etc. - Develop and maintain scripts used for environment monitoring and task automation (Perl, Shell, PHP, etc.) - Experience setting up and managing monitoring tools such as Graphite, Prometheus, InfluxDB, Grafana - Set priorities and work efficiently in a fast-paced environment - Measure and optimize system performance - Plan and manage capacity of the systems - Explore and evaluate new technologies and solutions to push the capabilities forward, getting ahead of customers’ needs, innovate and continually improve - Strong communication skills and ability to work effectively across multiple business and technical teams - Demonstrate ability to deliver results on time with high quality - Experience with Docker, Spinnaker, Kubernetes and AWS is a plus.&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Education &amp;amp; Experience&lt;br&gt;&lt;/strong&gt; &lt;br&gt;Bachelor’s degree in Computer Science or equivalent industry experience&lt;br&gt;&lt;br&gt; &lt;br&gt;Role Number: 200257199&lt;br&gt;&lt;br&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-30T09:37:22.000Z"
    },
    "company": {
        "name": "Apple",
        "link": "https://www.linkedin.com/company/apple"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Cupertino",
        "region": "CA",
        "postal_code": "95014",
        "street_address": null,
        "latitude": 37.319313,
        "longitude": -122.02927
    }
}