{
    "job": {
        "title": "Software Engineer",
        "industry": "",
        "description": "&lt;p&gt;&lt;strong&gt;Looking for a career with a great Company? Lighthouse Worldwide Solutions has a great opportunity for you! We are seeking a dynamic Software Engineer II (embedded web) to add to our team LWS!&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Qualified candidates &lt;/strong&gt;must have an outstanding work ethic, be self-motivated and have a “can do/get it done” teamwork and positive attitude. Are you a web developer interested in working in embedded applications? The ideal candidate for this role will have software engineering experience with a desire to work with hardware. Competitive wages and benefits! Great team! Great culture and benefits!&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Employer Matched&lt;/strong&gt; 401 k! Sick and Vacation! Health benefits! (Vision, medical, dental, disability and life insurance) &lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Founded in 1982&lt;/strong&gt;, Lighthouse Worldwide Solutions is the world’s leading supplier of real time contamination monitoring systems and airborne particle counters. Lighthouse offers the most complete line of contamination monitoring solutions available that include Airborne Particle Counters, Microbial Samplers and Liquid Particle Counters, as well as Temperature / Humidity sensors. These solutions are now found in semiconductor, pharmaceutical, data storage, biotechnology, aerospace and defense industry plants worldwide.&lt;/p&gt;&lt;p&gt;About the Job: This position is responsible for applying knowledge of engineering principles to design, develop and tests all aspects of software systems. Will use computer-assisted engineering design software and equipment to perform assignments. Applies principles and techniques of software engineering to accomplish goals. May be involved with activities of fabrication, operation, application, installation, and repair of software products and systems. Relies on experience and judgment to plan and accomplish goals. Works under general supervision and follows instructions and pre-established guidelines as defined by their supervisor.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Essential Job Duties and Responsibilities: &lt;/strong&gt;&lt;/p&gt;&lt;p&gt;- Design, develop, build, and test high quality code&lt;/p&gt;&lt;p&gt;- Expertise and hands on experience with Web Applications and programming languages such as HTML, CSS, JavaScript, and API’s.&lt;/p&gt;&lt;p&gt;- Expertise in C# and .NET development.&lt;/p&gt;&lt;p&gt;- Develop design tools to support product development efforts.&lt;/p&gt;&lt;p&gt;- Collaborate with multi-discipline engineering teams to design and develop new products&lt;/p&gt;&lt;p&gt;- Uses engineering methodology and procedures to apply principles to design and development project per company SOP.&lt;/p&gt;&lt;p&gt;- The above listing represents the general duties considered essential functions of the job and is not to be considered a detailed description of all the work requirements that may be inherent in the position.&lt;/p&gt;&lt;p&gt;- Other general duties as assigned.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Minimum Requirements, Skills and Qualifications:&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;- B.S. in Engineering or Computer Science and 4 years of experience in a related field; or equivalent&lt;/p&gt;&lt;p&gt;- Strong knowledge of Javascript/Typescript, HTML, CSS&lt;/p&gt;&lt;p&gt;- Strong knowledge of Windows application development.&lt;/p&gt;&lt;p&gt;- Experience using version control tools such as Git&lt;/p&gt;&lt;p&gt;- Ability to read, understand, and modify system diagrams&lt;/p&gt;&lt;p&gt;- Must have a great “can do” attitude.&lt;/p&gt;&lt;p&gt;- Outstanding problem-solving resolution and attention to detail, willing to lead by example.&lt;/p&gt;&lt;p&gt;- Strong verbal and written communication skills.&lt;/p&gt;&lt;p&gt;- Outstanding work ethic, organizational and multi-tasking skills.&lt;/p&gt;&lt;p&gt;- Takes initiative and works well independently.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Preferred Skills and Qualifications:&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;- Embedded application experience.&lt;/p&gt;&lt;p&gt;- Experience working with firmware teams to develop communication protocols&lt;/p&gt;&lt;p&gt;- Web development and/or web development in embedded systems.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;EEO Statement: Lighthouse Worldwide Solutions is an Equal Opportunity Employer. All qualified applicants will be considered for employment without regard to race, age, color, sex, religion, national origin, marital status, ancestry, citizenship, veteran status, sexual orientation or preference, or disability status.&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;&lt;p&gt;CANDIDATES SUBJECT TO PRE-EMPLOYMENT BACKGROUND SCREENING Email resume and cover letter to humanresources@golighthhouse.com&lt;/p&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-12T22:15:51.000Z"
    },
    "company": {
        "name": "Lighthouse Worldwide Solutions",
        "link": "https://www.linkedin.com/company/lighthouse-worldwide-solutions"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Medford-Grants Pass Area",
        "region": null,
        "postal_code": "97501",
        "street_address": null,
        "latitude": 42.297127,
        "longitude": -122.8429
    }
}