{
    "job": {
        "title": "Senior Software Engineer-1- Cloud Technologies",
        "industry": "Information Technology and Services,Retail,Financial Services",
        "description": "&lt;strong&gt;&lt;u&gt;Position Summary... What You'll Do...&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;Leads and participates in medium- to large-scale projects by reviewing project requirements; translating requirements into technical solutions; gathering requested information (for example, design documents, product requirements, wire frames); writing and developing code; conducting unit testing; communicating status and issues to team members and stakeholders; collaborating with project team and cross functional teams; troubleshooting open issues and bug-fixes; ensuring on-time delivery and hand-offs; interacting with project manager to provide input on project plan; and providing leadership to the project team.&lt;br&gt;&lt;br&gt;Leads the work of other small groups of four to six engineers, including offshore associates, for assigned Engineering projects by proving pertinent documents, direction, and examples; identifying short and long term solutions and timeline; reviewing and providing feedback for proposed solutions; and performing design and code reviews of changes.&lt;br&gt;&lt;br&gt;Troubleshoots business and production issues by gathering information (for example, issue, impact, criticality, possible root cause); engaging support teams to assist in the resolution of issues; formulating an action plan; performing actions as designated in the plan; interpreting the results to determine further action; performs root cause analysis to prevent future occurrence of issues; and completing online documentation.&lt;br&gt;&lt;br&gt;Provides support to the business by responding to user's questions, concerns, and issues (for example, technical feasibility, implementation strategies); identifying short- and long-term solutions; facilitating resolutions; and leading cross-functional partnership.&lt;br&gt;&lt;br&gt;Leads the discovery phase of medium to large projects to come up with high level design by partnering with the product management, project management, business and user experience teams; and obtaining cross-function approvals.&lt;br&gt;&lt;br&gt;Demonstrates up-to-date expertise and applies this to the development, execution, and improvement of action plans by providing expert advice and guidance to others in the application of information and best practices; supporting and aligning efforts to meet customer and business needs; and building commitment for perspectives and rationales.&lt;br&gt;&lt;br&gt;Provides and supports the implementation of business solutions by building relationships and partnerships with key stakeholders; identifying business needs; determining and carrying out necessary processes and practices; monitoring progress and results; recognizing and capitalizing on improvement opportunities; and adapting to competing demands, organizational changes, and new responsibilities.&lt;br&gt;&lt;br&gt;Models compliance with company policies and procedures and supports company mission, values, and standards of ethics and integrity by incorporating these into the development and implementation of business plans; using the Open Door Policy; and demonstrating and assisting others with how to apply these in executing business processes and practices.&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;Preferred Qualifications&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;Master's degree in Computer Science or related field and 2 years experience in software engineering or related field.&lt;/li&gt;&lt;li&gt;Role is focused on guiding and assisting application development teams in architecting for and choosing appropriate cloud options.&lt;/li&gt;&lt;li&gt;Azure, OpenStack, Google Cloud, Kubernetes, and Cloud deployment experience.&lt;/li&gt;&lt;/ul&gt; Minimum Qualifications...&lt;br&gt;&lt;br&gt;&lt;em&gt;&lt;em&gt;Outlined below are the required minimum qualifications for this position. If none are listed, there are no minimum qualifications. &lt;br&gt;&lt;br&gt;&lt;/em&gt;&lt;/em&gt;Bachelor’s degree in Computer Science and 3 years’ experience in software engineering or related field OR 5 years’ experience in software&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;Engineering Or Related Field. Preferred Qualifications...&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;em&gt;&lt;em&gt;Outlined below are the optional preferred qualifications for this position. If none are listed, there are no preferred qualifications. &lt;br&gt;&lt;br&gt;&lt;/em&gt;&lt;/em&gt;Master’s degree in Computer Science or related field and 2 years' experience in software engineering or related field Primary Location...805 SE MOBERLY LN, BENTONVILLE, AR 72712, United States of America",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-30T05:15:12.000Z"
    },
    "company": {
        "name": "Walmart",
        "link": "https://www.linkedin.com/company/walmart"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Bentonville",
        "region": "AR",
        "postal_code": "72716",
        "street_address": null,
        "latitude": 36.37187,
        "longitude": -94.20272
    }
}