{
    "job": {
        "title": "Software Engineer - Early Career",
        "industry": "Defense &amp; Space",
        "description": "Going to space is just the beginning. It’s what you do when you get there that matters. Lockheed Martin builds satellites and spacecraft that do amazing things in space for government and commercial customers. Connecting people. Advancing discovery. And protecting what matters most. Lockheed Martin-built satellites give earlier warning of severe weather, connect troops on the battlefield, and deliver GPS directions to a billion people worldwide.&lt;br&gt;&lt;br&gt;As we look to the future, we’re driving innovations to help our customers do even more in orbit. That’s why we’re crafting smarter satellites that operate like smartphones in the sky, with apps that can be updated in orbit so they can adapt as mission needs on the ground change. Your mission is ours. And as that mission evolves, we’ll be ready. Will you? What does this role look like?&lt;br&gt;&lt;br&gt;As a Software Engineer for Special Programs APD-ME, you will join a multi-discipline team executing activities required to design and deliver mission processing apps. APD-ME has been accelerating development of new apps to meet critical mission needs of our customers. You will be responsible for the design, development, integration and testing of new apps as well as the operations and maintenance of existing apps. You will also work collaboratively in product teams to successfully deliver mission processing apps to Ops.&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;Software Engineer Responsibilities Will Include&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt; Designs, develops, documents, tests, and debugs software that contains logical and mathematical solutions to business/mission problems or questions in computer language for solutions by means of data processing equipment&lt;/li&gt;&lt;li&gt; Applies the appropriate standards, processes, procedures, and tools throughout the development life cycle&lt;/li&gt;&lt;li&gt; Applies knowledge of computer hardware and software, subject matter to be programmed in business/mission applications, information processing techniques used, and information gathered from system users to develop software&lt;/li&gt;&lt;li&gt; Corrects program errors, prepares operating instructions, compiles documentation of program development, and analyzes system capabilities to resolve questions of program intent, output requirements, input data acquisition, programming techniques, and controls&lt;/li&gt;&lt;/ul&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-02T20:53:24.000Z"
    },
    "company": {
        "name": "Lockheed Martin",
        "link": "https://www.linkedin.com/company/lockheed-martin"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Littleton",
        "region": "CO",
        "postal_code": "80018",
        "street_address": null,
        "latitude": 39.61265,
        "longitude": -105.0162
    }
}