{
    "job": {
        "title": "Sr. Cyber Engineer II",
        "industry": "Internet",
        "description": "Raytheon IIS is looking for a highly motivated Cybersecurity Engineer to support the secure design, development, evaluation, and authorization of information systems, complex interconnected WANs/LANs, and development/test labs. This role will analyze customer security requirements, evaluate network security architectures, implement security controls, and integrate systems into customer operational networks. The candidate will be involved in all aspects of security engineering, as well as aspects of system assessment and authorization activities. The candidate will ensure approval processes are followed and validate security control implementations on system assets, including routers, switches, firewalls, servers, operating systems, applications, and other assets, using DoD field security operations (FSO) required network security scanning and assessment tools, including ACAS, STIGs, SCAP, eMASS and procedural knowledge of SCIF security. The work will be performed at the Dulles, VA location or at customer sites. Additional responsibilities include, but are not limited to, the following: Coordination with DOD customers on risk management, emerging technologies and threats, and system Assessment and Authorization Security assessments to determine compliance with NIST RMF Investigations of computer security violations and incidents Occasional travel for company business - during deliverables travel requirements would be higher Minimum Required Skills: 5 years relevant cyber security experience Experience with securely configuring and auditing various operating systems (eg, Windows, Linux, UNIX, Mac OS, VMware), applications, databases, VPNs, firewalls, IDS/IPS Knowledge of network engineering design and systems security engineering concepts, including topology, DMZs, wired and wireless protocols, Active Directory, DNS, firewalls, TCP/IP, VMware, IDS/IPS, IPSEC VPN Gateway Experience supporting US Government agencies Vulnerability assessment and analysis experience utilizing Assured Compliance Assessment Solution (ACAS) and DISA STIGs Strong grasp of network, operating system and application security Experienced with the DoD 8500.2, NIST800-53r4 A&amp;amp;A, NIST RMF, and DOD PKI/PKE Desired Skills: CompTIA Security certification or CISSP Experience managing classified laboratory environments Experience with security event management, PKI, Wireshark, Cisco firewalls Certifications in Red Hat, VMware, Microsoft, and Cisco Excellent project management, organizational, and customer service skills Excellent oral and written communications skills Good electronic research skills using search tools, databases, and similar sources to support various customer programs and projects Security Clearance: Active SECRET, capable of being cleared for Special Access Programs (SAP) Required Education: BS/BA degree is required. Preference for a STEM degree in any of the following: Cyber Security, Information Technology, Computer Science, Computer Engineering, Information Assurance, Information System This position requires either a US Person or a Non-U.S. Person who is eligible to obtain any required Export Authorization. 183360 Raytheon is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, creed, sex, sexual orientation, gender orientation, gender identity, national origin, disability, or protected Veteran status.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-01T06:41:38.000Z"
    },
    "company": {
        "name": "JobGet",
        "link": "https://www.linkedin.com/company/jobget"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Chantilly",
        "region": "VA",
        "postal_code": "22022",
        "street_address": null,
        "latitude": 38.888687,
        "longitude": -77.417496
    }
}