{
    "job": {
        "title": "Software Engineer, New Grad",
        "industry": "Computer Software,Internet,Financial Services",
        "description": "Level makes benefits as simple as paying with cash, starting with insurance. To make this possible, we're rebuilding every part of benefits so everyone wins. Employers can offer bigger benefits for far less, members get more freedom and choice, and providers are paid instantly.&lt;br&gt;&lt;br&gt;At our core, Level is a fintech company with a diverse team from industry-leading companies like Square, Oscar, Uber, and ZocDoc. We're backed by Khosla Ventures, Lightspeed Ventures, First Round, Homebrew, BoxGroup, and Precursor Ventures. Dental and vision is just the start. There's so much more to come in helping employers and their teams get more from their benefit dollars through fast, flexible spending.&lt;br&gt;&lt;br&gt;&lt;strong&gt;What You'll Do: &lt;br&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;Learn how to design thoughtful APIs that enable members, employers, and dentists to interact with Level in real-time&lt;/li&gt;&lt;li&gt;Work on building the data model our platform will use to organize information about members, dentists, and employers&lt;/li&gt;&lt;li&gt;Build features for our web and mobile applications so members can easily understand their benefits and access care&lt;/li&gt;&lt;li&gt;Help launch additional product lines by collaborating with the product, design, actuarial, sales, and operations teams&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;Who You Are:&lt;br&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;Completed computer science projects before and are comfortable discussing them&lt;/li&gt;&lt;li&gt;B.A. or B.S. in Engineering, Math, Computer Science or related field&lt;/li&gt;&lt;li&gt;Experience with one server-side language (Go, Java, Python, etc.) or client-side language (Android, iOS, React, Ember, Angular, Vue, Javascript, Typescript, Swift, Objective-C, Java, Kotlin, etc.)&lt;/li&gt;&lt;li&gt;Ability to multitask in a constantly changing environment.. Context switching across multiple product lines. &lt;/li&gt;&lt;li&gt;Self driven with a mindset towards taking action &lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;What We Offer: &lt;br&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;Have the chance to work at a leading innovator and trailblazer in the world of insurance and payments.&lt;/li&gt;&lt;li&gt;Competitive salary and equity&lt;/li&gt;&lt;li&gt;100% paid medical for you and 80% for your dependents, 100% covered dental and vision through Level for you and your dependents&lt;/li&gt;&lt;li&gt;Flexible vacation policy - take the time you need when you need it!&lt;/li&gt;&lt;li&gt;Fully Paid Parental leave for 3 months&lt;/li&gt;&lt;li&gt;Quarterly Company sponsored events&lt;/li&gt;&lt;li&gt;Internal learning and development programs&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;Level is proud to be an Equal Opportunity Employer. We celebrate diversity and are committed to creating a welcoming and inclusive environment for all. Please apply to this role if you feel you are a good fit, regardless of your race, color, religion, gender identity, sex, sexual preference, sexual identity, pregnancy, national origin, ancestry, citizenship, age, marital status, physical disability, mental disability, medical condition, military status, or any other perceived limiting factor. We welcome applicants from all walks of life.&lt;br&gt;&lt;br&gt;E-Verify Program Participant: Level participates in the Department of Homeland Security U.S. Citizenship and Immigration Services' E-Verify program (For U.S. based applicants and employees only). Please click below to learn more about the E-Verify program:&lt;br&gt;&lt;ul&gt;&lt;li&gt;E-Verify Notice (bilingual)&lt;/li&gt;&lt;li&gt;Right to Work Notice (English) / (Spanish)&lt;/li&gt;&lt;/ul&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-13T05:18:50.000Z"
    },
    "company": {
        "name": "Level",
        "link": "https://www.linkedin.com/company/joinlevel"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}