{
    "job": {
        "title": "Prin Eng, Cyber Engrg",
        "industry": "Internet",
        "description": "Raytheon is a premier engineering company which provides technical solutions in software development and systems engineering that address security challenges and strengthen our customers. Raytheon hires industry-leading professionals, and we treat them like industry-leading professionals. We bring exceptional talent to an array of missions that includes computer network operations, vulnerabilities, characterization, information assurance, and emerging technologies to expand cybersecurity solutions. Job Description : CNO Software development using Agile methodologies and C/C++/Python CNO Capability and infrastructure integration on Windows and Linux targets On-site technical support Liaison between technical customer contacts and remote engineering team Program analysis and support, steering future program direction Requirements: A successful candidate in this position will be both an individual contributor to the program and serve as a liaison interacting with technical support and operational users of the framework and system. Individual contribution to the program includes software engineering tasks related to CNO framework development and other CODEX products, including foundational tools, capabilities, and exploits. As a customer liaison, the candidate will become familiar with the program's product and be able to provide guidance to users about the operation and management of the system. The candidate will further be responsible for on-site troubleshooting and identification of bugs or areas where the user experience may need improvement. The candidate will need to be comfortable working with Classification Advisory Officers to review requirements, bug reports, and customer feedback for communication to remote team members. The candidate will also identify opportunities for synergies between CODEX products and the customer's infrastructure, and provide feedback as to future business development activities. The candidate should have experience with CNO/Cyber operations and development. Fluency in Python, Linux system administration on the command line, and excellent documentation skills are required. Strong communication skills are required as this role will allow the candidate to steer our team's direction with the customer through face to face support, requirements analysis, and interaction. In addition, the candidate should have some exposure to agile software development, to include requirements definition, code reviews, product planning, and retrospectives. Qualified applicants subject to a US Government security background investigation and must meet minimum eligibility requirements for access to classified information. US Citizenship and an active TS/SCI with polygraph required. 174230 Raytheon is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, creed, sex, sexual orientation, gender orientation, gender identity, national origin, disability, or protected Veteran status.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-01T06:41:34.000Z"
    },
    "company": {
        "name": "JobGet",
        "link": "https://www.linkedin.com/company/jobget"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Linthicum Heights",
        "region": "MD",
        "postal_code": "21090",
        "street_address": null,
        "latitude": 39.195045,
        "longitude": -76.68526
    }
}