{
    "job": {
        "title": "Data Scientist",
        "industry": "Banking,Financial Services,Investment Banking",
        "description": "Job Id: 21342737&lt;br&gt;&lt;br&gt;We are looking to hire a &lt;u&gt;Data Scientist&lt;/u&gt; specializing in data analysis to join the Citi Research Operations Team. The successful candidate will work with the team and perform data analysis on proprietary datasets highlighting trends and developing models to forecast behavior. The Data Scientist will be responsible for a wide range of analytical tasks including data exploration and visualization, trend forecasting on time series data, regression analysis, and machine learning tasks such as classification and clustering. The Data Scientist will be working with Senior Analysts based in different regions on requirements, building out project requirements and providing the results to the stake holders. The candidate will be part of a global team, strategically located in New York.&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;Responsibilities:&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;Understand the Citi Research business and its drivers&lt;/li&gt;&lt;li&gt;Engage with all stakeholders for Citi Research projects to collect feedback, build-out requirements and prioritize system enhancements&lt;/li&gt;&lt;li&gt;Act as a resource to Analyst teams in developing, analyzing, and visualizing new proprietary datasets&lt;/li&gt;&lt;li&gt;Translate business needs into specific analytical questions&lt;/li&gt;&lt;li&gt;Support decision making by communicating technical requirements to peers and management&lt;/li&gt;&lt;li&gt;Improve on existing statistical methodologies and models&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;&lt;u&gt;Qualifications:&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;3-5 years of experience working in Python (R is a plus)&lt;/li&gt;&lt;li&gt;2+ years of experience working with SQL databases&lt;/li&gt;&lt;li&gt;Experience working with time series forecasting methods&lt;/li&gt;&lt;li&gt;Experience wrangling and cleansing large datasets&lt;/li&gt;&lt;li&gt;Experience with machine learning methods including regression analysis, classification, and unsupervised modeling&lt;/li&gt;&lt;li&gt;Ability to structure project workflow from gathering requirements to model building and data delivery&lt;/li&gt;&lt;li&gt;Ability to create effective and interpretable data visualizations&lt;/li&gt;&lt;li&gt;Self-starter and driven; able to work independently with little guidance&lt;/li&gt;&lt;li&gt;Effective communicator with both technical and non-technical peers and managers&lt;/li&gt;&lt;li&gt;Experience with NLP a plus&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;&lt;u&gt;Education:&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;Bachelor’s/University degree, Master’s degree preferred&lt;br&gt;&lt;/li&gt;&lt;/ul&gt;This job description provides a high-level review of the types of work performed. Other job-related duties may be assigned as required.&lt;br&gt;&lt;br&gt;-------------------------------------------------&lt;br&gt;&lt;br&gt;&lt;strong&gt;Job Family Group: &lt;br&gt;&lt;br&gt;&lt;/strong&gt;Research&lt;br&gt;&lt;br&gt;-------------------------------------------------&lt;br&gt;&lt;br&gt;&lt;strong&gt;Job Family:&lt;br&gt;&lt;br&gt;&lt;/strong&gt;Research Product&lt;br&gt;&lt;br&gt;------------------------------------------------------&lt;br&gt;&lt;br&gt;&lt;strong&gt;Time Type:&lt;br&gt;&lt;br&gt;&lt;/strong&gt;Full time&lt;br&gt;&lt;br&gt;------------------------------------------------------&lt;br&gt;&lt;br&gt;Citi is an equal opportunity and affirmative action employer.&lt;br&gt;&lt;br&gt;Qualified applicants will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.&lt;br&gt;&lt;br&gt;Citigroup Inc. and its subsidiaries (\"Citi”) invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review &lt;strong&gt;Accessibility at Citi&lt;/strong&gt;.&lt;br&gt;&lt;br&gt;View the \"&lt;strong&gt;EEO is the Law&lt;/strong&gt;\" poster. View the &lt;strong&gt;EEO is the Law Supplement&lt;/strong&gt;.&lt;br&gt;&lt;br&gt;View the &lt;strong&gt;EEO Policy Statement&lt;/strong&gt;.&lt;br&gt;&lt;br&gt;View the &lt;strong&gt;Pay Transparency Posting&lt;/strong&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-02T00:00:00.000Z"
    },
    "company": {
        "name": "Citi",
        "link": "https://www.linkedin.com/company/citi"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}