{
    "job": {
        "title": "Data Scientist",
        "industry": "Consumer Electronics",
        "description": "&lt;br&gt;&lt;strong&gt;Summary&lt;br&gt;&lt;/strong&gt; &lt;br&gt;Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.&lt;br&gt;&lt;br&gt;&lt;br&gt;We are seeking an experienced data scientist to join the Business Solutions team. An expert in advanced analytics, you are passionate about turning data into impactful insights, and driving creative data science solutions. You are skilled at creating analytical models and interactive visualizations. You are a motivated self-starter, comfortable navigating through ambiguity to evaluate complex data, analyze data from multiple angles, build analytical workflows, and use data science models to deliver findings that directly impact the business. If this describes you, then you should consider joining our team.&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Key Qualifications&lt;br&gt;&lt;/strong&gt; &lt;br&gt;• Experienced in data science, machine learning, visualization, and data storytelling; passionate about drawing insights and hidden patterns from data&lt;br&gt;&lt;br&gt;• Meticulous attention to detail, data integrity, and data wrangling&lt;br&gt;&lt;br&gt;• Skilled in Python or R for data science, and SQL for querying data&lt;br&gt;&lt;br&gt;• Highly proficient in Tableau or similar BI tools&lt;br&gt;&lt;br&gt;• Ability to articulate complex data science concepts in business terms, know how to tell a story to highlight key insights, and present analysis effectively to key partners&lt;br&gt;&lt;br&gt;• High intellectual curiosity to learn and understand business needs&lt;br&gt;&lt;br&gt;• Excellent interpersonal skills to collaborate with cross-functional partners to share knowledge, communicate findings, and integrate feedback&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Description&lt;br&gt;&lt;/strong&gt; &lt;br&gt;The ideal candidate will have outstanding communication skills, proven data science and advanced analytics capabilities, strong business acumen, and an innate drive to deliver results. They will be a self-starter, comfortable with ambiguity, and enjoy working in a fast-paced dynamic environment.&lt;br&gt;&lt;br&gt;Key Responsibilities:&lt;br&gt;&lt;br&gt;• Develop custom models, algorithms, and interactive visualizations to deliver Supply Chain insights &lt;br&gt;&lt;br&gt;• Wrangle and analyze data to identify patterns and trends&lt;br&gt;&lt;br&gt;• Evaluate business needs through in-depth conversations with business users to understand the domain and apply data science for insights&lt;br&gt;&lt;br&gt;• Research and evaluate new technologies on data visualization, machine learning, modeling&lt;br&gt;&lt;br&gt;• Present key findings to leadership to evaluate business impact, in non-technical terms&lt;br&gt;&lt;br&gt; &lt;br&gt;&lt;strong&gt;Education &amp;amp; Experience&lt;br&gt;&lt;/strong&gt; &lt;br&gt;• MS degree in Data Science, Business Analytics, Statistics, or related fields&lt;br&gt;&lt;br&gt; &lt;br&gt;Role Number: 200246788&lt;br&gt;&lt;br&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-26T23:26:57.000Z"
    },
    "company": {
        "name": "Apple",
        "link": "https://www.linkedin.com/company/apple"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Cupertino",
        "region": "CA",
        "postal_code": "95014",
        "street_address": null,
        "latitude": 37.319313,
        "longitude": -122.02927
    }
}