{
    "job": {
        "title": "Software R&amp;D Engineer",
        "industry": "",
        "description": "&lt;p&gt;Software R&amp;amp;D Engineer&lt;/p&gt;&lt;p&gt;We are seeking aspiring Software R&amp;amp;D Engineers to join the Product Development and Research Teams at Delsys to help develop our signal acquisition and processing software for movement science and human health applications. Software R&amp;amp;D Engineers seek to deliver a seamless user experience across platforms while making impactful contributions to all elements of our research and product portfolios through the development of application interfacing strategies and design of data visualization tools.&lt;/p&gt;&lt;p&gt;Preference will be given to those that can demonstrate an aptitude for managing complex projects and have an ability to solve problems independently. Candidates who have developed their own applications, or have directly contributed to one in an impactful way are strongly urged to attach screenshots or submit a link to download the app.&lt;/p&gt;&lt;p&gt;Primary Responsibilities&lt;/p&gt;&lt;p&gt;• Design and implement software supporting our core product and research portfolios with applications in next-generation neural interface technology, computer vision algorithms for tracking human movement, and the development of augmentative and alternative communication systems&lt;/p&gt;&lt;p&gt;• Assist in the design and implementation of software projects to translate proven research concepts into real-world products in the marketplace&lt;/p&gt;&lt;p&gt;• Deliver sound and vetted software code&lt;/p&gt;&lt;p&gt;• Optimize time-critical algorithms for communications and control in distributed software systems&lt;/p&gt;&lt;p&gt;Required Qualifications&lt;/p&gt;&lt;p&gt;An ideal candidate will:&lt;/p&gt;&lt;p&gt;• Be currently enrolled in an undergraduate or graduate degree in computer engineering, computer science, or similar program&lt;/p&gt;&lt;p&gt;• Be fluent in a C#, or C++&lt;/p&gt;&lt;p&gt;• Strong object-oriented design skills&lt;/p&gt;&lt;p&gt;• Have experience with full stack development for Windows or Linux applications&lt;/p&gt;&lt;p&gt;&lt;br&gt;&lt;/p&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-15T15:53:53.000Z"
    },
    "company": {
        "name": "Delsys, Inc",
        "link": "https://www.linkedin.com/company/delsys-inc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Greater Boston",
        "region": null,
        "postal_code": "02119",
        "street_address": null,
        "latitude": 42.36041,
        "longitude": -71.05798
    }
}