{
    "job": {
        "title": "Software Engineer - Back End",
        "industry": "Automotive,Renewables &amp; Environment,Utilities",
        "description": "This position is within our Applications Engineering organization, which is responsible for building Information Systems to support Tesla's rapid growth while providing amazing customer experience. The organization builds applications &amp;amp; systems that bring our amazing Vehicles &amp;amp; Energy products to customers. Some of the core functions include CRM, e-commerce, financial transactions, ERP &amp;amp; manufacturing.&lt;br&gt;&lt;br&gt;Digital Products Engineering, under the umbrella of Applications Engineering, builds our customer facing www.tesla.com that help our customers across 60+ countries understand our products, place and track the order status until delivery/install. The team also builds native and kiosk applications for our retail stores. In the backend, this team builds systems to manage our customer data, optimize schedule of service centers &amp;amp; installation crews and several core platforms (Document Management, Adaptive Surveys, API Gateways etc.)&lt;br&gt;&lt;br&gt;&lt;strong&gt;&lt;u&gt;Responsibilities&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;Design, development and implementation of applications for Tesla customers on features like referrals (Loot Box), service center appointment management and support content&lt;/li&gt;&lt;li&gt;Use .net framework, .net core and MS SQL technology stack&lt;/li&gt;&lt;li&gt;Design software architecture based on business requirements, strategy and priorities&lt;/li&gt;&lt;li&gt;Promote software engineering best practices via code reviews, building tools and documentation&lt;/li&gt;&lt;li&gt;Be nimble and react quickly to changing business conditions&lt;/li&gt;&lt;li&gt;Leverage your existing skills while learning and implementing new, open source technologies as Tesla grows&lt;/li&gt;&lt;li&gt;Work with product managers, content producers, QA engineers and release engineers to own your solution from development to production &lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;&lt;u&gt;Requirements&lt;br&gt;&lt;br&gt;&lt;/u&gt;&lt;/strong&gt;&lt;strong&gt;Must have&lt;br&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;BS in Computer Science or equivalent discipline&lt;/li&gt;&lt;li&gt;Some experience with the .NET platform &lt;/li&gt;&lt;li&gt;Experience in MS SQL Server is required and good knowledge in query optimization&lt;/li&gt;&lt;li&gt;Expert knowledge of REST APIs&lt;/li&gt;&lt;li&gt;Good unit testing and integration testing practices&lt;/li&gt;&lt;li&gt;Experience with message queue architecture &lt;br&gt;&lt;/li&gt;&lt;/ul&gt;&lt;strong&gt;Good to have&lt;br&gt;&lt;/strong&gt;&lt;ul&gt;&lt;li&gt;Exposure to Go, PHP, Java and other open source technologies&lt;/li&gt;&lt;li&gt;Experience with Docker and Kubernetes&lt;/li&gt;&lt;li&gt;Agile/SCRUM Software Development Process experience&lt;/li&gt;&lt;/ul&gt;",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-30T08:15:48.000Z"
    },
    "company": {
        "name": "Tesla",
        "link": "https://www.linkedin.com/company/tesla-motors"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Fremont",
        "region": "CA",
        "postal_code": "94537",
        "street_address": null,
        "latitude": 37.5502,
        "longitude": -121.98083
    }
}